RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * Copyright (C) 2023 BISSELL Homecare, Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     GD32E230.h
 * @brief    CMSIS HeaderFile
 * @note     Generated by SVDConv V3.3.44
 *           from File /Arm/Packs/GigaDevice/GD32E23x_DFP/1.0.3/SVD/GD32E230.svd
 */


/** @addtogroup
  * @{
  */


/** @addtogroup GD32E230
  * @{
  */


#ifndef GD32E23X_PERIPH_H
#define GD32E23X_PERIPH_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M23 Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  GD32E230 Specific Interrupt Numbers  ========================================== */
  WWDGT_IRQn                =   0,              /*!< 0  WWDGT                                                                  */
  LVD_IRQn                  =   1,              /*!< 1  LVD                                                                    */
  RTC_IRQn                  =   2,              /*!< 2  RTC                                                                    */
  FMC_IRQn                  =   3,              /*!< 3  FMC                                                                    */
  RCU_IRQn                  =   4,              /*!< 4  RCU                                                                    */
  EXTI0_1_IRQn              =   5,              /*!< 5  EXTI0_1                                                                */
  EXTI2_3_IRQn              =   6,              /*!< 6  EXTI2_3                                                                */
  EXTI4_15_IRQn             =   7,              /*!< 7  EXTI4_15                                                               */
  DMA_Channel0_IRQn         =   9,              /*!< 9  DMA_Channel0                                                           */
  DMA_Channel1_2_IRQn       =  10,              /*!< 10 DMA_Channel1_2                                                         */
  DMA_Channel3_4_IRQn       =  11,              /*!< 11 DMA_Channel3_4                                                         */
  ADC_CMP_IRQn              =  12,              /*!< 12 ADC_CMP                                                                */
  TIMER0_BRK_UP_TRG_COM_IRQn=  13,              /*!< 13 TIMER0_BRK_UP_TRG_COM                                                  */
  TIMER0_CC_IRQn            =  14,              /*!< 14 TIMER0_CC                                                              */
  TIMER2_IRQn               =  16,              /*!< 16 TIMER2                                                                 */
  TIMER5_IRQn               =  17,              /*!< 17 TIMER5                                                                 */
  TIMER13_IRQn              =  19,              /*!< 19 TIMER13                                                                */
  TIMER14_IRQn              =  20,              /*!< 20 TIMER14                                                                */
  TIMER15_IRQn              =  21,              /*!< 21 TIMER15                                                                */
  TIMER16_IRQn              =  22,              /*!< 22 TIMER16                                                                */
  I2C0_EV_IRQn              =  23,              /*!< 23 I2C0_EV                                                                */
  I2C1_EV_IRQn              =  24,              /*!< 24 I2C1_EV                                                                */
  SPI0_IRQn                 =  25,              /*!< 25 SPI0                                                                   */
  SPI1_IRQn                 =  26,              /*!< 26 SPI1                                                                   */
  USART0_IRQn               =  27,              /*!< 27 USART0                                                                 */
  USART1_IRQn               =  28,              /*!< 28 USART1                                                                 */
  I2C0_ER_IRQn              =  32,              /*!< 32 I2C0_ER                                                                */
  I2C1_ER_IRQn              =  34               /*!< 34 I2C1_ER                                                                */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ==========================  Configuration of the ARM Cortex-M23 Processor and Core Peripherals  =========================== */
#define __CM23_REV                 0x0000U      /*!< CM23 Core Revision                                                        */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 0        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm23.h"                          /*!< ARM Cortex-M23 processor and core peripherals                             */
#include "system_gd32e23x.h"                    /*!< GD32E230 System                                                           */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to digital converter (ADC)
  */

typedef struct {                                /*!< ADC Structure                                                             */

  union {
    __IOM uint32_t STAT;                        /*!< status register                                                           */

