RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t WDE        : 1;            /*!< Analog watchdog event flag                                                */
      __IOM uint32_t EOC        : 1;            /*!< End of group conversion flag                                              */
      __IOM uint32_t EOIC       : 1;            /*!< End of inserted group conversion flag                                     */
      __IOM uint32_t STIC       : 1;            /*!< Start flag of inserted channel group                                      */
      __IOM uint32_t STRC       : 1;            /*!< Start flag of regular channel group                                       */
            uint32_t            : 27;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t WDCHSEL    : 5;            /*!< Analog watchdog channel select                                            */
      __IOM uint32_t EOCIE      : 1;            /*!< Interrupt enable for EOC                                                  */
      __IOM uint32_t WDEIE      : 1;            /*!< Interrupt enable for WDE                                                  */
      __IOM uint32_t EOICIE     : 1;            /*!< Interrupt enable for EOIC                                                 */
      __IOM uint32_t SM         : 1;            /*!< Scan mode                                                                 */
      __IOM uint32_t WDSC       : 1;            /*!< When in scan mode, analog watchdog is effective on a single
                                                     channel                                                                   */
      __IOM uint32_t ICA        : 1;            /*!< Inserted channel group convert automatically                              */
      __IOM uint32_t DISRC      : 1;            /*!< Discontinuous mode on regular channels                                    */
      __IOM uint32_t DISIC      : 1;            /*!< Discontinuous mode on injected channels                                   */
      __IOM uint32_t DISNUM     : 3;            /*!< Number of conversions in discontinuous mode                               */
            uint32_t            : 6;
      __IOM uint32_t IWDEN      : 1;            /*!< Inserted channel analog watchdog enable                                   */
      __IOM uint32_t RWDEN      : 1;            /*!< Regular channel analog watchdog enable                                    */
      __IOM uint32_t DRES       : 2;            /*!< ADC resolution                                                            */
            uint32_t            : 6;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t ADCON      : 1;            /*!< ADC ON                                                                    */
      __IOM uint32_t CTN        : 1;            /*!< Continuous mode                                                           */
      __IOM uint32_t CLB        : 1;            /*!< ADC calibration                                                           */
      __IOM uint32_t RSTCLB     : 1;            /*!< Reset calibration                                                         */
            uint32_t            : 4;
      __IOM uint32_t DMA        : 1;            /*!< DMA request enable                                                        */
            uint32_t            : 2;
      __IOM uint32_t DAL        : 1;            /*!< Data alignment                                                            */
      __IOM uint32_t ETSIC      : 3;            /*!< External trigger select for inserted channel                              */
      __IOM uint32_t ETEIC      : 1;            /*!< External trigger enable for inserted channels                             */
            uint32_t            : 1;
      __IOM uint32_t ETSRC      : 3;            /*!< External trigger select for regular channel                               */
      __IOM uint32_t ETERC      : 1;            /*!< External trigger enable for regular channel                               */
      __IOM uint32_t SWICST     : 1;            /*!< Start on inserted channel                                                 */
      __IOM uint32_t SWRCST     : 1;            /*!< Start on regular channel                                                  */
      __IOM uint32_t TSVREN     : 1;            /*!< Channel 16 and 17 enable of ADC                                           */
            uint32_t            : 8;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SAMPT0;                      /*!< Sampling time register 0                                                  */

    struct {
            uint32_t            : 18;
      __IOM uint32_t SPT16      : 3;            /*!< Channel 16 sample time selection                                          */
      __IOM uint32_t SPT17      : 3;            /*!< Channel 17 sample time selection                                          */
            uint32_t            : 8;
    } SAMPT0_b;
  } ;

  union {
    __IOM uint32_t SAMPT1;                      /*!< Sampling time register 1                                                  */

    struct {
      __IOM uint32_t SPT0       : 3;            /*!< Channel 0 sample time selection                                           */
      __IOM uint32_t SPT1       : 3;            /*!< Channel 1 sample time selection                                           */
      __IOM uint32_t SPT2       : 3;            /*!< Channel 2 sample time selection                                           */
      __IOM uint32_t SPT3       : 3;            /*!< Channel 3 sample time selection                                           */
      __IOM uint32_t SPT4       : 3;            /*!< Channel 4 sample time selection                                           */
      __IOM uint32_t SPT5       : 3;            /*!< Channel 5 sample time selection                                           */
      __IOM uint32_t SPT6       : 3;            /*!< Channel 6 sample time selection                                           */
      __IOM uint32_t SPT7       : 3;            /*!< Channel 7 sample time selection                                           */
      __IOM uint32_t SPT8       : 3;            /*!< Channel 8 sample time selection                                           */
      __IOM uint32_t SPT9       : 3;            /*!< Channel 9 sample time selection                                           */
            uint32_t            : 2;
    } SAMPT1_b;
  } ;

  union {
    __IOM uint32_t IOFF0;                       /*!< Inserted channel data offset register 0                                   */

