RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF0_b;
  } ;

  union {
    __IOM uint32_t IOFF1;                       /*!< Inserted channel data offset register 1                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF1_b;
  } ;

  union {
    __IOM uint32_t IOFF2;                       /*!< Inserted channel data offset register 2                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF2_b;
  } ;

  union {
    __IOM uint32_t IOFF3;                       /*!< Inserted channel data offset register 3                                   */

    struct {
      __IOM uint32_t IOFF       : 12;           /*!< Data offset for injected channel x                                        */
            uint32_t            : 20;
    } IOFF3_b;
  } ;

  union {
    __IOM uint32_t WDHT;                        /*!< watchdog higher threshold register                                        */

    struct {
      __IOM uint32_t WDHT       : 12;           /*!< Analog watchdog high threshold                                            */
            uint32_t            : 20;
    } WDHT_b;
  } ;

  union {
    __IOM uint32_t WDLT;                        /*!< watchdog low threshold register                                           */

    struct {
      __IOM uint32_t WDLT       : 12;           /*!< Analog watchdog lower threshold                                           */
            uint32_t            : 20;
    } WDLT_b;
  } ;

  union {
    __IOM uint32_t RSQ0;                        /*!< regular sequence register 0                                               */

    struct {
      __IOM uint32_t RSQ12      : 5;            /*!< 12th conversion in regular sequence                                       */
      __IOM uint32_t RSQ13      : 5;            /*!< 13th conversion in regular sequence                                       */
      __IOM uint32_t RSQ14      : 5;            /*!< 14th conversion in regular sequence                                       */
      __IOM uint32_t RSQ15      : 5;            /*!< 15th conversion in regular sequence                                       */
      __IOM uint32_t RL         : 4;            /*!< Regular channel sequence length                                           */
            uint32_t            : 8;
    } RSQ0_b;
  } ;

  union {
    __IOM uint32_t RSQ1;                        /*!< regular sequence register 1                                               */

    struct {
      __IOM uint32_t RSQ6       : 5;            /*!< 6th conversion in regular sequence                                        */
      __IOM uint32_t RSQ7       : 5;            /*!< 7th conversion in regular sequence                                        */
      __IOM uint32_t RSQ8       : 5;            /*!< 8th conversion in regular sequence                                        */
      __IOM uint32_t RSQ9       : 5;            /*!< 9th conversion in regular sequence                                        */
      __IOM uint32_t RSQ10      : 5;            /*!< 10th conversion in regular sequence                                       */
      __IOM uint32_t RSQ11      : 5;            /*!< 11th conversion in regular sequence                                       */
            uint32_t            : 2;
    } RSQ1_b;
  } ;

  union {
    __IOM uint32_t RSQ2;                        /*!< regular sequence register 2                                               */

    struct {
      __IOM uint32_t RSQ0       : 5;            /*!< conversion in regular sequence                                            */
      __IOM uint32_t RSQ1       : 5;            /*!< 1st conversion in regular sequence                                        */
      __IOM uint32_t RSQ2       : 5;            /*!< 2nd conversion in regular sequence                                        */
      __IOM uint32_t RSQ3       : 5;            /*!< 3rd conversion in regular sequence                                        */
      __IOM uint32_t RSQ4       : 5;            /*!< 4th conversion in regular sequence                                        */
      __IOM uint32_t RSQ5       : 5;            /*!< 5th conversion in regular sequence                                        */
            uint32_t            : 2;
    } RSQ2_b;
  } ;

  union {
    __IOM uint32_t ISQ;                         /*!< injected sequence register                                                */

    struct {
      __IOM uint32_t ISQ0       : 5;            /*!< conversion in injected sequence                                           */
      __IOM uint32_t ISQ1       : 5;            /*!< 1st conversion in injected sequence                                       */
      __IOM uint32_t ISQ2       : 5;            /*!< 2nd conversion in injected sequence                                       */
      __IOM uint32_t ISQ3       : 5;            /*!< 3rd conversion in injected sequence                                       */
      __IOM uint32_t IL         : 2;            /*!< Injected sequence length                                                  */
            uint32_t            : 10;
    } ISQ_b;
  } ;

  union {
    __IM  uint32_t IDATA0;                      /*!< injected data register 0                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA0_b;
  } ;

  union {
    __IM  uint32_t IDATA1;                      /*!< injected data register 1                                                  */

