RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA1_b;
  } ;

  union {
    __IM  uint32_t IDATA2;                      /*!< injected data register 2                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA2_b;
  } ;

  union {
    __IM  uint32_t IDATA3;                      /*!< injected data register 3                                                  */

    struct {
      __IM  uint32_t IDATAn     : 16;           /*!< Injected data                                                             */
            uint32_t            : 16;
    } IDATA3_b;
  } ;

  union {
    __IM  uint32_t RDATA;                       /*!< regular data register                                                     */

    struct {
      __IM  uint32_t RDATA      : 16;           /*!< Regular data                                                              */
            uint32_t            : 16;
    } RDATA_b;
  } ;
  __IM  uint32_t  RESERVED[12];

  union {
    __IOM uint32_t OVSAMPCTL;                   /*!< ADC oversample control register                                           */

    struct {
      __IOM uint32_t OVSEN      : 1;            /*!< Oversampler Enable                                                        */
            uint32_t            : 1;
      __IOM uint32_t OVSR       : 3;            /*!< Oversampling ratio                                                        */
      __IOM uint32_t OVSS       : 4;            /*!< Oversampling shift                                                        */
      __IOM uint32_t TOVS       : 1;            /*!< Triggered Oversampling                                                    */
            uint32_t            : 22;
    } OVSAMPCTL_b;
  } ;
} ADC_Type;                                     /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                            CMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator (CMP)
  */

typedef struct {                                /*!< CMP Structure                                                             */

  union {
    __IOM uint32_t CS;                          /*!< control and status register                                               */

    struct {
      __IOM uint32_t CMPEN      : 1;            /*!< Comparator enable                                                         */
      __IOM uint32_t CMPSW      : 1;            /*!< Comparator switch                                                         */
      __IOM uint32_t CMPM       : 2;            /*!< Comparator mode                                                           */
      __IOM uint32_t CMPMSEL    : 3;            /*!< Comparator input selection                                                */
            uint32_t            : 1;
      __IOM uint32_t CMPOSEL    : 3;            /*!< Comparator output selection                                               */
      __IOM uint32_t CMPPL      : 1;            /*!< Polarity of comparator output                                             */
      __IOM uint32_t CMPHST     : 2;            /*!< Comparator hysteresis                                                     */
      __IM  uint32_t CMPO       : 1;            /*!< Comparator 0 output                                                       */
      __IOM uint32_t CMPLK      : 1;            /*!< Comparator 0 lock                                                         */
            uint32_t            : 16;
    } CS_b;
  } ;
} CMP_Type;                                     /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief cyclic redundancy check calculation unit (CRC)
  */

typedef struct {                                /*!< CRC Structure                                                             */

  union {
    __IOM uint32_t DATA;                        /*!< Data register                                                             */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< CRC calculation result bits                                               */
    } DATA_b;
  } ;

  union {
    __IOM uint32_t FDATA;                       /*!< Free data register                                                        */

    struct {
      __IOM uint32_t FDATA      : 8;            /*!< General-purpose 8-bit data register bits                                  */
            uint32_t            : 24;
    } FDATA_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __IOM uint32_t RST        : 1;            /*!< reset bit                                                                 */
            uint32_t            : 2;
      __IOM uint32_t PS         : 2;            /*!< Size of polynomial                                                        */
      __IOM uint32_t REV_I      : 2;            /*!< Reverse input data                                                        */
      __IOM uint32_t REV_O      : 1;            /*!< Reverse output data                                                       */
            uint32_t            : 24;
    } CTL_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t IDATA;                       /*!< Initialization Data Register                                              */

