RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t IDATA      : 32;           /*!< CRC calculation initial value                                             */
    } IDATA_b;
  } ;

  union {
    __IOM uint32_t POLY;                        /*!< Polynomial register                                                       */

    struct {
      __IOM uint32_t POLY       : 32;           /*!< User configurable polynomial value                                        */
    } POLY_b;
  } ;
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                          DBGMCU                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBGMCU)
  */

typedef struct {                                /*!< DBGMCU Structure                                                          */

  union {
    __IM  uint32_t ID;                          /*!< MCU Device ID Code Register                                               */

    struct {
      __IM  uint32_t ID_CODE    : 32;           /*!< DBG ID code register                                                      */
    } ID_b;
  } ;

  union {
    __IOM uint32_t CTL0;                        /*!< Debug Control Register 0                                                  */

    struct {
      __IOM uint32_t SLP_HOLD   : 1;            /*!< Sleep mode hold register                                                  */
      __IOM uint32_t DSLP_HOLD  : 1;            /*!< DEEPSLEEP mode hold Mode                                                  */
      __IOM uint32_t STB_HOLD   : 1;            /*!< Standby mode hold Mode                                                    */
            uint32_t            : 5;
      __IOM uint32_t FWDGT_HOLD : 1;            /*!< FWDGT hold register                                                       */
      __IOM uint32_t WWDGT_HOLD : 1;            /*!< WWDGT hold register                                                       */
      __IOM uint32_t TIMER0_HOLD : 1;           /*!< Timer 0 hold register                                                     */
            uint32_t            : 1;
      __IOM uint32_t TIMER2_HOLD : 1;           /*!< Timer 2 hold register                                                     */
            uint32_t            : 2;
      __IOM uint32_t I2C0_HOLD  : 1;            /*!< I2C0 hold register                                                        */
      __IOM uint32_t I2C1_HOLD  : 1;            /*!< I2C1 hold register                                                        */
            uint32_t            : 2;
      __IOM uint32_t TIMER5_HOLD : 1;           /*!< Timer 5 hold register                                                     */
            uint32_t            : 7;
      __IOM uint32_t TIMER13_HOLD : 1;          /*!< Timer 13 hold register                                                    */
            uint32_t            : 4;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Debug Control Register 1                                                  */

    struct {
            uint32_t            : 10;
      __IOM uint32_t RTC_HOLD   : 1;            /*!< RTC hold register                                                         */
            uint32_t            : 5;
      __IOM uint32_t TIMER14_HOLD : 1;          /*!< Timer 14 hold register                                                    */
      __IOM uint32_t TIMER15_HOLD : 1;          /*!< Timer 15 hold register                                                    */
      __IOM uint32_t TIMER16_HOLD : 1;          /*!< Timer 16 hold register                                                    */
            uint32_t            : 13;
    } CTL1_b;
  } ;
} DBGMCU_Type;                                  /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA)
  */

typedef struct {                                /*!< DMA Structure                                                             */

  union {
    __IM  uint32_t INTF;                        /*!< DMA interrupt flag register (DMA_INTF)                                    */

    struct {
      __IM  uint32_t GIF0       : 1;            /*!< Channel 0 Global interrupt flag                                           */
      __IM  uint32_t FTFIF0     : 1;            /*!< Channel 0 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF0     : 1;            /*!< Channel 0 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF0     : 1;            /*!< Channel 0 Error flag                                                      */
      __IM  uint32_t GIF1       : 1;            /*!< Channel 1 Global interrupt flag                                           */
      __IM  uint32_t FTFIF1     : 1;            /*!< Channel 1 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF1     : 1;            /*!< Channel 1 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF1     : 1;            /*!< Channel 1 Error flag                                                      */
      __IM  uint32_t GIF2       : 1;            /*!< Channel 2 Global interrupt flag                                           */
      __IM  uint32_t FTFIF2     : 1;            /*!< Channel 2 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF2     : 1;            /*!< Channel 2 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF2     : 1;            /*!< Channel 2 Error flag                                                      */
      __IM  uint32_t GIF3       : 1;            /*!< Channel 3 Global interrupt flag                                           */
      __IM  uint32_t FTFIF3     : 1;            /*!< Channel 3 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF3     : 1;            /*!< Channel 3 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF3     : 1;            /*!< Channel 3 Error flag                                                      */
      __IM  uint32_t GIF4       : 1;            /*!< Channel 4 Global interrupt flag                                           */
      __IM  uint32_t FTFIF4     : 1;            /*!< Channel 4 Full Transfer Finish flag                                       */
      __IM  uint32_t HTFIF4     : 1;            /*!< Channel 4 Half Transfer Finish flag                                       */
      __IM  uint32_t ERRIF4     : 1;            /*!< Channel 4 Error flag                                                      */
            uint32_t            : 12;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t INTC;                        /*!< DMA interrupt flag clear register (DMA_INTC)                              */

