RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __OM  uint32_t GIFC0      : 1;            /*!< Channel 0 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC0    : 1;            /*!< Channel 0 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC0    : 1;            /*!< Channel 0 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC0    : 1;            /*!< Channel 0 Error clear                                                     */
      __OM  uint32_t GIFC1      : 1;            /*!< Channel 1 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC1    : 1;            /*!< Channel 1 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC1    : 1;            /*!< Channel 1 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC1    : 1;            /*!< Channel 1 Error clear                                                     */
      __OM  uint32_t GIFC2      : 1;            /*!< Channel 2 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC2    : 1;            /*!< Channel 2 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC2    : 1;            /*!< Channel 2 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC2    : 1;            /*!< Channel 2 Error clear                                                     */
      __OM  uint32_t GIFC3      : 1;            /*!< Channel 3 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC3    : 1;            /*!< Channel 3 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC3    : 1;            /*!< Channel 3 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC3    : 1;            /*!< Channel 3 Error clear                                                     */
      __OM  uint32_t GIFC4      : 1;            /*!< Channel 4 Global interrupt flag clear                                     */
      __OM  uint32_t FTFIFC4    : 1;            /*!< Channel 4 Full Transfer Finish clear                                      */
      __OM  uint32_t HTFIFC4    : 1;            /*!< Channel 4 Half Transfer clear                                             */
      __OM  uint32_t ERRIFC4    : 1;            /*!< Channel 4 Error clear                                                     */
            uint32_t            : 12;
    } INTC_b;
  } ;

  union {
    __IOM uint32_t CH0CTL;                      /*!< DMA channel configuration register (DMA_CH0CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Transfer access error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH0CTL_b;
  } ;

  union {
    __IOM uint32_t CH0CNT;                      /*!< DMA channel 0 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH0CNT_b;
  } ;

  union {
    __IOM uint32_t CH0PADDR;                    /*!< DMA channel 0 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH0PADDR_b;
  } ;

  union {
    __IOM uint32_t CH0MADDR;                    /*!< DMA channel 0 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH0MADDR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t CH1CTL;                      /*!< DMA channel configuration register (DMA_CH1CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH1CTL_b;
  } ;

  union {
    __IOM uint32_t CH1CNT;                      /*!< DMA channel 1 counter register                                            */

