RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH3MADDR_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t CH4CTL;                      /*!< DMA channel configuration register (DMA_CH4CTL)                           */

    struct {
      __IOM uint32_t CHEN       : 1;            /*!< Channel enable                                                            */
      __IOM uint32_t FTFIE      : 1;            /*!< Full Transfer Finish interrupt enable                                     */
      __IOM uint32_t HTFIE      : 1;            /*!< Half Transfer Finish interrupt enable                                     */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t DIR        : 1;            /*!< Transfer direction                                                        */
      __IOM uint32_t CMEN       : 1;            /*!< Circular mode enable                                                      */
      __IOM uint32_t PNAGA      : 1;            /*!< Next address generation algorithm of peripheral                           */
      __IOM uint32_t MNAGA      : 1;            /*!< Next address generation algorithm of memory                               */
      __IOM uint32_t PWIDTH     : 2;            /*!< Transfer data size of peripheral                                          */
      __IOM uint32_t MWIDTH     : 2;            /*!< Transfer data size of memory                                              */
      __IOM uint32_t PRIO       : 2;            /*!< Priority Level of this channel                                            */
      __IOM uint32_t M2M        : 1;            /*!< Memory to memory mode                                                     */
            uint32_t            : 17;
    } CH4CTL_b;
  } ;

  union {
    __IOM uint32_t CH4CNT;                      /*!< DMA channel 4 counter register                                            */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< Transfer counter                                                          */
            uint32_t            : 16;
    } CH4CNT_b;
  } ;

  union {
    __IOM uint32_t CH4PADDR;                    /*!< DMA channel 4 peripheral base address register                            */

    struct {
      __IOM uint32_t PADDR      : 32;           /*!< Peripheral base address                                                   */
    } CH4PADDR_b;
  } ;

  union {
    __IOM uint32_t CH4MADDR;                    /*!< DMA channel 4 memory base address register                                */

    struct {
      __IOM uint32_t MADDR      : 32;           /*!< Memory address                                                            */
    } CH4MADDR_b;
  } ;
} DMA_Type;                                     /*!< Size = 104 (0x68)                                                         */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event
      controller (EXTI)
  */

typedef struct {                                /*!< EXTI Structure                                                            */

  union {
    __IOM uint32_t INTEN;                       /*!< Interrupt enable register (EXTI_INTEN)                                    */

    struct {
      __IOM uint32_t INTEN0     : 1;            /*!< Enable Interrupt on line 0                                                */
      __IOM uint32_t INTEN1     : 1;            /*!< Enable Interrupt on line 1                                                */
      __IOM uint32_t INTEN2     : 1;            /*!< Enable Interrupt on line 2                                                */
      __IOM uint32_t INTEN3     : 1;            /*!< Enable Interrupt on line 3                                                */
      __IOM uint32_t INTEN4     : 1;            /*!< Enable Interrupt on line 4                                                */
      __IOM uint32_t INTEN5     : 1;            /*!< Enable Interrupt on line 5                                                */
      __IOM uint32_t INTEN6     : 1;            /*!< Enable Interrupt on line 6                                                */
      __IOM uint32_t INTEN7     : 1;            /*!< Enable Interrupt on line 7                                                */
      __IOM uint32_t INTEN8     : 1;            /*!< Enable Interrupt on line 8                                                */
      __IOM uint32_t INTEN9     : 1;            /*!< Enable Interrupt on line 9                                                */
      __IOM uint32_t INTEN10    : 1;            /*!< Enable Interrupt on line 10                                               */
      __IOM uint32_t INTEN11    : 1;            /*!< Enable Interrupt on line 11                                               */
      __IOM uint32_t INTEN12    : 1;            /*!< Enable Interrupt on line 12                                               */
      __IOM uint32_t INTEN13    : 1;            /*!< Enable Interrupt on line 13                                               */
      __IOM uint32_t INTEN14    : 1;            /*!< Enable Interrupt on line 14                                               */
      __IOM uint32_t INTEN15    : 1;            /*!< Enable Interrupt on line 15                                               */
      __IOM uint32_t INTEN16    : 1;            /*!< Enable Interrupt on line 16                                               */
      __IOM uint32_t INTEN17    : 1;            /*!< Enable Interrupt on line 17                                               */
      __IOM uint32_t INTEN18    : 1;            /*!< Enable Interrupt on line 18                                               */
      __IOM uint32_t INTEN19    : 1;            /*!< Enable Interrupt on line 19                                               */
      __IOM uint32_t INTEN20    : 1;            /*!< Enable Interrupt on line 20                                               */
      __IOM uint32_t INTEN21    : 1;            /*!< Enable Interrupt on line 21                                               */
      __IOM uint32_t INTEN22    : 1;            /*!< Enable Interrupt on line 22                                               */
      __IOM uint32_t INTEN23    : 1;            /*!< Enable Interrupt on line 23                                               */
      __IOM uint32_t INTEN24    : 1;            /*!< Enable Interrupt on line 24                                               */
      __IOM uint32_t INTEN25    : 1;            /*!< Enable Interrupt on line 25                                               */
      __IOM uint32_t INTEN26    : 1;            /*!< Enable Interrupt on line 26                                               */
      __IOM uint32_t INTEN27    : 1;            /*!< Enable Interrupt on line 27                                               */
            uint32_t            : 4;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t EVEN;                        /*!< Event enable register (EXTI_EVEN)                                         */

