RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t EVEN0      : 1;            /*!< Enable Event on line 0                                                    */
      __IOM uint32_t EVEN1      : 1;            /*!< Enable Event on line 1                                                    */
      __IOM uint32_t EVEN2      : 1;            /*!< Enable Event on line 2                                                    */
      __IOM uint32_t EVEN3      : 1;            /*!< Enable Event on line 3                                                    */
      __IOM uint32_t EVEN4      : 1;            /*!< Enable Event on line 4                                                    */
      __IOM uint32_t EVEN5      : 1;            /*!< Enable Event on line 5                                                    */
      __IOM uint32_t EVEN6      : 1;            /*!< Enable Event on line 6                                                    */
      __IOM uint32_t EVEN7      : 1;            /*!< Enable Event on line 7                                                    */
      __IOM uint32_t EVEN8      : 1;            /*!< Enable Event on line 8                                                    */
      __IOM uint32_t EVEN9      : 1;            /*!< Enable Event on line 9                                                    */
      __IOM uint32_t EVEN10     : 1;            /*!< Enable Event on line 10                                                   */
      __IOM uint32_t EVEN11     : 1;            /*!< Enable Event on line 11                                                   */
      __IOM uint32_t EVEN12     : 1;            /*!< Enable Event on line 12                                                   */
      __IOM uint32_t EVEN13     : 1;            /*!< Enable Event on line 13                                                   */
      __IOM uint32_t EVEN14     : 1;            /*!< Enable Event on line 14                                                   */
      __IOM uint32_t EVEN15     : 1;            /*!< Enable Event on line 15                                                   */
      __IOM uint32_t EVEN16     : 1;            /*!< Enable Event on line 16                                                   */
      __IOM uint32_t EVEN17     : 1;            /*!< Enable Event on line 17                                                   */
      __IOM uint32_t EVEN18     : 1;            /*!< Enable Event on line 18                                                   */
      __IOM uint32_t EVEN19     : 1;            /*!< Enable Event on line 19                                                   */
      __IOM uint32_t EVEN20     : 1;            /*!< Enable Event on line 20                                                   */
      __IOM uint32_t EVEN21     : 1;            /*!< Enable Event on line 21                                                   */
      __IOM uint32_t EVEN22     : 1;            /*!< Enable Event on line 22                                                   */
      __IOM uint32_t EVEN23     : 1;            /*!< Enable Event on line 23                                                   */
      __IOM uint32_t EVEN24     : 1;            /*!< Enable Event on line 24                                                   */
      __IOM uint32_t EVEN25     : 1;            /*!< Enable Event on line 25                                                   */
      __IOM uint32_t EVEN26     : 1;            /*!< Enable Event on line 26                                                   */
      __IOM uint32_t EVEN27     : 1;            /*!< Enable Event on line 27                                                   */
            uint32_t            : 4;
    } EVEN_b;
  } ;

  union {
    __IOM uint32_t RTEN;                        /*!< Rising Edge Trigger Enable register (EXTI_RTEN)                           */

    struct {
      __IOM uint32_t RTEN0      : 1;            /*!< Rising trigger event configuration of line 0                              */
      __IOM uint32_t RTEN1      : 1;            /*!< Rising trigger event configuration of line 1                              */
      __IOM uint32_t RTEN2      : 1;            /*!< Rising trigger event configuration of line 2                              */
      __IOM uint32_t RTEN3      : 1;            /*!< Rising trigger event configuration of line 3                              */
      __IOM uint32_t RTEN4      : 1;            /*!< Rising trigger event configuration of line 4                              */
      __IOM uint32_t RTEN5      : 1;            /*!< Rising trigger event configuration of line 5                              */
      __IOM uint32_t RTEN6      : 1;            /*!< Rising trigger event configuration of line 6                              */
      __IOM uint32_t RTEN7      : 1;            /*!< Rising trigger event configuration of line 7                              */
      __IOM uint32_t RTEN8      : 1;            /*!< Rising trigger event configuration of line 8                              */
      __IOM uint32_t RTEN9      : 1;            /*!< Rising trigger event configuration of line 9                              */
      __IOM uint32_t RTEN10     : 1;            /*!< Rising trigger event configuration of line 10                             */
      __IOM uint32_t RTEN11     : 1;            /*!< Rising trigger event configuration of line 11                             */
      __IOM uint32_t RTEN12     : 1;            /*!< Rising trigger event configuration of line 12                             */
      __IOM uint32_t RTEN13     : 1;            /*!< Rising trigger event configuration of line 13                             */
      __IOM uint32_t RTEN14     : 1;            /*!< Rising trigger event configuration of line 14                             */
      __IOM uint32_t RTEN15     : 1;            /*!< Rising trigger event configuration of line 15                             */
      __IOM uint32_t RTEN16     : 1;            /*!< Rising trigger event configuration of line 16                             */
      __IOM uint32_t RTEN17     : 1;            /*!< Rising trigger event configuration of line 17                             */
            uint32_t            : 1;
      __IOM uint32_t RTEN19     : 1;            /*!< Rising trigger event configuration of line 19                             */
            uint32_t            : 1;
      __IOM uint32_t RTEN21     : 1;            /*!< Rising trigger event configuration of line 21                             */
            uint32_t            : 10;
    } RTEN_b;
  } ;

  union {
    __IOM uint32_t FTEN;                        /*!< Falling Egde Trigger Enable register (EXTI_FTEN)                          */

