RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
typedef struct {                                /*!< FMC Structure                                                             */

  union {
    __IOM uint32_t WS;                          /*!< wait state register                                                       */

    struct {
      __IOM uint32_t WSCNT      : 3;            /*!< wait state counter register                                               */
            uint32_t            : 1;
      __IOM uint32_t PFEN       : 1;            /*!< Pre-fetch enable                                                          */
            uint32_t            : 10;
      __IOM uint32_t PGW        : 1;            /*!< Program width to flash memory                                             */
            uint32_t            : 16;
    } WS_b;
  } ;

  union {
    __OM  uint32_t KEY;                         /*!< Unlock key register                                                       */

    struct {
      __OM  uint32_t KEY        : 32;           /*!< FMC_CTL unlock register                                                   */
    } KEY_b;
  } ;

  union {
    __OM  uint32_t OBKEY;                       /*!< Option byte unlock key register                                           */

    struct {
      __OM  uint32_t OBKEY      : 32;           /*!< FMC_ CTL option bytes operation unlock register                           */
    } OBKEY_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Status register                                                           */

    struct {
      __IM  uint32_t BUSY       : 1;            /*!< The flash is busy bit                                                     */
            uint32_t            : 1;
      __IOM uint32_t PGERR      : 1;            /*!< Program error flag bit                                                    */
      __IOM uint32_t PGAERR     : 1;            /*!< Program alignment error flag bit                                          */
      __IOM uint32_t WPERR      : 1;            /*!< Erase/Program protection error flag bit                                   */
      __IOM uint32_t ENDF       : 1;            /*!< End of operation flag bit                                                 */
            uint32_t            : 26;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __IOM uint32_t PG         : 1;            /*!< Main flash program for bank0 command bit                                  */
      __IOM uint32_t PER        : 1;            /*!< Main flash page erase for bank0 command bit                               */
      __IOM uint32_t MER        : 1;            /*!< Main flash mass erase for bank0 command bit                               */
            uint32_t            : 1;
      __IOM uint32_t OBPG       : 1;            /*!< Option bytes program command bit                                          */
      __IOM uint32_t OBER       : 1;            /*!< Option bytes erase command bit                                            */
      __IOM uint32_t START      : 1;            /*!< Send erase command to FMC bit                                             */
      __IOM uint32_t LK         : 1;            /*!< FMC_CTL lock bit                                                          */
            uint32_t            : 1;
      __IOM uint32_t OBWEN      : 1;            /*!< Option byte erase/program enable bit                                      */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable bit                                                */
            uint32_t            : 1;
      __IOM uint32_t ENDIE      : 1;            /*!< End of operation interrupt enable bit                                     */
      __IOM uint32_t OBRLD      : 1;            /*!< Option byte reload bit                                                    */
            uint32_t            : 18;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t ADDR;                        /*!< Address register                                                          */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Flash erase/program command address bits                                  */
    } ADDR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IM  uint32_t OBSTAT;                      /*!< Option byte control register                                              */

    struct {
      __IM  uint32_t OBERR      : 1;            /*!< Option bytes read error bit                                               */
      __IM  uint32_t PLEVEL     : 2;            /*!< Option bytes security protection level                                    */
            uint32_t            : 5;
      __IM  uint32_t USER       : 8;            /*!< Store USER of option bytes block after system reset                       */
      __IM  uint32_t DATA       : 16;           /*!< Store DATA[15:0] of option bytes block after system reset                 */
    } OBSTAT_b;
  } ;

  union {
    __IM  uint32_t WP;                          /*!< Erase/Program Protection register                                         */

    struct {
      __IM  uint32_t WP         : 16;           /*!< Store WP[15:0] of option bytes block after system reset                   */
            uint32_t            : 16;
    } WP_b;
  } ;
  __IM  uint32_t  RESERVED1[55];

  union {
    __IM  uint32_t PID;                         /*!< Product ID register                                                       */

    struct {
      __IM  uint32_t PID        : 32;           /*!< Product reserved ID code register                                         */
    } PID_b;
  } ;
} FMC_Type;                                     /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                           FWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief free watchdog timer (FWDGT)
  */

