RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t LK0        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK1        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK2        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK3        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK4        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK5        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK6        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK7        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK8        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK9        : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK10       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK11       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK12       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK13       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK14       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LK15       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LKK        : 1;            /*!< Port x lock bit y                                                         */
            uint32_t            : 15;
    } LOCK_b;
  } ;

  union {
    __IOM uint32_t AFSEL0;                      /*!< GPIO alternate function low register                                      */

    struct {
      __IOM uint32_t SEL0       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL1       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL2       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL3       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL4       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL5       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL6       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL7       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
    } AFSEL0_b;
  } ;

  union {
    __IOM uint32_t AFSEL1;                      /*!< GPIO alternate function register 1                                        */

    struct {
      __IOM uint32_t SEL8       : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL9       : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL10      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL11      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL12      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL13      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL14      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL15      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
    } AFSEL1_b;
  } ;

  union {
    __OM  uint32_t BC;                          /*!< Port bit reset register                                                   */

    struct {
      __OM  uint32_t CR0        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR1        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR2        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR3        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR4        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR5        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR6        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR7        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR8        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR9        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR10       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR11       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR12       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR13       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR14       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR15       : 1;            /*!< Port cleat bit                                                            */
            uint32_t            : 16;
    } BC_b;
  } ;

  union {
    __OM  uint32_t TG;                          /*!< Port bit toggle register                                                  */

