RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t OSPD0      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD1      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD2      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD3      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD4      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD5      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD6      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD7      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD8      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD9      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD10     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD11     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD12     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD13     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD14     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPD15     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } OSPD_b;
  } ;

  union {
    __IOM uint32_t PUD;                         /*!< GPIO port pull-up/pull-down register                                      */

    struct {
      __IOM uint32_t PUD0       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD1       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD2       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD3       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD4       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD5       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD6       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD7       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD8       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD9       : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD10      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD11      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD12      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD13      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD14      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUD15      : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } PUD_b;
  } ;

  union {
    __IM  uint32_t ISTAT;                       /*!< GPIO port input data register                                             */

    struct {
      __IM  uint32_t ISTAT0     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT1     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT2     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT3     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT4     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT5     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT6     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT7     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT8     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT9     : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT10    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT11    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT12    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT13    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT14    : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t ISTAT15    : 1;            /*!< Port input data (y = 0..15)                                               */
            uint32_t            : 16;
    } ISTAT_b;
  } ;

  union {
    __IOM uint32_t OCTL;                        /*!< GPIO port output data register                                            */

