RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t SEL0       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL1       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL2       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL3       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL4       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL5       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL6       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t SEL7       : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
    } AFSEL0_b;
  } ;

  union {
    __IOM uint32_t AFSEL1;                      /*!< GPIO alternate function register 1                                        */

    struct {
      __IOM uint32_t SEL8       : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL9       : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL10      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL11      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL12      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL13      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL14      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t SEL15      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
    } AFSEL1_b;
  } ;

  union {
    __OM  uint32_t BC;                          /*!< Port bit reset register                                                   */

    struct {
      __OM  uint32_t CR0        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR1        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR2        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR3        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR4        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR5        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR6        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR7        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR8        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR9        : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR10       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR11       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR12       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR13       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR14       : 1;            /*!< Port cleat bit                                                            */
      __OM  uint32_t CR15       : 1;            /*!< Port cleat bit                                                            */
            uint32_t            : 16;
    } BC_b;
  } ;

  union {
    __OM  uint32_t TG;                          /*!< Port bit toggle register                                                  */

    struct {
      __OM  uint32_t TG0        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG1        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG2        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG3        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG4        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG5        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG6        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG7        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG8        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG9        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG10       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG11       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG12       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG13       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG14       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG15       : 1;            /*!< Port toggle bit                                                           */
            uint32_t            : 16;
    } TG_b;
  } ;
} GPIOC_Type;                                   /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOF)
  */

