RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __OM  uint32_t TG0        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG1        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG2        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG3        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG4        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG5        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG6        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG7        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG8        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG9        : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG10       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG11       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG12       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG13       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG14       : 1;            /*!< Port toggle bit                                                           */
      __OM  uint32_t TG15       : 1;            /*!< Port toggle bit                                                           */
            uint32_t            : 16;
    } TG_b;
  } ;
} GPIOF_Type;                                   /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter integrated circuit (I2C0)
  */

typedef struct {                                /*!< I2C0 Structure                                                            */

  union {
    __IOM uint32_t CTL0;                        /*!< Control register 0                                                        */

    struct {
      __IOM uint32_t I2CEN      : 1;            /*!< Peripheral enable                                                         */
      __IOM uint32_t SMBEN      : 1;            /*!< SMBus mode                                                                */
            uint32_t            : 1;
      __IOM uint32_t SMBSEL     : 1;            /*!< SMBus type                                                                */
      __IOM uint32_t ARPEN      : 1;            /*!< ARP enable                                                                */
      __IOM uint32_t PECEN      : 1;            /*!< PEC enable                                                                */
      __IOM uint32_t GCEN       : 1;            /*!< General call enable                                                       */
      __IOM uint32_t SS         : 1;            /*!< SCL Stretching(Slave mode)                                                */
      __IOM uint32_t START      : 1;            /*!< Start generation                                                          */
      __IOM uint32_t STOP       : 1;            /*!< Stop condition                                                            */
      __IOM uint32_t ACKEN      : 1;            /*!< Acknowledge enable                                                        */
      __IOM uint32_t POAP       : 1;            /*!< Acknowledge/PEC Position (for data reception)                             */
      __IOM uint32_t PECTRANS   : 1;            /*!< Packet error checking                                                     */
      __IOM uint32_t SALT       : 1;            /*!< SMBus alert                                                               */
            uint32_t            : 1;
      __IOM uint32_t SRESET     : 1;            /*!< Software reset                                                            */
            uint32_t            : 16;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control register 1                                                        */

    struct {
      __IOM uint32_t I2CCLK     : 7;            /*!< Peripheral clock frequency                                                */
            uint32_t            : 1;
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t EVIE       : 1;            /*!< Event interrupt enable                                                    */
      __IOM uint32_t BUFIE      : 1;            /*!< Buffer interrupt enable                                                   */
      __IOM uint32_t DMAON      : 1;            /*!< DMA mode switch                                                           */
      __IOM uint32_t DMALST     : 1;            /*!< Flag indicating DMA last transfer                                         */
            uint32_t            : 19;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SADDR0;                      /*!< Own address register 0                                                    */

