RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t FMPEN      : 1;            /*!< Fast-mode-plus enable                                                     */
            uint32_t            : 31;
    } FMPCFG_b;
  } ;
} I2C_Type;                                    /*!< Size = 148 (0x94)                                                         */



/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt
      Controller (NVIC)
  */

// typedef struct {                                /*!< NVIC Structure                                                            */

//   union {
//     __IOM uint32_t ISER0;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER0_b;
//   } ;

//   union {
//     __IOM uint32_t ISER1;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER1_b;
//   } ;

//   union {
//     __IOM uint32_t ISER2;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER2_b;
//   } ;

//   union {
//     __IOM uint32_t ISER3;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER3_b;
//   } ;

//   union {
//     __IOM uint32_t ISER4;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER4_b;
//   } ;

//   union {
//     __IOM uint32_t ISER5;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER5_b;
//   } ;

//   union {
//     __IOM uint32_t ISER6;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER6_b;
//   } ;

//   union {
//     __IOM uint32_t ISER7;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER7_b;
//   } ;

//   union {
//     __IOM uint32_t ISER8;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER8_b;
//   } ;

//   union {
//     __IOM uint32_t ISER9;                       /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER9_b;
//   } ;

//   union {
//     __IOM uint32_t ISER10;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER10_b;
//   } ;

//   union {
//     __IOM uint32_t ISER11;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER11_b;
//   } ;

//   union {
//     __IOM uint32_t ISER12;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER12_b;
//   } ;

//   union {
//     __IOM uint32_t ISER13;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER13_b;
//   } ;

//   union {
//     __IOM uint32_t ISER14;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER14_b;
//   } ;

//   union {
//     __IOM uint32_t ISER15;                      /*!< Interrupt Set Enable Register                                             */

//     struct {
//       __IOM uint32_t SETENA     : 32;           /*!< SETENA                                                                    */
//     } ISER15_b;
//   } ;
//   __IM  uint32_t  RESERVED[16];

//   union {
//     __IOM uint32_t ICER0;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER0_b;
//   } ;

//   union {
//     __IOM uint32_t ICER1;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER1_b;
//   } ;
//   __IM  uint32_t  RESERVED1;

//   union {
//     __IOM uint32_t ICER2;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER2_b;
//   } ;

//   union {
//     __IOM uint32_t ICER3;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER3_b;
//   } ;

//   union {
//     __IOM uint32_t ICER4;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER4_b;
//   } ;

//   union {
//     __IOM uint32_t ICER5;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER5_b;
//   } ;

//   union {
//     __IOM uint32_t ICER6;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER6_b;
//   } ;

//   union {
//     __IOM uint32_t ICER7;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER7_b;
//   } ;

//   union {
//     __IOM uint32_t ICER8;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER8_b;
//   } ;

//   union {
//     __IOM uint32_t ICER9;                       /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER9_b;
//   } ;

//   union {
//     __IOM uint32_t ICER10;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER10_b;
//   } ;

//   union {
//     __IOM uint32_t ICER11;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER11_b;
//   } ;

//   union {
//     __IOM uint32_t ICER12;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER12_b;
//   } ;

//   union {
//     __IOM uint32_t ICER13;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER13_b;
//   } ;

//   union {
//     __IOM uint32_t ICER14;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER14_b;
//   } ;

//   union {
//     __IOM uint32_t ICER15;                      /*!< Interrupt Clear Enable Register                                           */

//     struct {
//       __IOM uint32_t CLRENA     : 32;           /*!< CLRENA                                                                    */
//     } ICER15_b;
//   } ;
//   __IM  uint32_t  RESERVED2[15];

//   union {
//     __IOM uint32_t ISPR0;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR0_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR1;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR1_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR2;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR2_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR3;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR3_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR4;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR4_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR5;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR5_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR6;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR6_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR7;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR7_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR8;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR8_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR9;                       /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR9_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR10;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR10_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR11;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR11_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR12;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR12_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR13;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR13_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR14;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR14_b;
//   } ;

//   union {
//     __IOM uint32_t ISPR15;                      /*!< Interrupt Set-Pending Register                                            */

//     struct {
//       __IOM uint32_t SETPEND    : 32;           /*!< SETPEND                                                                   */
//     } ISPR15_b;
//   } ;
//   __IM  uint32_t  RESERVED3[16];

//   union {
//     __IOM uint32_t ICPR0;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR0_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR1;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR1_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR2;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR2_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR3;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR3_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR4;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR4_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR5;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR5_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR6;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR6_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR7;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR7_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR8;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR8_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR9;                       /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR9_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR10;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR10_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR11;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR11_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR12;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR12_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR13;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR13_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR14;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR14_b;
//   } ;

//   union {
//     __IOM uint32_t ICPR15;                      /*!< Interrupt Clear-Pending Register                                          */

//     struct {
//       __IOM uint32_t CLRPEND    : 32;           /*!< CLRPEND                                                                   */
//     } ICPR15_b;
//   } ;
//   __IM  uint32_t  RESERVED4[16];

//   union {
//     __IOM uint32_t IABR0;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR0_b;
//   } ;

//   union {
//     __IOM uint32_t IABR1;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR1_b;
//   } ;

//   union {
//     __IOM uint32_t IABR2;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR2_b;
//   } ;

//   union {
//     __IOM uint32_t IABR3;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR3_b;
//   } ;

//   union {
//     __IOM uint32_t IABR4;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR4_b;
//   } ;

//   union {
//     __IOM uint32_t IABR5;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR5_b;
//   } ;

//   union {
//     __IOM uint32_t IABR6;                       /*!< Interrupt Active bit Register                                             */

