RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR6_b;
//   } ;

//   union {
//     __IOM uint32_t IABR7;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR7_b;
//   } ;

//   union {
//     __IOM uint32_t IABR8;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR8_b;
//   } ;

//   union {
//     __IOM uint32_t IABR9;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR9_b;
//   } ;

//   union {
//     __IOM uint32_t IABR10;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR10_b;
//   } ;

//   union {
//     __IOM uint32_t IABR11;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR11_b;
//   } ;

//   union {
//     __IOM uint32_t IABR12;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR12_b;
//   } ;

//   union {
//     __IOM uint32_t IABR13;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR13_b;
//   } ;

//   union {
//     __IOM uint32_t IABR14;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR14_b;
//   } ;

//   union {
//     __IOM uint32_t IABR15;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t IABR       : 32;           /*!< IABR                                                                      */
//     } IABR15_b;
//   } ;
//   __IM  uint32_t  RESERVED5[16];

//   union {
//     __IOM uint32_t ITNS0;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS0_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS1;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS1_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS2;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS2_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS3;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS3_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS4;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS4_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS5;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS5_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS6;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS6_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS7;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS7_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS8;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS8_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS9;                       /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS9_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS10;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS10_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS11;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS11_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS12;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS12_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS13;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS13_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS14;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS14_b;
//   } ;

//   union {
//     __IOM uint32_t ITNS15;                      /*!< Interrupt Active bit Register                                             */

//     struct {
//       __IOM uint32_t ITNS       : 32;           /*!< ITNS                                                                      */
//     } ITNS15_b;
//   } ;
//   __IM  uint32_t  RESERVED6[16];

//   union {
//     __IOM uint8_t IPR0;                         /*!< Interrupt Priority Register 0                                             */

//     struct {
//       __IOM uint8_t PRI_00      : 8;            /*!< PRI_00                                                                    */
//     } IPR0_b;
//   } ;

//   union {
//     __IOM uint8_t IPR1;                         /*!< Interrupt Priority Register 1                                             */

//     struct {
//       __IOM uint8_t PRI_01      : 8;            /*!< PRI_01                                                                    */
//     } IPR1_b;
//   } ;

//   union {
//     __IOM uint8_t IPR2;                         /*!< Interrupt Priority Register 2                                             */

//     struct {
//       __IOM uint8_t PRI_02      : 8;            /*!< PRI_02                                                                    */
//     } IPR2_b;
//   } ;

//   union {
//     __IOM uint8_t IPR3;                         /*!< Interrupt Priority Register 3                                             */

//     struct {
//       __IOM uint8_t PRI_03      : 8;            /*!< PRI_03                                                                    */
//     } IPR3_b;
//   } ;

//   union {
//     __IOM uint8_t IPR4;                         /*!< Interrupt Priority Register 4                                             */

//     struct {
//       __IOM uint8_t PRI_04      : 8;            /*!< PRI_04                                                                    */
//     } IPR4_b;
//   } ;

//   union {
//     __IOM uint8_t IPR5;                         /*!< Interrupt Priority Register 5                                             */

//     struct {
//       __IOM uint8_t PRI_05      : 8;            /*!< PRI_05                                                                    */
//     } IPR5_b;
//   } ;

//   union {
//     __IOM uint8_t IPR6;                         /*!< Interrupt Priority Register 6                                             */

//     struct {
//       __IOM uint8_t PRI_06      : 8;            /*!< PRI_06                                                                    */
//     } IPR6_b;
//   } ;

//   union {
//     __IOM uint8_t IPR7;                         /*!< Interrupt Priority Register 7                                             */

//     struct {
//       __IOM uint8_t PRI_07      : 8;            /*!< PRI_07                                                                    */
//     } IPR7_b;
//   } ;

//   union {
//     __IOM uint8_t IPR8;                         /*!< Interrupt Priority Register 8                                             */

//     struct {
//       __IOM uint8_t PRI_08      : 8;            /*!< PRI_08                                                                    */
//     } IPR8_b;
//   } ;

//   union {
//     __IOM uint8_t IPR9;                         /*!< Interrupt Priority Register 9                                             */

//     struct {
//       __IOM uint8_t PRI_09      : 8;            /*!< PRI_09                                                                    */
//     } IPR9_b;
//   } ;

//   union {
//     __IOM uint8_t IPR10;                        /*!< Interrupt Priority Register 10                                            */

//     struct {
//       __IOM uint8_t PRI_10      : 8;            /*!< PRI_10                                                                    */
//     } IPR10_b;
//   } ;

//   union {
//     __IOM uint8_t IPR11;                        /*!< Interrupt Priority Register 11                                            */

//     struct {
//       __IOM uint8_t PRI_11      : 8;            /*!< PRI_11                                                                    */
//     } IPR11_b;
//   } ;

//   union {
//     __IOM uint8_t IPR12;                        /*!< Interrupt Priority Register 12                                            */

//     struct {
//       __IOM uint8_t PRI_12      : 8;            /*!< PRI_12                                                                    */
//     } IPR12_b;
//   } ;

//   union {
//     __IOM uint8_t IPR13;                        /*!< Interrupt Priority Register 13                                            */

//     struct {
//       __IOM uint8_t PRI_13      : 8;            /*!< PRI_13                                                                    */
//     } IPR13_b;
//   } ;

//   union {
//     __IOM uint8_t IPR14;                        /*!< Interrupt Priority Register 14                                            */

//     struct {
//       __IOM uint8_t PRI_14      : 8;            /*!< PRI_14                                                                    */
//     } IPR14_b;
//   } ;

//   union {
//     __IOM uint8_t IPR15;                        /*!< Interrupt Priority Register 15                                            */

//     struct {
//       __IOM uint8_t PRI_15      : 8;            /*!< PRI_15                                                                    */
//     } IPR15_b;
//   } ;

//   union {
//     __IOM uint8_t IPR16;                        /*!< Interrupt Priority Register 16                                            */

//     struct {
//       __IOM uint8_t PRI_16      : 8;            /*!< PRI_16                                                                    */
//     } IPR16_b;
//   } ;

//   union {
//     __IOM uint8_t IPR17;                        /*!< Interrupt Priority Register 17                                            */

//     struct {
//       __IOM uint8_t PRI_17      : 8;            /*!< PRI_17                                                                    */
//     } IPR17_b;
//   } ;

//   union {
//     __IOM uint8_t IPR18;                        /*!< Interrupt Priority Register 18                                            */

//     struct {
//       __IOM uint8_t PRI_18      : 8;            /*!< PRI_18                                                                    */
//     } IPR18_b;
//   } ;

//   union {
//     __IOM uint8_t IPR19;                        /*!< Interrupt Priority Register 19                                            */

//     struct {
//       __IOM uint8_t PRI_19      : 8;            /*!< PRI_19                                                                    */
//     } IPR19_b;
//   } ;

//   union {
//     __IOM uint8_t IPR20;                        /*!< Interrupt Priority Register 20                                            */

//     struct {
//       __IOM uint8_t PRI_20      : 8;            /*!< PRI_20                                                                    */
//     } IPR20_b;
//   } ;

//   union {
//     __IOM uint8_t IPR21;                        /*!< Interrupt Priority Register 21                                            */

//     struct {
//       __IOM uint8_t PRI_21      : 8;            /*!< PRI_21                                                                    */
//     } IPR21_b;
//   } ;

//   union {
//     __IOM uint8_t IPR22;                        /*!< Interrupt Priority Register 22                                            */

//     struct {
//       __IOM uint8_t PRI_22      : 8;            /*!< PRI_22                                                                    */
//     } IPR22_b;
//   } ;

//   union {
//     __IOM uint8_t IPR23;                        /*!< Interrupt Priority Register 23                                            */

//     struct {
//       __IOM uint8_t PRI_23      : 8;            /*!< PRI_23                                                                    */
//     } IPR23_b;
//   } ;

//   union {
//     __IOM uint8_t IPR24;                        /*!< Interrupt Priority Register 24                                            */

//     struct {
//       __IOM uint8_t PRI_24      : 8;            /*!< PRI_24                                                                    */
//     } IPR24_b;
//   } ;

//   union {
//     __IOM uint8_t IPR25;                        /*!< Interrupt Priority Register 25                                            */

//     struct {
//       __IOM uint8_t PRI_25      : 8;            /*!< PRI_25                                                                    */
//     } IPR25_b;
//   } ;

//   union {
//     __IOM uint8_t IPR26;                        /*!< Interrupt Priority Register 26                                            */

//     struct {
//       __IOM uint8_t PRI_26      : 8;            /*!< PRI_26                                                                    */
//     } IPR26_b;
//   } ;

//   union {
//     __IOM uint8_t IPR27;                        /*!< Interrupt Priority Register 27                                            */

//     struct {
//       __IOM uint8_t PRI_27      : 8;            /*!< PRI_27                                                                    */
//     } IPR27_b;
//   } ;

//   union {
//     __IOM uint8_t IPR28;                        /*!< Interrupt Priority Register 28                                            */

//     struct {
//       __IOM uint8_t PRI_28      : 8;            /*!< PRI_28                                                                    */
//     } IPR28_b;
//   } ;

//   union {
//     __IOM uint8_t IPR29;                        /*!< Interrupt Priority Register 29                                            */

//     struct {
//       __IOM uint8_t PRI_29      : 8;            /*!< PRI_29                                                                    */
//     } IPR29_b;
//   } ;

//   union {
//     __IOM uint8_t IPR30;                        /*!< Interrupt Priority Register 30                                            */

//     struct {
//       __IOM uint8_t PRI_30      : 8;            /*!< PRI_30                                                                    */
//     } IPR30_b;
//   } ;

//   union {
//     __IOM uint8_t IPR31;                        /*!< Interrupt Priority Register 31                                            */

//     struct {
//       __IOM uint8_t PRI_31      : 8;            /*!< PRI_31                                                                    */
//     } IPR31_b;
//   } ;
// } NVIC_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power management unit (PMU)
  */

typedef struct {                                /*!< PMU Structure                                                             */

  union {
    __IOM uint32_t CTL;                         /*!< power control register                                                    */

