RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IM  uint32_t IRC40KSTBIF : 1;           /*!< IRC40K stabilization interrupt flag                                       */
      __IM  uint32_t LXTALSTBIF : 1;            /*!< LXTAL stabilization interrupt flag                                        */
      __IM  uint32_t IRC8MSTBIF : 1;            /*!< IRC8M stabilization interrupt flag                                        */
      __IM  uint32_t HXTALSTBIF : 1;            /*!< HXTAL stabilization interrupt flag                                        */
      __IM  uint32_t PLLSTBIF   : 1;            /*!< PLL stabilization interrupt flag                                          */
      __IM  uint32_t IRC28MSTBIF : 1;           /*!< IRC28M stabilization interrupt flag                                       */
            uint32_t            : 1;
      __IM  uint32_t CKMIF      : 1;            /*!< HXTAL Clock Stuck Interrupt Flag                                          */
      __IOM uint32_t IRC40KSTBIE : 1;           /*!< IRC40K Stabilization interrupt enable                                     */
      __IOM uint32_t LXTALSTBIE : 1;            /*!< LXTAL Stabilization Interrupt Enable                                      */
      __IOM uint32_t IRC8MSTBIE : 1;            /*!< IRC8M Stabilization Interrupt Enable                                      */
      __IOM uint32_t HXTALSTBIE : 1;            /*!< HXTAL Stabilization Interrupt Enable                                      */
      __IOM uint32_t PLLSTBIE   : 1;            /*!< PLL Stabilization Interrupt Enable                                        */
      __IOM uint32_t IRC28MSTBIE : 1;           /*!< IRC28M Stabilization Interrupt Enable                                     */
            uint32_t            : 2;
      __OM  uint32_t IRC40KSTBIC : 1;           /*!< IRC40K Stabilization Interrupt Clear                                      */
      __OM  uint32_t LXTALSTBIC : 1;            /*!< LXTAL Stabilization Interrupt Clear                                       */
      __OM  uint32_t IRC8MSTBIC : 1;            /*!< IRC8M Stabilization Interrupt Clear                                       */
      __OM  uint32_t HXTALSTBIC : 1;            /*!< HXTAL Stabilization Interrupt Clear                                       */
      __OM  uint32_t PLLSTBIC   : 1;            /*!< PLL stabilization Interrupt Clear                                         */
      __OM  uint32_t IRC28MSTBIC : 1;           /*!< IRC28M stabilization Interrupt Clear                                      */
            uint32_t            : 1;
      __OM  uint32_t CKMIC      : 1;            /*!< HXTAL Clock Stuck Interrupt Clear                                         */
            uint32_t            : 8;
    } INT_b;
  } ;

  union {
    __IOM uint32_t APB2RST;                     /*!< APB2 reset register (RCU_APB2RST)                                         */

    struct {
      __IOM uint32_t CFGCMPRST  : 1;            /*!< System configuration and comparator reset                                 */
            uint32_t            : 8;
      __IOM uint32_t ADCRST     : 1;            /*!< ADC reset                                                                 */
            uint32_t            : 1;
      __IOM uint32_t TIMER0RST  : 1;            /*!< TIMER0 reset                                                              */
      __IOM uint32_t SPI0RST    : 1;            /*!< SPI0 Reset                                                                */
            uint32_t            : 1;
      __IOM uint32_t USART0RST  : 1;            /*!< USART0 Reset                                                              */
            uint32_t            : 1;
      __IOM uint32_t TIMER14RST : 1;            /*!< TIMER14 reset                                                             */
      __IOM uint32_t TIMER15RST : 1;            /*!< TIMER15 reset                                                             */
      __IOM uint32_t TIMER16RST : 1;            /*!< TIMER16 reset                                                             */
            uint32_t            : 13;
    } APB2RST_b;
  } ;

  union {
    __IOM uint32_t APB1RST;                     /*!< APB1 reset register (RCU_APB1RST)                                         */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TIMER2RST  : 1;            /*!< TIMER2 timer reset                                                        */
            uint32_t            : 2;
      __IOM uint32_t TIMER5RST  : 1;            /*!< TIMER5 timer reset                                                        */
            uint32_t            : 3;
      __IOM uint32_t TIMER13RST : 1;            /*!< TIMER13 timer reset                                                       */
            uint32_t            : 2;
      __IOM uint32_t WWDGTRST   : 1;            /*!< Window watchdog timer reset                                               */
            uint32_t            : 2;
      __IOM uint32_t SPI1RST    : 1;            /*!< SPI1 reset                                                                */
            uint32_t            : 2;
      __IOM uint32_t USART1RST  : 1;            /*!< USART1 reset                                                              */
            uint32_t            : 3;
      __IOM uint32_t I2C0RST    : 1;            /*!< I2C0 reset                                                                */
      __IOM uint32_t I2C1RST    : 1;            /*!< I2C1 reset                                                                */
            uint32_t            : 5;
      __IOM uint32_t PMURST     : 1;            /*!< Power control reset                                                       */
            uint32_t            : 3;
    } APB1RST_b;
  } ;

  union {
    __IOM uint32_t AHBEN;                       /*!< AHB enable register (RCU_AHBEN)                                           */

