RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA clock enable                                                          */
            uint32_t            : 1;
      __IOM uint32_t SRAMSPEN   : 1;            /*!< SRAM interface clock during sleep mode enable                             */
            uint32_t            : 1;
      __IOM uint32_t FMCSPEN    : 1;            /*!< FMC clock during sleep mode enable                                        */
            uint32_t            : 1;
      __IOM uint32_t CRCEN      : 1;            /*!< CRC clock enable                                                          */
            uint32_t            : 10;
      __IOM uint32_t PAEN       : 1;            /*!< GPIO port A clock enable                                                  */
      __IOM uint32_t PBEN       : 1;            /*!< GPIO port B clock enable                                                  */
      __IOM uint32_t PCEN       : 1;            /*!< GPIO port C clock enable                                                  */
            uint32_t            : 2;
      __IOM uint32_t PFEN       : 1;            /*!< GPIO port F clock enable                                                  */
            uint32_t            : 9;
    } AHBEN_b;
  } ;

  union {
    __IOM uint32_t APB2EN;                      /*!< APB2 enable register (RCU_APB2EN)                                         */

    struct {
      __IOM uint32_t CFGCMPEN   : 1;            /*!< System configuration and comparator clock enable                          */
            uint32_t            : 8;
      __IOM uint32_t ADCEN      : 1;            /*!< ADC interface clock enable                                                */
            uint32_t            : 1;
      __IOM uint32_t TIMER0EN   : 1;            /*!< TIMER0 timer clock enable                                                 */
      __IOM uint32_t SPI0EN     : 1;            /*!< SPI0 clock enable                                                         */
            uint32_t            : 1;
      __IOM uint32_t USART0EN   : 1;            /*!< USART0 clock enable                                                       */
            uint32_t            : 1;
      __IOM uint32_t TIMER14EN  : 1;            /*!< TIMER14 timer clock enable                                                */
      __IOM uint32_t TIMER15EN  : 1;            /*!< TIMER15 timer clock enable                                                */
      __IOM uint32_t TIMER16EN  : 1;            /*!< TIMER16 timer clock enable                                                */
            uint32_t            : 3;
      __IOM uint32_t DBGMCUEN   : 1;            /*!< DBGMCU clock enable                                                       */
            uint32_t            : 9;
    } APB2EN_b;
  } ;

  union {
    __IOM uint32_t APB1EN;                      /*!< APB1 enable register (RCU_APB1EN)                                         */

    struct {
            uint32_t            : 1;
      __IOM uint32_t TIMER2EN   : 1;            /*!< TIMER2 timer clock enable                                                 */
            uint32_t            : 2;
      __IOM uint32_t TIMER5EN   : 1;            /*!< TIMER5 timer clock enable                                                 */
            uint32_t            : 3;
      __IOM uint32_t TIMER13EN  : 1;            /*!< TIMER13 timer clock enable                                                */
            uint32_t            : 2;
      __IOM uint32_t WWDGTEN    : 1;            /*!< Window watchdog timer clock enable                                        */
            uint32_t            : 2;
      __IOM uint32_t SPI1EN     : 1;            /*!< SPI1 clock enable                                                         */
            uint32_t            : 2;
      __IOM uint32_t USART1EN   : 1;            /*!< USART1 clock enable                                                       */
            uint32_t            : 3;
      __IOM uint32_t I2C0EN     : 1;            /*!< I2C0 clock enable                                                         */
      __IOM uint32_t I2C1EN     : 1;            /*!< I2C1 clock enable                                                         */
            uint32_t            : 5;
      __IOM uint32_t PMUEN      : 1;            /*!< Power interface clock enable                                              */
            uint32_t            : 3;
    } APB1EN_b;
  } ;

  union {
    __IOM uint32_t BDCTL;                       /*!< Backup domain control register (RCU_BDCTL)                                */

    struct {
      __IOM uint32_t LXTALEN    : 1;            /*!< LXTAL enable                                                              */
      __IM  uint32_t LXTALSTB   : 1;            /*!< External low-speed oscillator stabilization                               */
      __IOM uint32_t LXTALBPS   : 1;            /*!< LXTAL bypass mode enable                                                  */
      __IOM uint32_t LXTALDRI   : 2;            /*!< LXTAL drive capability                                                    */
            uint32_t            : 3;
      __IOM uint32_t RTCSRC     : 2;            /*!< RTC clock entry selection                                                 */
            uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< RTC clock enable                                                          */
      __IOM uint32_t BKPRST     : 1;            /*!< Backup domain reset                                                       */
            uint32_t            : 15;
    } BDCTL_b;
  } ;

  union {
    __IOM uint32_t RSTSCK;                      /*!< Reset source /clock register (RCU_RSTSCK)                                 */

    struct {
      __IOM uint32_t IRC40KEN   : 1;            /*!< IRC40K enable                                                             */
      __IM  uint32_t IRC40KSTB  : 1;            /*!< IRC40K stabilization                                                      */
            uint32_t            : 21;
      __IOM uint32_t V12RSTF    : 1;            /*!< V12 domain Power reset flag                                               */
      __IOM uint32_t RSTFC      : 1;            /*!< Reset flag clear                                                          */
      __IOM uint32_t OBLRSTF    : 1;            /*!< Option byte loader reset flag                                             */
      __IOM uint32_t EPRSTF     : 1;            /*!< External PIN reset flag                                                   */
      __IOM uint32_t PORRSTF    : 1;            /*!< Power reset flag                                                          */
      __IOM uint32_t SWRSTF     : 1;            /*!< Software reset flag                                                       */
      __IOM uint32_t FWDGTRSTF  : 1;            /*!< Free Watchdog timer reset flag                                            */
      __IOM uint32_t WWDGTRSTF  : 1;            /*!< Window watchdog timer reset flag                                          */
      __IOM uint32_t LPRSTF     : 1;            /*!< Low-power reset flag                                                      */
    } RSTSCK_b;
  } ;

  union {
    __IOM uint32_t AHBRST;                      /*!< AHB reset register                                                        */

