RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
            uint32_t            : 17;
      __IOM uint32_t PARST      : 1;            /*!< GPIO port A reset                                                         */
      __IOM uint32_t PBRST      : 1;            /*!< GPIO port B reset                                                         */
      __IOM uint32_t PCRST      : 1;            /*!< GPIO port C reset                                                         */
            uint32_t            : 2;
      __IOM uint32_t PFRST      : 1;            /*!< GPIO port F reset                                                         */
            uint32_t            : 9;
    } AHBRST_b;
  } ;

  union {
    __IOM uint32_t CFG1;                        /*!< Configuration register 1                                                  */

    struct {
      __IOM uint32_t PREDV      : 4;            /*!< CK_HXTAL or CK_IRC48M divider previous PLL                                */
            uint32_t            : 28;
    } CFG1_b;
  } ;

  union {
    __IOM uint32_t CFG2;                        /*!< Configuration register 2                                                  */

    struct {
      __IOM uint32_t USART0SEL  : 2;            /*!< CK_USART0 clock source selection                                          */
            uint32_t            : 6;
      __IOM uint32_t ADCSEL     : 1;            /*!< CK_ADC clock source selection                                             */
            uint32_t            : 7;
      __IOM uint32_t IRC28MDIV  : 1;            /*!< CK_IRC28M divider 2 or not                                                */
            uint32_t            : 14;
      __IOM uint32_t ADCPSC     : 1;            /*!< Bit 2 of ADCPSC                                                           */
    } CFG2_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control register 1                                                        */

    struct {
      __IOM uint32_t IRC28MEN   : 1;            /*!< IRC28M Internal 28M RC oscillator Enable                                  */
      __IM  uint32_t IRC28MSTB  : 1;            /*!< IRC28M Internal 28M RC Oscillator stabilization Flag                      */
            uint32_t            : 1;
      __IOM uint32_t IRC28MADJ  : 5;            /*!< Internal 28M RC Oscillator clock trim adjust value                        */
      __IM  uint32_t IRC28MCALIB : 8;           /*!< Internal 28M RC Oscillator calibration value register                     */
            uint32_t            : 16;
    } CTL1_b;
  } ;
  __IM  uint32_t  RESERVED[50];

  union {
    __IOM uint32_t VKEY;                        /*!< Voltage key register                                                      */

    struct {
      __OM  uint32_t KEY        : 32;           /*!< The key of RCU_DSV register                                               */
    } VKEY_b;
  } ;
  __IM  uint32_t  RESERVED1[12];

  union {
    __IOM uint32_t DSV;                         /*!< Deep-sleep mode voltage register                                          */

    struct {
      __IOM uint32_t DSLPVS     : 2;            /*!< Deep-sleep mode voltage select                                            */
            uint32_t            : 30;
    } DSV_b;
  } ;
} RCU_Type;                                     /*!< Size = 312 (0x138)                                                        */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */

  union {
    __IOM uint32_t TIME;                        /*!< time register                                                             */

    struct {
      __IOM uint32_t SCU        : 4;            /*!< Second units in BCD code                                                  */
      __IOM uint32_t SCT        : 3;            /*!< Second tens in BCD code                                                   */
            uint32_t            : 1;
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD code                                                  */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD code                                                   */
            uint32_t            : 1;
      __IOM uint32_t HRU        : 4;            /*!< Hour units in BCD format                                                  */
      __IOM uint32_t HRT        : 2;            /*!< Hour tens in BCD code                                                     */
      __IOM uint32_t PM         : 1;            /*!< AM/PM mark                                                                */
            uint32_t            : 9;
    } TIME_b;
  } ;

  union {
    __IOM uint32_t DATE;                        /*!< date register                                                             */

    struct {
      __IOM uint32_t DAYU       : 4;            /*!< Date units in BCD code                                                    */
      __IOM uint32_t DAYT       : 2;            /*!< Date tens in BCD code                                                     */
            uint32_t            : 2;
      __IOM uint32_t MONU       : 4;            /*!< Month units in BCD code                                                   */
      __IOM uint32_t MONT       : 1;            /*!< Month tens in BCD code                                                    */
      __IOM uint32_t DOW        : 3;            /*!< Days of the week                                                          */
      __IOM uint32_t YRU        : 4;            /*!< Year units in BCD code                                                    */
      __IOM uint32_t YRT        : 4;            /*!< Year tens in BCD code                                                     */
            uint32_t            : 8;
    } DATE_b;
  } ;

  union {
    __IOM uint32_t CTL;                         /*!< control register                                                          */

