RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t TSEG       : 1;            /*!< Time-stamp event active edge                                              */
      __IOM uint32_t REFEN      : 1;            /*!< RTC_REFIN reference clock detection enable (50 or 60 Hz)                  */
      __IOM uint32_t BPSHAD     : 1;            /*!< Bypass the shadow registers                                               */
      __IOM uint32_t CS         : 1;            /*!< Hour format                                                               */
            uint32_t            : 1;
      __IOM uint32_t ALRM0EN    : 1;            /*!< Alarm A enable                                                            */
            uint32_t            : 2;
      __IOM uint32_t TSEN       : 1;            /*!< timestamp enable                                                          */
      __IOM uint32_t ALRM0IE    : 1;            /*!< Alarm A interrupt enable                                                  */
            uint32_t            : 2;
      __IOM uint32_t TSIE       : 1;            /*!< Time-stamp interrupt enable                                               */
      __OM  uint32_t A1H        : 1;            /*!< Add 1 hour (summer time change)                                           */
      __OM  uint32_t S1H        : 1;            /*!< Subtract 1 hour (winter time change)                                      */
      __IOM uint32_t DSM        : 1;            /*!< Backup                                                                    */
      __IOM uint32_t COS        : 1;            /*!< Calibration output selection                                              */
      __IOM uint32_t OPOL       : 1;            /*!< Output polarity                                                           */
      __IOM uint32_t OS         : 2;            /*!< Output selection                                                          */
      __IOM uint32_t COEN       : 1;            /*!< Calibration output enable                                                 */
            uint32_t            : 8;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< initialization and status register                                        */

    struct {
      __IM  uint32_t ALRM0WF    : 1;            /*!< Alarm A write flag                                                        */
            uint32_t            : 2;
      __IM  uint32_t SOPF       : 1;            /*!< Shift operation pending                                                   */
      __IM  uint32_t YCM        : 1;            /*!< Initialization status flag                                                */
      __IOM uint32_t RSYNF      : 1;            /*!< Registers synchronization flag                                            */
      __IM  uint32_t INITF      : 1;            /*!< Initialization flag                                                       */
      __IOM uint32_t INITM      : 1;            /*!< Initialization mode                                                       */
      __IOM uint32_t ALRM0F     : 1;            /*!< Alarm A flag                                                              */
            uint32_t            : 2;
      __IOM uint32_t TSF        : 1;            /*!< Time-stamp flag                                                           */
      __IOM uint32_t TSOVRF     : 1;            /*!< Time-stamp overflow flag                                                  */
      __IOM uint32_t TP0F       : 1;            /*!< RTC_TAMP0 detection flag                                                  */
      __IOM uint32_t TP1F       : 1;            /*!< RTC_TAMP1 detection flag                                                  */
            uint32_t            : 1;
      __IM  uint32_t SCPF       : 1;            /*!< Recalibration pending Flag                                                */
            uint32_t            : 15;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler register                                                        */

    struct {
      __IOM uint32_t FACTOR_S   : 15;           /*!< Synchronous prescaler factor                                              */
            uint32_t            : 1;
      __IOM uint32_t FACTOR_A   : 7;            /*!< Asynchronous prescaler factor                                             */
            uint32_t            : 9;
    } PSC_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t ALRM0TD;                     /*!< alarm A register                                                          */

    struct {
      __IOM uint32_t SCU        : 4;            /*!< Second units in BCD format.                                               */
      __IOM uint32_t SCT        : 3;            /*!< Second tens in BCD format.                                                */
      __IOM uint32_t MSKS       : 1;            /*!< Alarm seconds mask                                                        */
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD format.                                               */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD format.                                                */
      __IOM uint32_t MSKM       : 1;            /*!< Alarm minutes mask                                                        */
      __IOM uint32_t HRU        : 4;            /*!< Hour units in BCD format.                                                 */
      __IOM uint32_t HRT        : 2;            /*!< Hour tens in BCD format.                                                  */
      __IOM uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
      __IOM uint32_t MSKH       : 1;            /*!< Alarm hours mask                                                          */
      __IOM uint32_t DAYU       : 4;            /*!< Date units or day in BCD format.                                          */
      __IOM uint32_t DAYT       : 2;            /*!< Date tens in BCD format.                                                  */
      __IOM uint32_t DOWS       : 1;            /*!< Week day selection                                                        */
      __IOM uint32_t MSKD       : 1;            /*!< Alarm date mask                                                           */
    } ALRM0TD_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __OM  uint32_t WPK;                         /*!< write protection register                                                 */

