RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __OM  uint32_t WPK        : 8;            /*!< Write protection key                                                      */
            uint32_t            : 24;
    } WPK_b;
  } ;

  union {
    __IM  uint32_t SS;                          /*!< sub second register                                                       */

    struct {
      __IM  uint32_t SSC        : 16;           /*!< Sub second value                                                          */
            uint32_t            : 16;
    } SS_b;
  } ;

  union {
    __OM  uint32_t SHIFTCTL;                    /*!< shift control register                                                    */

    struct {
      __OM  uint32_t SFS        : 15;           /*!< Subtract a fraction of a second                                           */
            uint32_t            : 16;
      __OM  uint32_t A1S        : 1;            /*!< One second add                                                            */
    } SHIFTCTL_b;
  } ;

  union {
    __IM  uint32_t TTS;                         /*!< timestamp time register                                                   */

    struct {
      __IM  uint32_t SCU        : 4;            /*!< Second units in BCD code                                                  */
      __IM  uint32_t SCT        : 3;            /*!< Second tens in BCD code                                                   */
            uint32_t            : 1;
      __IM  uint32_t MNU        : 4;            /*!< Minute units in BCD code                                                  */
      __IM  uint32_t MNT        : 3;            /*!< Minute tens in BCD code                                                   */
            uint32_t            : 1;
      __IM  uint32_t HRU        : 4;            /*!< Hour units in BCD code                                                    */
      __IM  uint32_t HRT        : 2;            /*!< Hour tens in BCD code                                                     */
      __IM  uint32_t PM         : 1;            /*!< AM/PM mark                                                                */
            uint32_t            : 9;
    } TTS_b;
  } ;

  union {
    __IM  uint32_t DTS;                         /*!< Date of time stamp register                                               */

    struct {
      __IM  uint32_t DAYU       : 5;            /*!< Date units in BCD code                                                    */
      __IM  uint32_t DAYT       : 2;            /*!< Date tens in BCD code                                                     */
            uint32_t            : 1;
      __IM  uint32_t MONU       : 4;            /*!< Month units in BCD code                                                   */
      __IM  uint32_t MONT       : 1;            /*!< Month tens in BCD code                                                    */
      __IM  uint32_t DOW        : 3;            /*!< Week day units                                                            */
            uint32_t            : 16;
    } DTS_b;
  } ;

  union {
    __IM  uint32_t SSTS;                        /*!< time-stamp sub second register                                            */

    struct {
      __IM  uint32_t SSC        : 16;           /*!< Sub second value                                                          */
            uint32_t            : 16;
    } SSTS_b;
  } ;

  union {
    __IOM uint32_t HRFC;                        /*!< High resolution frequency compensation register                           */

    struct {
      __IOM uint32_t CMSK       : 9;            /*!< Calibration mask number                                                   */
            uint32_t            : 4;
      __IOM uint32_t CWND16     : 1;            /*!< Frequency compensation window 16 second selected                          */
      __IOM uint32_t CWND8      : 1;            /*!< Frequency compensation window 8 second selected                           */
      __IOM uint32_t FREQI      : 1;            /*!< Increase RTC frequency by 488.5PPM                                        */
            uint32_t            : 16;
    } HRFC_b;
  } ;

  union {
    __IOM uint32_t TAMP;                        /*!< tamper and alternate function configuration register                      */

    struct {
      __IOM uint32_t TP0EN      : 1;            /*!< Tamper 0 event trigger edge                                               */
      __IOM uint32_t TP0EG      : 1;            /*!< Active level for RTC_TAMP1 input                                          */
      __IOM uint32_t TPIE       : 1;            /*!< Tamper detection interrupt enable                                         */
      __IOM uint32_t TP1EN      : 1;            /*!< Tamper 1 detection enable                                                 */
      __IOM uint32_t TP1EG      : 1;            /*!< Tamper 1 event trigger edge                                               */
            uint32_t            : 2;
      __IOM uint32_t TPTS       : 1;            /*!< Activate timestamp on tamper detection event                              */
      __IOM uint32_t FREQ       : 3;            /*!< Tamper sampling frequency                                                 */
      __IOM uint32_t FLT        : 2;            /*!< RTC_TAMPx filter count                                                    */
      __IOM uint32_t PRCH       : 2;            /*!< RTC_TAMPx precharge duration                                              */
      __IOM uint32_t DISPU      : 1;            /*!< RTC_TAMPx pull-up disable                                                 */
            uint32_t            : 2;
      __IOM uint32_t PC13VAL    : 1;            /*!< RTC_ALARM output type/PC13 value                                          */
      __IOM uint32_t PC13MDE    : 1;            /*!< PC13 mode                                                                 */
      __IOM uint32_t PC14VAL    : 1;            /*!< PC14 value                                                                */
      __IOM uint32_t PC14MDE    : 1;            /*!< PC14 mode                                                                 */
      __IOM uint32_t PC15VAL    : 1;            /*!< PC15 value                                                                */
      __IOM uint32_t PC15MDE    : 1;            /*!< PC15 mode                                                                 */
            uint32_t            : 8;
    } TAMP_b;
  } ;

  union {
    __IOM uint32_t ALRM0SS;                     /*!< alarm 0 sub second register                                               */

