RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t SSC        : 15;           /*!< Alarm sub second value                                                    */
            uint32_t            : 9;
      __IOM uint32_t MSKSSC     : 4;            /*!< Mask control bit of SSC                                                   */
            uint32_t            : 4;
    } ALRM0SS_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t BKP0;                        /*!< backup register                                                           */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP0_b;
  } ;

  union {
    __IOM uint32_t BKP1;                        /*!< backup register                                                           */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP1_b;
  } ;

  union {
    __IOM uint32_t BKP2;                        /*!< backup register                                                           */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP2_b;
  } ;

  union {
    __IOM uint32_t BKP3;                        /*!< backup register                                                           */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP3_b;
  } ;

  union {
    __IOM uint32_t BKP4;                        /*!< backup register                                                           */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< BKP data                                                                  */
    } BKP4_b;
  } ;
} RTC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI0)
  */

typedef struct {                                /*!< SPI0 Structure                                                            */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CKPH       : 1;            /*!< Clock Phase Selection                                                     */
      __IOM uint32_t CKPL       : 1;            /*!< Clock Polarity Selection                                                  */
      __IOM uint32_t MSTMOD     : 1;            /*!< Master Mode Enable                                                        */
      __IOM uint32_t PSC        : 3;            /*!< Master Clock Prescaler Selection                                          */
      __IOM uint32_t SPIEN      : 1;            /*!< SPI enable                                                                */
      __IOM uint32_t LF         : 1;            /*!< LSB First Mode                                                            */
      __IOM uint32_t SWNSS      : 1;            /*!< NSS Pin Selection In NSS Software Mode                                    */
      __IOM uint32_t SWNSSEN    : 1;            /*!< NSS Software Mode Selection                                               */
      __IOM uint32_t RO         : 1;            /*!< Receive only                                                              */
      __IOM uint32_t FF16       : 1;            /*!< Data frame format                                                         */
      __IOM uint32_t CRCNT      : 1;            /*!< CRC transfer next                                                         */
      __IOM uint32_t CRCEN      : 1;            /*!< Hardware CRC calculation enable                                           */
      __IOM uint32_t BDOEN      : 1;            /*!< Bidirectional Transmit output enable                                      */
      __IOM uint32_t BDEN       : 1;            /*!< Bidirectional enable                                                      */
            uint32_t            : 16;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t DMAREN     : 1;            /*!< Rx buffer DMA enable                                                      */
      __IOM uint32_t DMATEN     : 1;            /*!< Tx buffer DMA enable                                                      */
      __IOM uint32_t NSSDRV     : 1;            /*!< NSS output enable                                                         */
      __IOM uint32_t NSSP       : 1;            /*!< SPI NSS Pulse Mode Enable                                                 */
      __IOM uint32_t TMOD       : 1;            /*!< SPI TI Mode Enable                                                        */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RBNEIE     : 1;            /*!< Receive Buffer Not Empty Interrupt Enable                                 */
      __IOM uint32_t TBEIE      : 1;            /*!< Transmit Buffer Empty Interrupt Enable                                    */
            uint32_t            : 24;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< status register                                                           */

