RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IM  uint32_t RBNE       : 1;            /*!< Receive Buffer Not Empty                                                  */
      __IM  uint32_t TBE        : 1;            /*!< Transmit Buffer Empty                                                     */
      __IM  uint32_t I2SCH      : 1;            /*!< I2S channel side                                                          */
      __IM  uint32_t TXURERR    : 1;            /*!< Transmission underrun error bit                                           */
      __IOM uint32_t CRCERR     : 1;            /*!< SPI CRC Error Bit                                                         */
      __IM  uint32_t CONFERR    : 1;            /*!< SPI Configuration error                                                   */
      __IM  uint32_t RXORERR    : 1;            /*!< Reception Overrun Error Bit                                               */
      __IM  uint32_t TRANS      : 1;            /*!< Transmitting On-going Bit                                                 */
      __IOM uint32_t FERR       : 1;            /*!< Format Error                                                              */
            uint32_t            : 23;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t DATA;                        /*!< data register                                                             */

    struct {
      __IOM uint32_t DATA       : 16;           /*!< Data register                                                             */
            uint32_t            : 16;
    } DATA_b;
  } ;

  union {
    __IOM uint32_t CPCPOLY;                     /*!< CRC polynomial register                                                   */

    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< CRC polynomial register                                                   */
            uint32_t            : 16;
    } CPCPOLY_b;
  } ;

  union {
    __IM  uint32_t RCRC;                        /*!< RX CRC register                                                           */

    struct {
      __IM  uint32_t RCRC       : 16;           /*!< RX RCR register                                                           */
            uint32_t            : 16;
    } RCRC_b;
  } ;

  union {
    __IM  uint32_t TCRC;                        /*!< TX CRC register                                                           */

    struct {
      __IM  uint32_t TCRC       : 16;           /*!< Tx CRC register                                                           */
            uint32_t            : 16;
    } TCRC_b;
  } ;

  union {
    __IOM uint32_t I2SCTL;                      /*!< I2S configuration register                                                */

    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< Channel length (number of bits per audio channel)                         */
      __IOM uint32_t DTLEN      : 2;            /*!< Data length to be transferred                                             */
      __IOM uint32_t CKPL       : 1;            /*!< Idle state clock polarity                                                 */
      __IOM uint32_t I2SSTD     : 2;            /*!< I2S standard selection                                                    */
            uint32_t            : 1;
      __IOM uint32_t PCMSMOD    : 1;            /*!< PCM frame synchronization                                                 */
      __IOM uint32_t I2SOPMOD   : 2;            /*!< I2S configuration mode                                                    */
      __IOM uint32_t I2SEN      : 1;            /*!< I2S Enable                                                                */
      __IOM uint32_t I2SSEL     : 1;            /*!< I2S mode selection                                                        */
            uint32_t            : 20;
    } I2SCTL_b;
  } ;

  union {
    __IOM uint32_t I2SPSC;                      /*!< I2S prescaler register                                                    */

    struct {
      __IOM uint32_t DIV        : 8;            /*!< Dividing factor for the prescaler                                         */
      __IOM uint32_t OF         : 1;            /*!< Odd factor for the prescaler                                              */
      __IOM uint32_t MCKOEN     : 1;            /*!< I2S_MCK output enable                                                     */
            uint32_t            : 22;
    } I2SPSC_b;
  } ;
} SPI_Type;                                     /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial Peripheral Interface 1 (SPI1)
  */

typedef struct {                                /*!< SPI1 Structure                                                            */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CKPH       : 1;            /*!< Clock Phase Selection                                                     */
      __IOM uint32_t CKPL       : 1;            /*!< Clock Polarity Selection                                                  */
      __IOM uint32_t MSTMOD     : 1;            /*!< Master Mode Enable                                                        */
      __IOM uint32_t PSC        : 3;            /*!< Master Clock Prescaler Selection                                          */
      __IOM uint32_t SPIEN      : 1;            /*!< SPI enable                                                                */
      __IOM uint32_t LF         : 1;            /*!< LSB First Mode                                                            */
      __IOM uint32_t SWNSS      : 1;            /*!< NSS Pin Selection In NSS Software Mode                                    */
      __IOM uint32_t SWNSSEN    : 1;            /*!< NSS Software Mode Selection                                               */
      __IOM uint32_t RO         : 1;            /*!< Receive only                                                              */
      __IOM uint32_t CRCL       : 1;            /*!< CRC length                                                                */
      __IOM uint32_t CRCNT      : 1;            /*!< CRC transfer next                                                         */
      __IOM uint32_t CRCEN      : 1;            /*!< Hardware CRC calculation enable                                           */
      __IOM uint32_t BDOEN      : 1;            /*!< Bidirectional Transmit output enable                                      */
      __IOM uint32_t BDEN       : 1;            /*!< Bidirectional enable                                                      */
            uint32_t            : 16;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

