RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t DMAREN     : 1;            /*!< Rx buffer DMA enable                                                      */
      __IOM uint32_t DMATEN     : 1;            /*!< Tx buffer DMA enable                                                      */
      __IOM uint32_t NSSDRV     : 1;            /*!< NSS output enable                                                         */
      __IOM uint32_t NSSP       : 1;            /*!< SPI NSS Pulse Mode Enable                                                 */
      __IOM uint32_t TMOD       : 1;            /*!< SPI TI Mode Enable                                                        */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RBNEIE     : 1;            /*!< Receive Buffer Not Empty Interrupt Enable                                 */
      __IOM uint32_t TBEIE      : 1;            /*!< Transmit Buffer Empty Interrupt Enable                                    */
      __IOM uint32_t DZ         : 4;            /*!< Date size                                                                 */
      __IOM uint32_t BYTEN      : 1;            /*!< Byte access enable                                                        */
      __IOM uint32_t RXDMA_ODD  : 1;            /*!< Odd bytes in RX DMA channel                                               */
      __IOM uint32_t TXDMA_ODD  : 1;            /*!< Odd bytes in TX DMA channel                                               */
            uint32_t            : 17;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< status register                                                           */

    struct {
      __IM  uint32_t RBNE       : 1;            /*!< Receive Buffer Not Empty                                                  */
      __IM  uint32_t TBE        : 1;            /*!< Transmit Buffer Empty                                                     */
            uint32_t            : 2;
      __IOM uint32_t CRCERR     : 1;            /*!< SPI CRC Error Bit                                                         */
      __IM  uint32_t CONFERR    : 1;            /*!< SPI Configuration error                                                   */
      __IM  uint32_t RXORERR    : 1;            /*!< Reception Overrun Error Bit                                               */
      __IM  uint32_t TRANS      : 1;            /*!< Transmitting On-going Bit                                                 */
      __IOM uint32_t FERR       : 1;            /*!< Format Error                                                              */
      __IM  uint32_t RXLVL      : 2;            /*!< Rx FIFO level                                                             */
      __IM  uint32_t TXLVL      : 2;            /*!< Tx FIFO level                                                             */
            uint32_t            : 19;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t DATA;                        /*!< data register                                                             */

    struct {
      __IOM uint32_t DATA       : 16;           /*!< Data register                                                             */
            uint32_t            : 16;
    } DATA_b;
  } ;

  union {
    __IOM uint32_t CPCPOLY;                     /*!< CRC polynomial register                                                   */

    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< CRC polynomial register                                                   */
            uint32_t            : 16;
    } CPCPOLY_b;
  } ;

  union {
    __IM  uint32_t RCRC;                        /*!< RX CRC register                                                           */

    struct {
      __IM  uint32_t RCRC       : 16;           /*!< RX RCR register                                                           */
            uint32_t            : 16;
    } RCRC_b;
  } ;

  union {
    __IM  uint32_t TCRC;                        /*!< TX CRC register                                                           */

    struct {
      __IM  uint32_t TCRC       : 16;           /*!< Tx CRC register                                                           */
            uint32_t            : 16;
    } TCRC_b;
  } ;

  union {
    __IOM uint32_t I2SCTL;                      /*!< I2S configuration register                                                */

    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< Channel length (number of bits per audio channel)                         */
      __IOM uint32_t DTLEN      : 2;            /*!< Data length to be transferred                                             */
      __IOM uint32_t CKPL       : 1;            /*!< Idle state clock polarity                                                 */
      __IOM uint32_t I2SSTD     : 2;            /*!< I2S standard selection                                                    */
            uint32_t            : 1;
      __IOM uint32_t PCMSMOD    : 1;            /*!< PCM frame synchronization                                                 */
      __IOM uint32_t I2SOPMOD   : 2;            /*!< I2S configuration mode                                                    */
      __IOM uint32_t I2SEN      : 1;            /*!< I2S Enable                                                                */
      __IOM uint32_t I2SSEL     : 1;            /*!< I2S mode selection                                                        */
            uint32_t            : 20;
    } I2SCTL_b;
  } ;

  union {
    __IOM uint32_t I2SPSC;                      /*!< I2S prescaler register                                                    */

    struct {
      __IOM uint32_t DIV        : 8;            /*!< Dividing factor for the prescaler                                         */
      __IOM uint32_t OF         : 1;            /*!< Odd factor for the prescaler                                              */
      __IOM uint32_t MCKOEN     : 1;            /*!< I2S_MCK output enable                                                     */
            uint32_t            : 22;
    } I2SPSC_b;
  } ;
  __IM  uint32_t  RESERVED[23];

  union {
    __IOM uint32_t QCTL;                        /*!< SPI quad wird control register                                            */

