RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t QMOD       : 1;            /*!< Quad wire mode enable                                                     */
      __IOM uint32_t QRD        : 1;            /*!< Quad wire read select                                                     */
      __IOM uint32_t IO23_DRV   : 1;            /*!< Drive IO2 and IO3 enable                                                  */
            uint32_t            : 29;
    } QCTL_b;
  } ;
} SPI1_Type;                                    /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< SYSCFG Structure                                                          */

  union {
    __IOM uint32_t CFG0;                        /*!< System configuration register 0                                           */

    struct {
      __IM  uint32_t BOOT_MODE  : 2;            /*!< Boot mode                                                                 */
            uint32_t            : 2;
      __IOM uint32_t PA11_PA12_RMP : 1;         /*!< PA11 and PA12 remapping bit for small packages                            */
            uint32_t            : 3;
      __IOM uint32_t ADC_DMA_RMP : 1;           /*!< ADC DMA request remapping enable                                          */
      __IOM uint32_t USART0_TX_DMA_RMP : 1;     /*!< USART0_TX DMA request remapping enable                                    */
      __IOM uint32_t USART0_RX_DMA_RMP : 1;     /*!< USART0_RX DMA request remapping enable                                    */
      __IOM uint32_t TIMER15_DMA_RMP : 1;       /*!< Timer 15 DMA request remapping enable                                     */
      __IOM uint32_t TIMER16_DMA_RMP : 1;       /*!< Timer 16 DMA request remapping enable                                     */
            uint32_t            : 6;
      __IOM uint32_t PB9_HCCE   : 1;            /*!< PB9 pin high current capability enable                                    */
            uint32_t            : 12;
    } CFG0_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t EXTISS0;                     /*!< EXTI sources selection register 0                                         */

    struct {
      __IOM uint32_t EXTI0_SS   : 4;            /*!< EXTI 0 sources selection                                                  */
      __IOM uint32_t EXTI1_SS   : 4;            /*!< EXTI 1 sources selection                                                  */
      __IOM uint32_t EXTI2_SS   : 4;            /*!< EXTI 2 sources selection                                                  */
      __IOM uint32_t EXTI3_SS   : 4;            /*!< EXTI 3 sources selection                                                  */
            uint32_t            : 16;
    } EXTISS0_b;
  } ;

  union {
    __IOM uint32_t EXTISS1;                     /*!< EXTI sources selection register 1                                         */

    struct {
      __IOM uint32_t EXTI4_SS   : 4;            /*!< EXTI 4 sources selection                                                  */
      __IOM uint32_t EXTI5_SS   : 4;            /*!< EXTI 5 sources selection                                                  */
      __IOM uint32_t EXTI6_SS   : 4;            /*!< EXTI 6 sources selection                                                  */
      __IOM uint32_t EXTI7_SS   : 4;            /*!< EXTI 7 sources selection                                                  */
            uint32_t            : 16;
    } EXTISS1_b;
  } ;

  union {
    __IOM uint32_t EXTISS2;                     /*!< EXTI sources selection register 2                                         */

    struct {
      __IOM uint32_t EXTI8_SS   : 4;            /*!< EXTI 8 sources selection                                                  */
      __IOM uint32_t EXTI9_SS   : 4;            /*!< EXTI 9 sources selection                                                  */
      __IOM uint32_t EXTI10_SS  : 4;            /*!< EXTI 10 sources selection                                                 */
      __IOM uint32_t EXTI11_SS  : 4;            /*!< EXTI 11 sources selection                                                 */
            uint32_t            : 16;
    } EXTISS2_b;
  } ;

  union {
    __IOM uint32_t EXTISS3;                     /*!< EXTI sources selection register 3                                         */

    struct {
      __IOM uint32_t EXTI12_SS  : 4;            /*!< EXTI 12 sources selection                                                 */
      __IOM uint32_t EXTI13_SS  : 4;            /*!< EXTI 13 sources selection                                                 */
      __IOM uint32_t EXTI14_SS  : 4;            /*!< EXTI 14 sources selection                                                 */
      __IOM uint32_t EXTI15_SS  : 4;            /*!< EXTI 15 sources selection                                                 */
            uint32_t            : 16;
    } EXTISS3_b;
  } ;

  union {
    __IOM uint32_t CFG2;                        /*!< System configuration register 2                                           */

    struct {
      __IOM uint32_t LOCKUP_LOCK : 1;           /*!< Cortex-M4 LOCKUP output lock                                              */
      __IOM uint32_t SRAM_PARITY_ERROR_LOCK : 1;/*!< SRAM parity check error lock                                              */
      __IOM uint32_t LVD_LOCK   : 1;            /*!< LVD lock                                                                  */
            uint32_t            : 5;
      __IOM uint32_t SRAM_PCEF  : 1;            /*!< SRAM parity check error flag                                              */
            uint32_t            : 23;
    } CFG2_b;
  } ;
  __IM  uint32_t  RESERVED1[57];

  union {
    __IOM uint32_t CPU_IRQ_LAT;                 /*!< IRQ Latency register                                                      */

