RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t IRQ_LATENCY : 8;           /*!< specifies the minimum number of cycles between an interrupt               */
            uint32_t            : 24;
    } CPU_IRQ_LAT_b;
  } ;
} SYSCFG_Type;                                  /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIMER0)
  */

typedef struct {                                /*!< TIMER0 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t SPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint32_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint32_t CAM        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKDIV      : 2;            /*!< Clock division                                                            */
            uint32_t            : 22;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
      __IOM uint32_t CCSE       : 1;            /*!< Commutation control shadow enable                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUC       : 1;            /*!< Commutation control shadow register update control                        */
      __IOM uint32_t DMAS       : 1;            /*!< DMA request source selection                                              */
      __IOM uint32_t MMC        : 3;            /*!< Master mode control                                                       */
      __IOM uint32_t TI0S       : 1;            /*!< Channel 0 trigger input selection                                         */
      __IOM uint32_t ISO0       : 1;            /*!< Idle state of channel 0 output                                            */
      __IOM uint32_t ISO0N      : 1;            /*!< Idle state of channel 0 complementary output                              */
      __IOM uint32_t ISO1       : 1;            /*!< Idle state of channel 1 output                                            */
      __IOM uint32_t ISO1N      : 1;            /*!< Idle state of channel 1 complementary output                              */
      __IOM uint32_t ISO2       : 1;            /*!< Idle state of channel 2 output                                            */
      __IOM uint32_t ISO2N      : 1;            /*!< Idle state of channel 2 complementary output                              */
      __IOM uint32_t ISO3       : 1;            /*!< Idle state of channel 3 output                                            */
            uint32_t            : 17;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SMCFG;                       /*!< slave mode configuration register                                         */

    struct {
      __IOM uint32_t SMC        : 3;            /*!< Slave mode selection                                                      */
      __IOM uint32_t OCRC       : 1;            /*!< Trigger selection                                                         */
      __IOM uint32_t TRGS       : 3;            /*!< Trigger selection                                                         */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
      __IOM uint32_t ETFC       : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPSC      : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t SCM1       : 1;            /*!< Part of SMC for enable External clock mode1                               */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
            uint32_t            : 16;
    } SMCFG_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
      __IOM uint32_t CH1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CH2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
      __IOM uint32_t CH3IE      : 1;            /*!< Capture/Compare 3 interrupt enable                                        */
      __IOM uint32_t CMTIE      : 1;            /*!< COM interrupt enable                                                      */
      __IOM uint32_t TRGIE      : 1;            /*!< Trigger interrupt enable                                                  */
      __IOM uint32_t BRKIE      : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CH0DEN     : 1;            /*!< Capture/Compare 0 DMA request enable                                      */
      __IOM uint32_t CH1DEN     : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CH2DEN     : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
      __IOM uint32_t CH3DEN     : 1;            /*!< Capture/Compare 3 DMA request enable                                      */
      __IOM uint32_t CMTDEN     : 1;            /*!< Reserved                                                                  */
      __IOM uint32_t TRGDEN     : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 17;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< status register                                                           */

