RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
      __IOM uint32_t CH1IF      : 1;            /*!< Capture/Compare 1 interrupt flag                                          */
      __IOM uint32_t CH2IF      : 1;            /*!< Capture/Compare 2 interrupt flag                                          */
      __IOM uint32_t CH3IF      : 1;            /*!< Capture/Compare 3 interrupt flag                                          */
      __IOM uint32_t CMTIF      : 1;            /*!< COM interrupt flag                                                        */
      __IOM uint32_t TRGIF      : 1;            /*!< Trigger interrupt flag                                                    */
      __IOM uint32_t BRKIF      : 1;            /*!< Break interrupt flag                                                      */
            uint32_t            : 1;
      __IOM uint32_t CH0OF      : 1;            /*!< Channel 0 over capture flag                                               */
      __IOM uint32_t CH1OF      : 1;            /*!< Channel 1 over capture flag                                               */
      __IOM uint32_t CH2OF      : 1;            /*!< Channel 2 over capture flag                                               */
      __IOM uint32_t CH3OF      : 1;            /*!< Channel 3 over capture flag                                               */
            uint32_t            : 19;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< Software event generation register                                        */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update event generation                                                   */
      __OM  uint32_t CH0G       : 1;            /*!< Channel 0's capture or compare event generation                           */
      __OM  uint32_t CH1G       : 1;            /*!< Channel 1's capture or compare event generation                           */
      __OM  uint32_t CH2G       : 1;            /*!< Channel 2's capture or compare event generation                           */
      __OM  uint32_t CH3G       : 1;            /*!< Channel 3's capture or compare event generation                           */
      __OM  uint32_t CMTG       : 1;            /*!< Channel commutation event generation                                      */
      __OM  uint32_t TRGG       : 1;            /*!< Trigger event generation                                                  */
      __OM  uint32_t BRKG       : 1;            /*!< Break event generation                                                    */
            uint32_t            : 24;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register (output mode)                               */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Channel 0 I/O mode selection                                              */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Channel 0 output compare fast enable                                      */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Channel 0 compare output shadow enable                                    */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Channel 0 compare output control                                          */
        __IOM uint32_t CH0COMCEN : 1;           /*!< Channel 0 output compare clear enable                                     */
        __IOM uint32_t CH1MS    : 2;            /*!< Channel 1 mode selection                                                  */
        __IOM uint32_t CH1COMFEN : 1;           /*!< Channel 1 output compare fast enable                                      */
        __IOM uint32_t CH1COMSEN : 1;           /*!< Channel 1 output compare shadow enable                                    */
        __IOM uint32_t CH1COMCTL : 3;           /*!< Channel 1 compare output control                                          */
        __IOM uint32_t CH1COMCEN : 1;           /*!< Channel 1 output compare clear enable                                     */
              uint32_t          : 16;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register 0 (input mode)                              */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Channel 0 mode selection                                                  */
        __IOM uint32_t CH0CAPPSC : 2;           /*!< Channel 0 input capture prescaler                                         */
        __IOM uint32_t CH0CAPFLT : 4;           /*!< Channel 0 input capture filter control                                    */
        __IOM uint32_t CH1MS    : 2;            /*!< Channel 1 mode selection                                                  */
        __IOM uint32_t CH1CAPPSC : 2;           /*!< Channel 1 input capture prescaler                                         */
        __IOM uint32_t CH1CAPFLT : 4;           /*!< Channel 1 input capture filter control                                    */
              uint32_t          : 16;
      } CHCTL0_Input_b;
    } ;
  };

  union {
    union {
      __IOM uint32_t CHCTL1_Output;             /*!< capture/compare mode register (output mode)                               */

      struct {
        __IOM uint32_t CH2MS    : 2;            /*!< Channel 2 I/O mode selection                                              */
        __IOM uint32_t CH2COMFEN : 1;           /*!< Channel 2 output compare fast enable                                      */
        __IOM uint32_t CH2COMSEN : 1;           /*!< Channel 2 compare output shadow enable                                    */
        __IOM uint32_t CH2COMCTL : 3;           /*!< Channel 2 compare output control                                          */
        __IOM uint32_t CH2COMCEN : 1;           /*!< Channel 2 output compare clear enable                                     */
        __IOM uint32_t CH3MS    : 2;            /*!< Channel 3 mode selection                                                  */
        __IOM uint32_t CH3COMFEN : 1;           /*!< Channel 3 output compare fast enable                                      */
        __IOM uint32_t CH3COMSEN : 1;           /*!< Channel 3 output compare shadow enable                                    */
        __IOM uint32_t CH3COMCTL : 3;           /*!< Channel 3 compare output control                                          */
        __IOM uint32_t CH3COMCEN : 1;           /*!< Channel 3 output compare clear enable                                     */
              uint32_t          : 16;
      } CHCTL1_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL1_Input;              /*!< capture/compare mode register 1 (input mode)                              */

