RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
      struct {
        __IOM uint32_t CH2MS    : 2;            /*!< Capture/compare 2 selection                                               */
        __IOM uint32_t CH2CAPPSC : 2;           /*!< Input capture 2 prescaler                                                 */
        __IOM uint32_t CH2CAPFLT : 4;           /*!< Input capture 2 filter                                                    */
        __IOM uint32_t CH3MS    : 2;            /*!< Channel 3 mode selection                                                  */
        __IOM uint32_t CH3CAPPSC : 2;           /*!< Channel 3 input capture prescaler                                         */
        __IOM uint32_t CH3CAPFLT : 4;           /*!< Channel 3 input capture filter control                                    */
              uint32_t          : 16;
      } CHCTL1_Input_b;
    } ;
  };

  union {
    __IOM uint32_t CHCTL2;                      /*!< capture/compare enable register                                           */

    struct {
      __IOM uint32_t CH0EN      : 1;            /*!< Capture/Compare 0 output enable                                           */
      __IOM uint32_t CH0P       : 1;            /*!< Capture/Compare 0 output Polarity                                         */
      __IOM uint32_t CH0NEN     : 1;            /*!< Capture/Compare 0 complementary output enable                             */
      __IOM uint32_t CH0NP      : 1;            /*!< Capture/Compare 0 complementary output Polarity                                         */
      __IOM uint32_t CH1EN      : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CH1P       : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CH1NEN     : 1;            /*!< Capture/Compare 1 complementary output enable                             */
      __IOM uint32_t CH1NP      : 1;            /*!< Capture/Compare 1 complementary output Polarity                                         */
      __IOM uint32_t CH2EN      : 1;            /*!< Capture/Compare 2 output enable                                           */
      __IOM uint32_t CH2P       : 1;            /*!< Capture/Compare 2 output Polarity                                         */
      __IOM uint32_t CH2NEN     : 1;            /*!< Capture/Compare 2 complementary output enable                             */
      __IOM uint32_t CH2NP      : 1;            /*!< Capture/Compare 2 complementary output Polarity                                         */
      __IOM uint32_t CH3EN      : 1;            /*!< Capture/Compare 3 output enable                                           */
      __IOM uint32_t CH3P       : 1;            /*!< Capture/Compare 3 output Polarity                                         */
            uint32_t            : 18;
    } CHCTL2_b;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< counter value                                                             */
            uint32_t            : 16;
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 16;           /*!< Counter auto reload value                                                 */
            uint32_t            : 16;
    } CAR_b;
  } ;

  union {
    __IOM uint32_t CREP;                        /*!< repetition counter register                                               */

    struct {
      __IOM uint32_t CREP       : 8;            /*!< Repetition counter value                                                  */
            uint32_t            : 24;
    } CREP_b;
  } ;

  union {
    __IOM uint32_t CH0CV;                       /*!< capture/compare register 0                                                */

    struct {
      __IOM uint32_t CH0VAL     : 16;           /*!< Capture/Compare 0 value                                                   */
            uint32_t            : 16;
    } CH0CV_b;
  } ;

  union {
    __IOM uint32_t CH1CV;                       /*!< capture/compare register 1                                                */

    struct {
      __IOM uint32_t CH1VAL     : 16;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 16;
    } CH1CV_b;
  } ;

  union {
    __IOM uint32_t CH2CV;                       /*!< capture/compare register 2                                                */

    struct {
      __IOM uint32_t CH2VAL     : 16;           /*!< Capture/Compare 2 value                                                   */
            uint32_t            : 16;
    } CH2CV_b;
  } ;

  union {
    __IOM uint32_t CH3CV;                       /*!< capture/compare register 3                                                */

    struct {
      __IOM uint32_t CH3VAL     : 16;           /*!< Capture/Compare 3 value                                                   */
            uint32_t            : 16;
    } CH3CV_b;
  } ;

  union {
    __IOM uint32_t CCHP;                        /*!< channel complementary protection register                                 */

    struct {
      __IOM uint32_t DTCFG      : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t PROT       : 2;            /*!< Lock configuration                                                        */
      __IOM uint32_t IOS        : 1;            /*!< Off-state selection for Idle mode                                         */
      __IOM uint32_t ROS        : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BRKEN      : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BRKP       : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t OAEN       : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t POEN       : 1;            /*!< Main output enable                                                        */
            uint32_t            : 16;
    } CCHP_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA configuration register                                                */

