RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t DMATA      : 5;            /*!< DMA transfer access start address                                         */
            uint32_t            : 3;
      __IOM uint32_t DMATC      : 5;            /*!< DMA transfer count                                                        */
            uint32_t            : 19;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATB;                       /*!< DMA address for full transfer                                             */

    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED[43];

  union {
    __IOM uint32_t CFG;                         /*!< Configuration register                                                    */

    struct {
      __IOM uint32_t OUTSEL     : 1;            /*!< The output value selection                                                */
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER_Type;                                  /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIMER2)
  */

typedef struct {                                /*!< TIMER2 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UPDIS      : 1;            /*!< Update disable                                                            */
      __IOM uint32_t UPS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t SPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint32_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint32_t CAM        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint32_t ARSE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKDIV      : 2;            /*!< Clock division                                                            */
            uint32_t            : 22;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< control register 1                                                        */

    struct {
            uint32_t            : 3;
      __IOM uint32_t DMAS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMC        : 3;            /*!< Master mode selection                                                     */
      __IOM uint32_t TI0S       : 1;            /*!< TI0 selection                                                             */
            uint32_t            : 24;
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t SMCFG;                       /*!< slave mode control register                                               */

    struct {
      __IOM uint32_t SMC        : 3;            /*!< Slave mode selection                                                      */
      __IOM uint32_t OCRC       : 1;            /*!< OCREF clear source selection                                              */
      __IOM uint32_t TRGS       : 3;            /*!< Trigger selection                                                         */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
      __IOM uint32_t ETFC       : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPSC      : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t SMC1       : 1;            /*!< External clock enable                                                     */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
            uint32_t            : 16;
    } SMCFG_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< DMA/Interrupt enable register                                             */

    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
      __IOM uint32_t CH1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CH2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
      __IOM uint32_t CH3IE      : 1;            /*!< Capture/Compare 3 interrupt enable                                        */
            uint32_t            : 1;
      __IOM uint32_t TRGIE      : 1;            /*!< Trigger interrupt enable                                                  */
            uint32_t            : 1;
      __IOM uint32_t UPDEN      : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CH0DEN     : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CH1DEN     : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CH2DEN     : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
      __IOM uint32_t CH3DEN     : 1;            /*!< Capture/Compare 3 DMA request enable                                      */
            uint32_t            : 1;
      __IOM uint32_t TRGDEN     : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 17;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

