RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
      __IOM uint32_t CH1IF      : 1;            /*!< Capture/Compare 1 interrupt flag                                          */
      __IOM uint32_t CH2IF      : 1;            /*!< Capture/Compare 2 interrupt flag                                          */
      __IOM uint32_t CH3IF      : 1;            /*!< Capture/Compare 3 interrupt flag                                          */
            uint32_t            : 1;
      __IOM uint32_t TRGIF      : 1;            /*!< Trigger interrupt flag                                                    */
            uint32_t            : 2;
      __IOM uint32_t CH0OF      : 1;            /*!< Capture/Compare 0 overcapture flag                                        */
      __IOM uint32_t CH1OF      : 1;            /*!< Capture/compare 1 overcapture flag                                        */
      __IOM uint32_t CH2OF      : 1;            /*!< Capture/Compare 2 overcapture flag                                        */
      __IOM uint32_t CH3OF      : 1;            /*!< Capture/Compare 3 overcapture flag                                        */
            uint32_t            : 19;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update generation                                                         */
      __OM  uint32_t CH0G       : 1;            /*!< Capture/compare 0 generation                                              */
      __OM  uint32_t CH1G       : 1;            /*!< Capture/compare 1 generation                                              */
      __OM  uint32_t CH2G       : 1;            /*!< Capture/compare 2 generation                                              */
      __OM  uint32_t CH3G       : 1;            /*!< Capture/compare 3 generation                                              */
            uint32_t            : 1;
      __OM  uint32_t TRGG       : 1;            /*!< Trigger generation                                                        */
            uint32_t            : 25;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register 0 (output mode)                             */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Output compare 0 fast enable                                              */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Output compare 0 preload enable                                           */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Output compare 0 mode                                                     */
        __IOM uint32_t CH0COMCEN : 1;           /*!< Output compare 0 clear enable                                             */
        __IOM uint32_t CH1MS    : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t CH1COMFEN : 1;           /*!< Output compare 1 fast enable                                              */
        __IOM uint32_t CH1COMSEN : 1;           /*!< Output compare 1 preload enable                                           */
        __IOM uint32_t CH1COMCTL : 3;           /*!< Output compare 1 mode                                                     */
        __IOM uint32_t CH1COMCEN : 1;           /*!< Output compare 1 clear enable                                             */
              uint32_t          : 16;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register 0 (input mode)                              */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0CAPPSC : 2;           /*!< Input capture 0 prescaler                                                 */
        __IOM uint32_t CH0CAPFLT : 4;           /*!< Input capture 0 filter                                                    */
        __IOM uint32_t CH1MS    : 2;            /*!< Capture/compare 1 selection                                               */
        __IOM uint32_t CH1CAPPSC : 2;           /*!< Input capture 1 prescaler                                                 */
        __IOM uint32_t CH1CAPFLT : 4;           /*!< Input capture 1 filter                                                    */
              uint32_t          : 16;
      } CHCTL0_Input_b;
    } ;
  };

  union {
    union {
      __IOM uint32_t CHCTL1_Output;             /*!< capture/compare mode register 1 (output mode)                             */

      struct {
        __IOM uint32_t CH2MS    : 2;            /*!< Capture/Compare 2 selection                                               */
        __IOM uint32_t CH2COMFEN : 1;           /*!< Output compare 2 fast enable                                              */
        __IOM uint32_t CH2COMSEN : 1;           /*!< Output compare 2 preload enable                                           */
        __IOM uint32_t CH2COMCTL : 3;           /*!< Output compare 2 mode                                                     */
        __IOM uint32_t CH2COMCEN : 1;           /*!< Output compare 2 clear enable                                             */
        __IOM uint32_t CH3MS    : 2;            /*!< Capture/Compare 3 selection                                               */
        __IOM uint32_t CH3COMFEN : 1;           /*!< Output compare 3 fast enable                                              */
        __IOM uint32_t CH3COMSEN : 1;           /*!< Output compare 3 preload enable                                           */
        __IOM uint32_t CH3COMCTL : 3;           /*!< Output compare 3 mode                                                     */
        __IOM uint32_t CH3COMCEN : 1;           /*!< Output compare 3 clear enable                                             */
              uint32_t          : 16;
      } CHCTL1_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL1_Input;              /*!< capture/compare mode register 1 (input mode)                              */

