RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t UPIE       : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CH0IE      : 1;            /*!< Capture/Compare 0 interrupt enable                                        */
            uint32_t            : 30;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< interrupt flag register                                                   */

    struct {
      __IOM uint32_t UPIF       : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CH0IF      : 1;            /*!< Capture/compare 0 interrupt flag                                          */
            uint32_t            : 7;
      __IOM uint32_t CH0OF      : 1;            /*!< Capture/Compare 0 overcapture flag                                        */
            uint32_t            : 22;
    } INTF_b;
  } ;

  union {
    __OM  uint32_t SWEVG;                       /*!< event generation register                                                 */

    struct {
      __OM  uint32_t UPG        : 1;            /*!< Update generation                                                         */
      __OM  uint32_t CH0G       : 1;            /*!< Capture/compare 0 generation                                              */
            uint32_t            : 30;
    } SWEVG_b;
  } ;

  union {
    union {
      __IOM uint32_t CHCTL0_Output;             /*!< capture/compare mode register (output mode)                               */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0COMFEN : 1;           /*!< Output compare 0 fast enable                                              */
        __IOM uint32_t CH0COMSEN : 1;           /*!< Output Compare 0 preload enable                                           */
        __IOM uint32_t CH0COMCTL : 3;           /*!< Output Compare 0 mode                                                     */
              uint32_t          : 25;
      } CHCTL0_Output_b;
    } ;

    union {
      __IOM uint32_t CHCTL0_Input;              /*!< capture/compare mode register (input mode)                                */

      struct {
        __IOM uint32_t CH0MS    : 2;            /*!< Capture/Compare 0 selection                                               */
        __IOM uint32_t CH0CAPPSC : 2;           /*!< Input capture 0 prescaler                                                 */
        __IOM uint32_t CH0CAPFLT : 4;           /*!< Input capture 0 filter                                                    */
              uint32_t          : 24;
      } CHCTL0_Input_b;
    } ;
  };
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t CHCTL2;                      /*!< capture/compare enable register                                           */

    struct {
      __IOM uint32_t CH0EN      : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CH0P       : 1;            /*!< Capture/Compare 0 output Polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CH0NP      : 1;            /*!< Capture/Compare 0 output Polarity                                         */
            uint32_t            : 28;
    } CHCTL2_b;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< counter value                                                             */
            uint32_t            : 16;
    } CNT_b;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;

  union {
    __IOM uint32_t CAR;                         /*!< auto-reload register                                                      */

    struct {
      __IOM uint32_t CARL       : 16;           /*!< Auto-reload value                                                         */
            uint32_t            : 16;
    } CAR_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t CH0CV;                       /*!< capture/compare register 0                                                */

    struct {
      __IOM uint32_t CH0VAL     : 16;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 16;
    } CH0CV_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t IRMP;                        /*!< channel input remap register                                              */

    struct {
      __IOM uint32_t CI0_RMP    : 2;            /*!< Timer input 0 remap                                                       */
            uint32_t            : 30;
    } IRMP_b;
  } ;
  __IM  uint32_t  RESERVED4[42];

  union {
    __IOM uint32_t CFG;                         /*!< configuration register                                                    */

    struct {
            uint32_t            : 1;
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER13_Type;                                 /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          TIMER14                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIMER14)
  */

typedef struct {                                /*!< TIMER14 Structure                                                         */

  union {
    __IOM uint32_t CTL0;                        /*!< control register 0                                                        */

