RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __IOM uint32_t DMATB      : 16;           /*!< DMA register for burst accesses                                           */
            uint32_t            : 16;
    } DMATB_b;
  } ;
  __IM  uint32_t  RESERVED3[43];

  union {
    __IOM uint32_t CFG;                         /*!< configuration register                                                    */

    struct {
      __IOM uint32_t OUTSEL     : 1;            /*!< The output value selection                                                */
      __IOM uint32_t CHVSEL     : 1;            /*!< Write CHxVAL register selection                                           */
            uint32_t            : 30;
    } CFG_b;
  } ;
} TIMER15_Type;                                 /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          USART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver
      transmitter (USART0)
  */

typedef struct {                                /*!< USART0 Structure                                                          */

  union {
    __IOM uint32_t CTL0;                        /*!< Control register 0                                                        */

    struct {
      __IOM uint32_t UEN        : 1;            /*!< USART enable                                                              */
      __IOM uint32_t UESM       : 1;            /*!< USART enable in Stop mode                                                 */
      __IOM uint32_t REN        : 1;            /*!< Receiver enable                                                           */
      __IOM uint32_t TEN        : 1;            /*!< Transmitter enable                                                        */
      __IOM uint32_t IDLEIE     : 1;            /*!< IDLE interrupt enable                                                     */
      __IOM uint32_t RBNEIE     : 1;            /*!< RXNE interrupt enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< Transmission complete interrupt enable                                    */
      __IOM uint32_t TBEIE      : 1;            /*!< interrupt enable                                                          */
      __IOM uint32_t PERRIE     : 1;            /*!< PE interrupt enable                                                       */
      __IOM uint32_t PM         : 1;            /*!< Parity selection                                                          */
      __IOM uint32_t PCEN       : 1;            /*!< Parity control enable                                                     */
      __IOM uint32_t WM         : 1;            /*!< Receiver wakeup method                                                    */
      __IOM uint32_t WL         : 1;            /*!< Word length                                                               */
      __IOM uint32_t MEN        : 1;            /*!< Mute mode enable                                                          */
      __IOM uint32_t AMIE       : 1;            /*!< Character match interrupt enable                                          */
      __IOM uint32_t OVSMOD     : 1;            /*!< Oversampling mode                                                         */
      __IOM uint32_t DED        : 5;            /*!< Driver Enable deassertion time                                            */
      __IOM uint32_t DEA        : 5;            /*!< Driver Enable assertion time                                              */
      __IOM uint32_t RTIE       : 1;            /*!< Receiver timeout interrupt enable                                         */
      __IOM uint32_t EBIE       : 1;            /*!< End of Block interrupt enable                                             */
            uint32_t            : 4;
    } CTL0_b;
  } ;

  union {
    __IOM uint32_t CTL1;                        /*!< Control register 1                                                        */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDM       : 1;            /*!< 7-bit Address Detection/4-bit Address Detection                           */
      __IOM uint32_t LBLEN      : 1;            /*!< LIN break detection length                                                */
      __IOM uint32_t LBDIE      : 1;            /*!< LIN break detection interrupt enable                                      */
            uint32_t            : 1;
      __IOM uint32_t CLEN       : 1;            /*!< Last bit clock pulse                                                      */
      __IOM uint32_t CPH        : 1;            /*!< Clock phase                                                               */
      __IOM uint32_t CPL        : 1;            /*!< Clock polarity                                                            */
      __IOM uint32_t CKEN       : 1;            /*!< Clock enable                                                              */
      __IOM uint32_t STB        : 2;            /*!< STOP bits                                                                 */
      __IOM uint32_t LMEN       : 1;            /*!< LIN mode enable                                                           */
      __IOM uint32_t STRP       : 1;            /*!< Swap TX/RX pins                                                           */
      __IOM uint32_t RINV       : 1;            /*!< RX pin active level inversion                                             */
      __IOM uint32_t TINV       : 1;            /*!< TX pin active level inversion                                             */
      __IOM uint32_t DINV       : 1;            /*!< Binary data inversion                                                     */
      __IOM uint32_t MSBF       : 1;            /*!< Most significant bit first                                                */
      __IOM uint32_t ABDEN      : 1;            /*!< Auto baud rate enable                                                     */
      __IOM uint32_t ABDM       : 2;            /*!< Auto baud rate mode                                                       */
      __IOM uint32_t RTEN       : 1;            /*!< Receiver timeout enable                                                   */
      __IOM uint32_t ADDR       : 8;            /*!< Address of the USART node                                                 */
    } CTL1_b;
  } ;

  union {
    __IOM uint32_t CTL2;                        /*!< Control register 2                                                        */

