RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
    struct {
      __OM  uint32_t PEC        : 1;            /*!< Parity error clear flag                                                   */
      __OM  uint32_t FEC        : 1;            /*!< Framing error clear flag                                                  */
      __OM  uint32_t NEC        : 1;            /*!< Noise detected clear flag                                                 */
      __OM  uint32_t OREC       : 1;            /*!< Overrun error clear flag                                                  */
      __OM  uint32_t IDLEC      : 1;            /*!< Idle line detected clear flag                                             */
            uint32_t            : 1;
      __OM  uint32_t TCC        : 1;            /*!< Transmission complete clear flag                                          */
            uint32_t            : 1;
      __OM  uint32_t LBDC       : 1;            /*!< LIN break detection clear flag                                            */
      __OM  uint32_t CTSC       : 1;            /*!< CTS clear flag                                                            */
            uint32_t            : 1;
      __OM  uint32_t RTC        : 1;            /*!< Receiver timeout clear flag                                               */
      __OM  uint32_t EBC        : 1;            /*!< End of timeout clear flag                                                 */
            uint32_t            : 4;
      __OM  uint32_t AMC        : 1;            /*!< Character match clear flag                                                */
            uint32_t            : 2;
      __OM  uint32_t WUC        : 1;            /*!< Wakeup from Stop mode clear flag                                          */
            uint32_t            : 11;
    } INTC_b;
  } ;

  union {
    __IM  uint32_t RDATA;                       /*!< Receive data register                                                     */

    struct {
      __IM  uint32_t RDATA      : 9;            /*!< Receive data value                                                        */
            uint32_t            : 23;
    } RDATA_b;
  } ;

  union {
    __IOM uint32_t TDATA;                       /*!< Transmit data register                                                    */

    struct {
      __IOM uint32_t TDATA      : 9;            /*!< Transmit data value                                                       */
            uint32_t            : 23;
    } TDATA_b;
  } ;
  __IM  uint32_t  RESERVED[37];

  union {
    __IOM uint32_t CHC;                         /*!< coherence control register                                                */

    struct {
      __IOM uint32_t HCM        : 1;            /*!< Hardware flow control coherence mode                                      */
            uint32_t            : 7;
      __IOM uint32_t EPERR      : 1;            /*!< Early parity error flag                                                   */
            uint32_t            : 23;
    } CHC_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t RFCS;                        /*!< USART receive FIFO control and status register                            */

    struct {
      __IOM uint32_t ELNACK     : 1;            /*!< Early NKEN when smartcard mode is selected                                */
            uint32_t            : 7;
      __IOM uint32_t RFEN       : 1;            /*!< Receive FIFO enable                                                       */
      __IOM uint32_t RFFIE      : 1;            /*!< Receive FIFO full interrupt enable                                        */
      __IM  uint32_t RFE        : 1;            /*!< Receive FIFO empty flag                                                   */
      __IM  uint32_t RFF        : 1;            /*!< Receive FIFO full flag                                                    */
      __IM  uint32_t RFCNT      : 3;            /*!< Receive FIFO count number                                                 */
      __IOM uint32_t RFFINT     : 1;            /*!< Receive FIFO full interrupt flag                                          */
            uint32_t            : 16;
    } RFCS_b;
  } ;
} USART_Type;                                  /*!< Size = 212 (0xd4)                                                         */



/* =========================================================================================================================== */
/* ================                                           WWDGT                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Window watchdog timer (WWDGT)
  */

typedef struct {                                /*!< WWDGT Structure                                                           */

  union {
    __IOM uint32_t CTL;                         /*!< Control register                                                          */

    struct {
      __IOM uint32_t CNT        : 7;            /*!< 7-bit counter                                                             */
      __IOM uint32_t WDGTEN     : 1;            /*!< Activation bit                                                            */
            uint32_t            : 24;
    } CTL_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< Configuration register                                                    */

    struct {
      __IOM uint32_t WIN        : 7;            /*!< 7-bit window value                                                        */
      __IOM uint32_t PSC        : 2;            /*!< Prescaler                                                                 */
      __IOM uint32_t EWIE       : 1;            /*!< Early wakeup interrupt                                                    */
            uint32_t            : 22;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Status register                                                           */

