RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  STAT  ========================================================== */
#define ADC_STAT_STRC_Pos                 (4UL)                     /*!< STRC (Bit 4)                                          */
#define ADC_STAT_STRC_Msk                 (0x10UL)                  /*!< STRC (Bitfield-Mask: 0x01)                            */
#define ADC_STAT_STIC_Pos                 (3UL)                     /*!< STIC (Bit 3)                                          */
#define ADC_STAT_STIC_Msk                 (0x8UL)                   /*!< STIC (Bitfield-Mask: 0x01)                            */
#define ADC_STAT_EOIC_Pos                 (2UL)                     /*!< EOIC (Bit 2)                                          */
#define ADC_STAT_EOIC_Msk                 (0x4UL)                   /*!< EOIC (Bitfield-Mask: 0x01)                            */
#define ADC_STAT_EOC_Pos                  (1UL)                     /*!< EOC (Bit 1)                                           */
#define ADC_STAT_EOC_Msk                  (0x2UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
#define ADC_STAT_WDE_Pos                  (0UL)                     /*!< WDE (Bit 0)                                           */
#define ADC_STAT_WDE_Msk                  (0x1UL)                   /*!< WDE (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL0  ========================================================== */
#define ADC_CTL0_DRES_Pos                 (24UL)                    /*!< DRES (Bit 24)                                         */
#define ADC_CTL0_DRES_Msk                 (0x3000000UL)             /*!< DRES (Bitfield-Mask: 0x03)                            */
#define ADC_CTL0_RWDEN_Pos                (23UL)                    /*!< RWDEN (Bit 23)                                        */
#define ADC_CTL0_RWDEN_Msk                (0x800000UL)              /*!< RWDEN (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_IWDEN_Pos                (22UL)                    /*!< IWDEN (Bit 22)                                        */
#define ADC_CTL0_IWDEN_Msk                (0x400000UL)              /*!< IWDEN (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_DISNUM_Pos               (13UL)                    /*!< DISNUM (Bit 13)                                       */
#define ADC_CTL0_DISNUM_Msk               (0xe000UL)                /*!< DISNUM (Bitfield-Mask: 0x07)                          */
#define ADC_CTL0_DISIC_Pos                (12UL)                    /*!< DISIC (Bit 12)                                        */
#define ADC_CTL0_DISIC_Msk                (0x1000UL)                /*!< DISIC (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_DISRC_Pos                (11UL)                    /*!< DISRC (Bit 11)                                        */
#define ADC_CTL0_DISRC_Msk                (0x800UL)                 /*!< DISRC (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_ICA_Pos                  (10UL)                    /*!< ICA (Bit 10)                                          */
#define ADC_CTL0_ICA_Msk                  (0x400UL)                 /*!< ICA (Bitfield-Mask: 0x01)                             */
#define ADC_CTL0_WDSC_Pos                 (9UL)                     /*!< WDSC (Bit 9)                                          */
#define ADC_CTL0_WDSC_Msk                 (0x200UL)                 /*!< WDSC (Bitfield-Mask: 0x01)                            */
#define ADC_CTL0_SM_Pos                   (8UL)                     /*!< SM (Bit 8)                                            */
#define ADC_CTL0_SM_Msk                   (0x100UL)                 /*!< SM (Bitfield-Mask: 0x01)                              */
#define ADC_CTL0_EOICIE_Pos               (7UL)                     /*!< EOICIE (Bit 7)                                        */
#define ADC_CTL0_EOICIE_Msk               (0x80UL)                  /*!< EOICIE (Bitfield-Mask: 0x01)                          */
#define ADC_CTL0_WDEIE_Pos                (6UL)                     /*!< WDEIE (Bit 6)                                         */
#define ADC_CTL0_WDEIE_Msk                (0x40UL)                  /*!< WDEIE (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_EOCIE_Pos                (5UL)                     /*!< EOCIE (Bit 5)                                         */
#define ADC_CTL0_EOCIE_Msk                (0x20UL)                  /*!< EOCIE (Bitfield-Mask: 0x01)                           */
#define ADC_CTL0_WDCHSEL_Pos              (0UL)                     /*!< WDCHSEL (Bit 0)                                       */
#define ADC_CTL0_WDCHSEL_Msk              (0x1fUL)                  /*!< WDCHSEL (Bitfield-Mask: 0x1f)                         */
/* =========================================================  CTL1  ========================================================== */
#define ADC_CTL1_TSVREN_Pos               (23UL)                    /*!< TSVREN (Bit 23)                                       */
#define ADC_CTL1_TSVREN_Msk               (0x800000UL)              /*!< TSVREN (Bitfield-Mask: 0x01)                          */
#define ADC_CTL1_SWRCST_Pos               (22UL)                    /*!< SWRCST (Bit 22)                                       */
#define ADC_CTL1_SWRCST_Msk               (0x400000UL)              /*!< SWRCST (Bitfield-Mask: 0x01)                          */
#define ADC_CTL1_SWICST_Pos               (21UL)                    /*!< SWICST (Bit 21)                                       */
#define ADC_CTL1_SWICST_Msk               (0x200000UL)              /*!< SWICST (Bitfield-Mask: 0x01)                          */
#define ADC_CTL1_ETERC_Pos                (20UL)                    /*!< ETERC (Bit 20)                                        */
#define ADC_CTL1_ETERC_Msk                (0x100000UL)              /*!< ETERC (Bitfield-Mask: 0x01)                           */
#define ADC_CTL1_ETSRC_Pos                (17UL)                    /*!< ETSRC (Bit 17)                                        */
#define ADC_CTL1_ETSRC_Msk                (0xe0000UL)               /*!< ETSRC (Bitfield-Mask: 0x07)                           */
#define ADC_CTL1_ETEIC_Pos                (15UL)                    /*!< ETEIC (Bit 15)                                        */
#define ADC_CTL1_ETEIC_Msk                (0x8000UL)                /*!< ETEIC (Bitfield-Mask: 0x01)                           */
#define ADC_CTL1_ETSIC_Pos                (12UL)                    /*!< ETSIC (Bit 12)                                        */
#define ADC_CTL1_ETSIC_Msk                (0x7000UL)                /*!< ETSIC (Bitfield-Mask: 0x07)                           */
#define ADC_CTL1_DAL_Pos                  (11UL)                    /*!< DAL (Bit 11)                                          */
#define ADC_CTL1_DAL_Msk                  (0x800UL)                 /*!< DAL (Bitfield-Mask: 0x01)                             */
#define ADC_CTL1_DMA_Pos                  (8UL)                     /*!< DMA (Bit 8)                                           */
#define ADC_CTL1_DMA_Msk                  (0x100UL)                 /*!< DMA (Bitfield-Mask: 0x01)                             */
#define ADC_CTL1_RSTCLB_Pos               (3UL)                     /*!< RSTCLB (Bit 3)                                        */
#define ADC_CTL1_RSTCLB_Msk               (0x8UL)                   /*!< RSTCLB (Bitfield-Mask: 0x01)                          */
#define ADC_CTL1_CLB_Pos                  (2UL)                     /*!< CLB (Bit 2)                                           */
#define ADC_CTL1_CLB_Msk                  (0x4UL)                   /*!< CLB (Bitfield-Mask: 0x01)                             */
#define ADC_CTL1_CTN_Pos                  (1UL)                     /*!< CTN (Bit 1)                                           */
#define ADC_CTL1_CTN_Msk                  (0x2UL)                   /*!< CTN (Bitfield-Mask: 0x01)                             */
#define ADC_CTL1_ADCON_Pos                (0UL)                     /*!< ADCON (Bit 0)                                         */
#define ADC_CTL1_ADCON_Msk                (0x1UL)                   /*!< ADCON (Bitfield-Mask: 0x01)                           */
/* ========================================================  SAMPT0  ========================================================= */
#define ADC_SAMPT0_SPT16_Pos              (18UL)                    /*!< SPT16 (Bit 18)                                        */
#define ADC_SAMPT0_SPT16_Msk              (0x1c0000UL)              /*!< SPT16 (Bitfield-Mask: 0x07)                           */
#define ADC_SAMPT0_SPT17_Pos              (21UL)                    /*!< SPT17 (Bit 21)                                        */
#define ADC_SAMPT0_SPT17_Msk              (0xe00000UL)              /*!< SPT17 (Bitfield-Mask: 0x07)                           */
/* ========================================================  SAMPT1  ========================================================= */
#define ADC_SAMPT1_SPT0_Pos               (0UL)                     /*!< SPT0 (Bit 0)                                          */
#define ADC_SAMPT1_SPT0_Msk               (0x7UL)                   /*!< SPT0 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT1_Pos               (3UL)                     /*!< SPT1 (Bit 3)                                          */
#define ADC_SAMPT1_SPT1_Msk               (0x38UL)                  /*!< SPT1 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT2_Pos               (6UL)                     /*!< SPT2 (Bit 6)                                          */
#define ADC_SAMPT1_SPT2_Msk               (0x1c0UL)                 /*!< SPT2 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT3_Pos               (9UL)                     /*!< SPT3 (Bit 9)                                          */
#define ADC_SAMPT1_SPT3_Msk               (0xe00UL)                 /*!< SPT3 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT4_Pos               (12UL)                    /*!< SPT4 (Bit 12)                                         */
#define ADC_SAMPT1_SPT4_Msk               (0x7000UL)                /*!< SPT4 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT5_Pos               (15UL)                    /*!< SPT5 (Bit 15)                                         */
#define ADC_SAMPT1_SPT5_Msk               (0x38000UL)               /*!< SPT5 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT6_Pos               (18UL)                    /*!< SPT6 (Bit 18)                                         */
#define ADC_SAMPT1_SPT6_Msk               (0x1c0000UL)              /*!< SPT6 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT7_Pos               (21UL)                    /*!< SPT7 (Bit 21)                                         */
#define ADC_SAMPT1_SPT7_Msk               (0xe00000UL)              /*!< SPT7 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT8_Pos               (24UL)                    /*!< SPT8 (Bit 24)                                         */
#define ADC_SAMPT1_SPT8_Msk               (0x7000000UL)             /*!< SPT8 (Bitfield-Mask: 0x07)                            */
#define ADC_SAMPT1_SPT9_Pos               (27UL)                    /*!< SPT9 (Bit 27)                                         */
#define ADC_SAMPT1_SPT9_Msk               (0x38000000UL)            /*!< SPT9 (Bitfield-Mask: 0x07)                            */
/* =========================================================  IOFF0  ========================================================= */
#define ADC_IOFF0_IOFF_Pos                (0UL)                     /*!< IOFF (Bit 0)                                          */
#define ADC_IOFF0_IOFF_Msk                (0xfffUL)                 /*!< IOFF (Bitfield-Mask: 0xfff)                           */
/* =========================================================  IOFF1  ========================================================= */
#define ADC_IOFF1_IOFF_Pos                (0UL)                     /*!< IOFF (Bit 0)                                          */
#define ADC_IOFF1_IOFF_Msk                (0xfffUL)                 /*!< IOFF (Bitfield-Mask: 0xfff)                           */
/* =========================================================  IOFF2  ========================================================= */
#define ADC_IOFF2_IOFF_Pos                (0UL)                     /*!< IOFF (Bit 0)                                          */
#define ADC_IOFF2_IOFF_Msk                (0xfffUL)                 /*!< IOFF (Bitfield-Mask: 0xfff)                           */
/* =========================================================  IOFF3  ========================================================= */
#define ADC_IOFF3_IOFF_Pos                (0UL)                     /*!< IOFF (Bit 0)                                          */
#define ADC_IOFF3_IOFF_Msk                (0xfffUL)                 /*!< IOFF (Bitfield-Mask: 0xfff)                           */
/* =========================================================  WDHT  ========================================================== */
#define ADC_WDHT_WDHT_Pos                 (0UL)                     /*!< WDHT (Bit 0)                                          */
#define ADC_WDHT_WDHT_Msk                 (0xfffUL)                 /*!< WDHT (Bitfield-Mask: 0xfff)                           */
/* =========================================================  WDLT  ========================================================== */
#define ADC_WDLT_WDLT_Pos                 (0UL)                     /*!< WDLT (Bit 0)                                          */
#define ADC_WDLT_WDLT_Msk                 (0xfffUL)                 /*!< WDLT (Bitfield-Mask: 0xfff)                           */
/* =========================================================  RSQ0  ========================================================== */
#define ADC_RSQ0_RL_Pos                   (20UL)                    /*!< RL (Bit 20)                                           */
#define ADC_RSQ0_RL_Msk                   (0xf00000UL)              /*!< RL (Bitfield-Mask: 0x0f)                              */
#define ADC_RSQ0_RSQ15_Pos                (15UL)                    /*!< RSQ15 (Bit 15)                                        */
#define ADC_RSQ0_RSQ15_Msk                (0xf8000UL)               /*!< RSQ15 (Bitfield-Mask: 0x1f)                           */
#define ADC_RSQ0_RSQ14_Pos                (10UL)                    /*!< RSQ14 (Bit 10)                                        */
#define ADC_RSQ0_RSQ14_Msk                (0x7c00UL)                /*!< RSQ14 (Bitfield-Mask: 0x1f)                           */
#define ADC_RSQ0_RSQ13_Pos                (5UL)                     /*!< RSQ13 (Bit 5)                                         */
#define ADC_RSQ0_RSQ13_Msk                (0x3e0UL)                 /*!< RSQ13 (Bitfield-Mask: 0x1f)                           */
#define ADC_RSQ0_RSQ12_Pos                (0UL)                     /*!< RSQ12 (Bit 0)                                         */
#define ADC_RSQ0_RSQ12_Msk                (0x1fUL)                  /*!< RSQ12 (Bitfield-Mask: 0x1f)                           */
/* =========================================================  RSQ1  ========================================================== */
#define ADC_RSQ1_RSQ11_Pos                (25UL)                    /*!< RSQ11 (Bit 25)                                        */
#define ADC_RSQ1_RSQ11_Msk                (0x3e000000UL)            /*!< RSQ11 (Bitfield-Mask: 0x1f)                           */
#define ADC_RSQ1_RSQ10_Pos                (20UL)                    /*!< RSQ10 (Bit 20)                                        */
#define ADC_RSQ1_RSQ10_Msk                (0x1f00000UL)             /*!< RSQ10 (Bitfield-Mask: 0x1f)                           */
#define ADC_RSQ1_RSQ9_Pos                 (15UL)                    /*!< RSQ9 (Bit 15)                                         */
#define ADC_RSQ1_RSQ9_Msk                 (0xf8000UL)               /*!< RSQ9 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ1_RSQ8_Pos                 (10UL)                    /*!< RSQ8 (Bit 10)                                         */
#define ADC_RSQ1_RSQ8_Msk                 (0x7c00UL)                /*!< RSQ8 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ1_RSQ7_Pos                 (5UL)                     /*!< RSQ7 (Bit 5)                                          */
#define ADC_RSQ1_RSQ7_Msk                 (0x3e0UL)                 /*!< RSQ7 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ1_RSQ6_Pos                 (0UL)                     /*!< RSQ6 (Bit 0)                                          */
#define ADC_RSQ1_RSQ6_Msk                 (0x1fUL)                  /*!< RSQ6 (Bitfield-Mask: 0x1f)                            */
/* =========================================================  RSQ2  ========================================================== */
#define ADC_RSQ2_RSQ5_Pos                 (25UL)                    /*!< RSQ5 (Bit 25)                                         */
#define ADC_RSQ2_RSQ5_Msk                 (0x3e000000UL)            /*!< RSQ5 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ2_RSQ4_Pos                 (20UL)                    /*!< RSQ4 (Bit 20)                                         */
#define ADC_RSQ2_RSQ4_Msk                 (0x1f00000UL)             /*!< RSQ4 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ2_RSQ3_Pos                 (15UL)                    /*!< RSQ3 (Bit 15)                                         */
#define ADC_RSQ2_RSQ3_Msk                 (0xf8000UL)               /*!< RSQ3 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ2_RSQ2_Pos                 (10UL)                    /*!< RSQ2 (Bit 10)                                         */
#define ADC_RSQ2_RSQ2_Msk                 (0x7c00UL)                /*!< RSQ2 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ2_RSQ1_Pos                 (5UL)                     /*!< RSQ1 (Bit 5)                                          */
#define ADC_RSQ2_RSQ1_Msk                 (0x3e0UL)                 /*!< RSQ1 (Bitfield-Mask: 0x1f)                            */
#define ADC_RSQ2_RSQ0_Pos                 (0UL)                     /*!< RSQ0 (Bit 0)                                          */
#define ADC_RSQ2_RSQ0_Msk                 (0x1fUL)                  /*!< RSQ0 (Bitfield-Mask: 0x1f)                            */
/* ==========================================================  ISQ  ========================================================== */
#define ADC_ISQ_IL_Pos                    (20UL)                    /*!< IL (Bit 20)                                           */
#define ADC_ISQ_IL_Msk                    (0x300000UL)              /*!< IL (Bitfield-Mask: 0x03)                              */
#define ADC_ISQ_ISQ3_Pos                  (15UL)                    /*!< ISQ3 (Bit 15)                                         */
#define ADC_ISQ_ISQ3_Msk                  (0xf8000UL)               /*!< ISQ3 (Bitfield-Mask: 0x1f)                            */
#define ADC_ISQ_ISQ2_Pos                  (10UL)                    /*!< ISQ2 (Bit 10)                                         */
#define ADC_ISQ_ISQ2_Msk                  (0x7c00UL)                /*!< ISQ2 (Bitfield-Mask: 0x1f)                            */
#define ADC_ISQ_ISQ1_Pos                  (5UL)                     /*!< ISQ1 (Bit 5)                                          */
#define ADC_ISQ_ISQ1_Msk                  (0x3e0UL)                 /*!< ISQ1 (Bitfield-Mask: 0x1f)                            */
#define ADC_ISQ_ISQ0_Pos                  (0UL)                     /*!< ISQ0 (Bit 0)                                          */
#define ADC_ISQ_ISQ0_Msk                  (0x1fUL)                  /*!< ISQ0 (Bitfield-Mask: 0x1f)                            */
/* ========================================================  IDATA0  ========================================================= */
#define ADC_IDATA0_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA0_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA1  ========================================================= */
#define ADC_IDATA1_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA1_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA2  ========================================================= */
#define ADC_IDATA2_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA2_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* ========================================================  IDATA3  ========================================================= */
#define ADC_IDATA3_IDATAn_Pos             (0UL)                     /*!< IDATAn (Bit 0)                                        */
#define ADC_IDATA3_IDATAn_Msk             (0xffffUL)                /*!< IDATAn (Bitfield-Mask: 0xffff)                        */
/* =========================================================  RDATA  ========================================================= */
#define ADC_RDATA_RDATA_Pos               (0UL)                     /*!< RDATA (Bit 0)                                         */
#define ADC_RDATA_RDATA_Msk               (0xffffUL)                /*!< RDATA (Bitfield-Mask: 0xffff)                         */
/* =======================================================  OVSAMPCTL  ======================================================= */
#define ADC_OVSAMPCTL_TOVS_Pos            (9UL)                     /*!< TOVS (Bit 9)                                          */
#define ADC_OVSAMPCTL_TOVS_Msk            (0x200UL)                 /*!< TOVS (Bitfield-Mask: 0x01)                            */
#define ADC_OVSAMPCTL_OVSS_Pos            (5UL)                     /*!< OVSS (Bit 5)                                          */
#define ADC_OVSAMPCTL_OVSS_Msk            (0x1e0UL)                 /*!< OVSS (Bitfield-Mask: 0x0f)                            */
#define ADC_OVSAMPCTL_OVSR_Pos            (2UL)                     /*!< OVSR (Bit 2)                                          */
#define ADC_OVSAMPCTL_OVSR_Msk            (0x1cUL)                  /*!< OVSR (Bitfield-Mask: 0x07)                            */
#define ADC_OVSAMPCTL_OVSEN_Pos           (0UL)                     /*!< OVSEN (Bit 0)                                         */
#define ADC_OVSAMPCTL_OVSEN_Msk           (0x1UL)                   /*!< OVSEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            CMP                                            ================ */
/* =========================================================================================================================== */

