RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* ==========================================================  CS  =========================================================== */
#define CMP_CS_CMPEN_Pos                  (0UL)                     /*!< CMPEN (Bit 0)                                         */
#define CMP_CS_CMPEN_Msk                  (0x1UL)                   /*!< CMPEN (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMPSW_Pos                  (1UL)                     /*!< CMPSW (Bit 1)                                         */
#define CMP_CS_CMPSW_Msk                  (0x2UL)                   /*!< CMPSW (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMPM_Pos                   (2UL)                     /*!< CMPM (Bit 2)                                          */
#define CMP_CS_CMPM_Msk                   (0xcUL)                   /*!< CMPM (Bitfield-Mask: 0x03)                            */
#define CMP_CS_CMPMSEL_Pos                (4UL)                     /*!< CMPMSEL (Bit 4)                                       */
#define CMP_CS_CMPMSEL_Msk                (0x70UL)                  /*!< CMPMSEL (Bitfield-Mask: 0x07)                         */
#define CMP_CS_CMPOSEL_Pos                (8UL)                     /*!< CMPOSEL (Bit 8)                                       */
#define CMP_CS_CMPOSEL_Msk                (0x700UL)                 /*!< CMPOSEL (Bitfield-Mask: 0x07)                         */
#define CMP_CS_CMPPL_Pos                  (11UL)                    /*!< CMPPL (Bit 11)                                        */
#define CMP_CS_CMPPL_Msk                  (0x800UL)                 /*!< CMPPL (Bitfield-Mask: 0x01)                           */
#define CMP_CS_CMPHST_Pos                 (12UL)                    /*!< CMPHST (Bit 12)                                       */
#define CMP_CS_CMPHST_Msk                 (0x3000UL)                /*!< CMPHST (Bitfield-Mask: 0x03)                          */
#define CMP_CS_CMPO_Pos                   (14UL)                    /*!< CMPO (Bit 14)                                         */
#define CMP_CS_CMPO_Msk                   (0x4000UL)                /*!< CMPO (Bitfield-Mask: 0x01)                            */
#define CMP_CS_CMPLK_Pos                  (15UL)                    /*!< CMPLK (Bit 15)                                        */
#define CMP_CS_CMPLK_Msk                  (0x8000UL)                /*!< CMPLK (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  DATA  ========================================================== */
#define CRC_DATA_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define CRC_DATA_DATA_Msk                 (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  FDATA  ========================================================= */
#define CRC_FDATA_FDATA_Pos               (0UL)                     /*!< FDATA (Bit 0)                                         */
#define CRC_FDATA_FDATA_Msk               (0xffUL)                  /*!< FDATA (Bitfield-Mask: 0xff)                           */
/* ==========================================================  CTL  ========================================================== */
#define CRC_CTL_RST_Pos                   (0UL)                     /*!< RST (Bit 0)                                           */
#define CRC_CTL_RST_Msk                   (0x1UL)                   /*!< RST (Bitfield-Mask: 0x01)                             */
#define CRC_CTL_PS_Pos                    (3UL)                     /*!< PS (Bit 3)                                            */
#define CRC_CTL_PS_Msk                    (0x18UL)                  /*!< PS (Bitfield-Mask: 0x03)                              */
#define CRC_CTL_REV_I_Pos                 (5UL)                     /*!< REV_I (Bit 5)                                         */
#define CRC_CTL_REV_I_Msk                 (0x60UL)                  /*!< REV_I (Bitfield-Mask: 0x03)                           */
#define CRC_CTL_REV_O_Pos                 (7UL)                     /*!< REV_O (Bit 7)                                         */
#define CRC_CTL_REV_O_Msk                 (0x80UL)                  /*!< REV_O (Bitfield-Mask: 0x01)                           */
/* =========================================================  IDATA  ========================================================= */
#define CRC_IDATA_IDATA_Pos               (0UL)                     /*!< IDATA (Bit 0)                                         */
#define CRC_IDATA_IDATA_Msk               (0xffffffffUL)            /*!< IDATA (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  POLY  ========================================================== */
#define CRC_POLY_POLY_Pos                 (0UL)                     /*!< POLY (Bit 0)                                          */
#define CRC_POLY_POLY_Msk                 (0xffffffffUL)            /*!< POLY (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                          DBGMCU                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  ID  =========================================================== */
#define DBGMCU_ID_ID_CODE_Pos             (0UL)                     /*!< ID_CODE (Bit 0)                                       */
#define DBGMCU_ID_ID_CODE_Msk             (0xffffffffUL)            /*!< ID_CODE (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  CTL0  ========================================================== */
#define DBGMCU_CTL0_SLP_HOLD_Pos          (0UL)                     /*!< SLP_HOLD (Bit 0)                                      */
#define DBGMCU_CTL0_SLP_HOLD_Msk          (0x1UL)                   /*!< SLP_HOLD (Bitfield-Mask: 0x01)                        */
#define DBGMCU_CTL0_DSLP_HOLD_Pos         (1UL)                     /*!< DSLP_HOLD (Bit 1)                                     */
#define DBGMCU_CTL0_DSLP_HOLD_Msk         (0x2UL)                   /*!< DSLP_HOLD (Bitfield-Mask: 0x01)                       */
#define DBGMCU_CTL0_STB_HOLD_Pos          (2UL)                     /*!< STB_HOLD (Bit 2)                                      */
#define DBGMCU_CTL0_STB_HOLD_Msk          (0x4UL)                   /*!< STB_HOLD (Bitfield-Mask: 0x01)                        */
#define DBGMCU_CTL0_FWDGT_HOLD_Pos        (8UL)                     /*!< FWDGT_HOLD (Bit 8)                                    */
#define DBGMCU_CTL0_FWDGT_HOLD_Msk        (0x100UL)                 /*!< FWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBGMCU_CTL0_WWDGT_HOLD_Pos        (9UL)                     /*!< WWDGT_HOLD (Bit 9)                                    */
#define DBGMCU_CTL0_WWDGT_HOLD_Msk        (0x200UL)                 /*!< WWDGT_HOLD (Bitfield-Mask: 0x01)                      */
#define DBGMCU_CTL0_TIMER0_HOLD_Pos       (10UL)                    /*!< TIMER0_HOLD (Bit 10)                                  */
#define DBGMCU_CTL0_TIMER0_HOLD_Msk       (0x400UL)                 /*!< TIMER0_HOLD (Bitfield-Mask: 0x01)                     */
#define DBGMCU_CTL0_TIMER2_HOLD_Pos       (12UL)                    /*!< TIMER2_HOLD (Bit 12)                                  */
#define DBGMCU_CTL0_TIMER2_HOLD_Msk       (0x1000UL)                /*!< TIMER2_HOLD (Bitfield-Mask: 0x01)                     */
#define DBGMCU_CTL0_I2C0_HOLD_Pos         (15UL)                    /*!< I2C0_HOLD (Bit 15)                                    */
#define DBGMCU_CTL0_I2C0_HOLD_Msk         (0x8000UL)                /*!< I2C0_HOLD (Bitfield-Mask: 0x01)                       */
#define DBGMCU_CTL0_I2C1_HOLD_Pos         (16UL)                    /*!< I2C1_HOLD (Bit 16)                                    */
#define DBGMCU_CTL0_I2C1_HOLD_Msk         (0x10000UL)               /*!< I2C1_HOLD (Bitfield-Mask: 0x01)                       */
#define DBGMCU_CTL0_TIMER5_HOLD_Pos       (19UL)                    /*!< TIMER5_HOLD (Bit 19)                                  */
#define DBGMCU_CTL0_TIMER5_HOLD_Msk       (0x80000UL)               /*!< TIMER5_HOLD (Bitfield-Mask: 0x01)                     */
#define DBGMCU_CTL0_TIMER13_HOLD_Pos      (27UL)                    /*!< TIMER13_HOLD (Bit 27)                                 */
#define DBGMCU_CTL0_TIMER13_HOLD_Msk      (0x8000000UL)             /*!< TIMER13_HOLD (Bitfield-Mask: 0x01)                    */
/* =========================================================  CTL1  ========================================================== */
#define DBGMCU_CTL1_RTC_HOLD_Pos          (10UL)                    /*!< RTC_HOLD (Bit 10)                                     */
#define DBGMCU_CTL1_RTC_HOLD_Msk          (0x400UL)                 /*!< RTC_HOLD (Bitfield-Mask: 0x01)                        */
#define DBGMCU_CTL1_TIMER14_HOLD_Pos      (16UL)                    /*!< TIMER14_HOLD (Bit 16)                                 */
#define DBGMCU_CTL1_TIMER14_HOLD_Msk      (0x10000UL)               /*!< TIMER14_HOLD (Bitfield-Mask: 0x01)                    */
#define DBGMCU_CTL1_TIMER15_HOLD_Pos      (17UL)                    /*!< TIMER15_HOLD (Bit 17)                                 */
#define DBGMCU_CTL1_TIMER15_HOLD_Msk      (0x20000UL)               /*!< TIMER15_HOLD (Bitfield-Mask: 0x01)                    */
#define DBGMCU_CTL1_TIMER16_HOLD_Pos      (18UL)                    /*!< TIMER16_HOLD (Bit 18)                                 */
#define DBGMCU_CTL1_TIMER16_HOLD_Msk      (0x40000UL)               /*!< TIMER16_HOLD (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

