RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* ========================================================  CH3CTL  ========================================================= */
#define DMA_CH3CTL_CHEN_Pos               (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA_CH3CTL_CHEN_Msk               (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH3CTL_FTFIE_Pos              (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA_CH3CTL_FTFIE_Msk              (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH3CTL_HTFIE_Pos              (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA_CH3CTL_HTFIE_Msk              (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH3CTL_ERRIE_Pos              (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA_CH3CTL_ERRIE_Msk              (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH3CTL_DIR_Pos                (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA_CH3CTL_DIR_Msk                (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA_CH3CTL_CMEN_Pos               (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA_CH3CTL_CMEN_Msk               (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH3CTL_PNAGA_Pos              (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA_CH3CTL_PNAGA_Msk              (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH3CTL_MNAGA_Pos              (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA_CH3CTL_MNAGA_Msk              (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH3CTL_PWIDTH_Pos             (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA_CH3CTL_PWIDTH_Msk             (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH3CTL_MWIDTH_Pos             (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA_CH3CTL_MWIDTH_Msk             (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH3CTL_PRIO_Pos               (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA_CH3CTL_PRIO_Msk               (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA_CH3CTL_M2M_Pos                (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA_CH3CTL_M2M_Msk                (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH3CNT  ========================================================= */
#define DMA_CH3CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CH3CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH3PADDR  ======================================================== */
#define DMA_CH3PADDR_PADDR_Pos            (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA_CH3PADDR_PADDR_Msk            (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH3MADDR  ======================================================== */
#define DMA_CH3MADDR_MADDR_Pos            (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA_CH3MADDR_MADDR_Msk            (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  CH4CTL  ========================================================= */
#define DMA_CH4CTL_CHEN_Pos               (0UL)                     /*!< CHEN (Bit 0)                                          */
#define DMA_CH4CTL_CHEN_Msk               (0x1UL)                   /*!< CHEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH4CTL_FTFIE_Pos              (1UL)                     /*!< FTFIE (Bit 1)                                         */
#define DMA_CH4CTL_FTFIE_Msk              (0x2UL)                   /*!< FTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH4CTL_HTFIE_Pos              (2UL)                     /*!< HTFIE (Bit 2)                                         */
#define DMA_CH4CTL_HTFIE_Msk              (0x4UL)                   /*!< HTFIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH4CTL_ERRIE_Pos              (3UL)                     /*!< ERRIE (Bit 3)                                         */
#define DMA_CH4CTL_ERRIE_Msk              (0x8UL)                   /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define DMA_CH4CTL_DIR_Pos                (4UL)                     /*!< DIR (Bit 4)                                           */
#define DMA_CH4CTL_DIR_Msk                (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define DMA_CH4CTL_CMEN_Pos               (5UL)                     /*!< CMEN (Bit 5)                                          */
#define DMA_CH4CTL_CMEN_Msk               (0x20UL)                  /*!< CMEN (Bitfield-Mask: 0x01)                            */
#define DMA_CH4CTL_PNAGA_Pos              (6UL)                     /*!< PNAGA (Bit 6)                                         */
#define DMA_CH4CTL_PNAGA_Msk              (0x40UL)                  /*!< PNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH4CTL_MNAGA_Pos              (7UL)                     /*!< MNAGA (Bit 7)                                         */
#define DMA_CH4CTL_MNAGA_Msk              (0x80UL)                  /*!< MNAGA (Bitfield-Mask: 0x01)                           */
#define DMA_CH4CTL_PWIDTH_Pos             (8UL)                     /*!< PWIDTH (Bit 8)                                        */
#define DMA_CH4CTL_PWIDTH_Msk             (0x300UL)                 /*!< PWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH4CTL_MWIDTH_Pos             (10UL)                    /*!< MWIDTH (Bit 10)                                       */
#define DMA_CH4CTL_MWIDTH_Msk             (0xc00UL)                 /*!< MWIDTH (Bitfield-Mask: 0x03)                          */
#define DMA_CH4CTL_PRIO_Pos               (12UL)                    /*!< PRIO (Bit 12)                                         */
#define DMA_CH4CTL_PRIO_Msk               (0x3000UL)                /*!< PRIO (Bitfield-Mask: 0x03)                            */
#define DMA_CH4CTL_M2M_Pos                (14UL)                    /*!< M2M (Bit 14)                                          */
#define DMA_CH4CTL_M2M_Msk                (0x4000UL)                /*!< M2M (Bitfield-Mask: 0x01)                             */
/* ========================================================  CH4CNT  ========================================================= */
#define DMA_CH4CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CH4CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  CH4PADDR  ======================================================== */
#define DMA_CH4PADDR_PADDR_Pos            (0UL)                     /*!< PADDR (Bit 0)                                         */
#define DMA_CH4PADDR_PADDR_Msk            (0xffffffffUL)            /*!< PADDR (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  CH4MADDR  ======================================================== */
#define DMA_CH4MADDR_MADDR_Pos            (0UL)                     /*!< MADDR (Bit 0)                                         */
#define DMA_CH4MADDR_MADDR_Msk            (0xffffffffUL)            /*!< MADDR (Bitfield-Mask: 0xffffffff)                     */


/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */

