RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  INTEN  ========================================================= */
#define EXTI_INTEN_INTEN0_Pos             (0UL)                     /*!< INTEN0 (Bit 0)                                        */
#define EXTI_INTEN_INTEN0_Msk             (0x1UL)                   /*!< INTEN0 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN1_Pos             (1UL)                     /*!< INTEN1 (Bit 1)                                        */
#define EXTI_INTEN_INTEN1_Msk             (0x2UL)                   /*!< INTEN1 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN2_Pos             (2UL)                     /*!< INTEN2 (Bit 2)                                        */
#define EXTI_INTEN_INTEN2_Msk             (0x4UL)                   /*!< INTEN2 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN3_Pos             (3UL)                     /*!< INTEN3 (Bit 3)                                        */
#define EXTI_INTEN_INTEN3_Msk             (0x8UL)                   /*!< INTEN3 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN4_Pos             (4UL)                     /*!< INTEN4 (Bit 4)                                        */
#define EXTI_INTEN_INTEN4_Msk             (0x10UL)                  /*!< INTEN4 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN5_Pos             (5UL)                     /*!< INTEN5 (Bit 5)                                        */
#define EXTI_INTEN_INTEN5_Msk             (0x20UL)                  /*!< INTEN5 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN6_Pos             (6UL)                     /*!< INTEN6 (Bit 6)                                        */
#define EXTI_INTEN_INTEN6_Msk             (0x40UL)                  /*!< INTEN6 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN7_Pos             (7UL)                     /*!< INTEN7 (Bit 7)                                        */
#define EXTI_INTEN_INTEN7_Msk             (0x80UL)                  /*!< INTEN7 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN8_Pos             (8UL)                     /*!< INTEN8 (Bit 8)                                        */
#define EXTI_INTEN_INTEN8_Msk             (0x100UL)                 /*!< INTEN8 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN9_Pos             (9UL)                     /*!< INTEN9 (Bit 9)                                        */
#define EXTI_INTEN_INTEN9_Msk             (0x200UL)                 /*!< INTEN9 (Bitfield-Mask: 0x01)                          */
#define EXTI_INTEN_INTEN10_Pos            (10UL)                    /*!< INTEN10 (Bit 10)                                      */
#define EXTI_INTEN_INTEN10_Msk            (0x400UL)                 /*!< INTEN10 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN11_Pos            (11UL)                    /*!< INTEN11 (Bit 11)                                      */
#define EXTI_INTEN_INTEN11_Msk            (0x800UL)                 /*!< INTEN11 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN12_Pos            (12UL)                    /*!< INTEN12 (Bit 12)                                      */
#define EXTI_INTEN_INTEN12_Msk            (0x1000UL)                /*!< INTEN12 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN13_Pos            (13UL)                    /*!< INTEN13 (Bit 13)                                      */
#define EXTI_INTEN_INTEN13_Msk            (0x2000UL)                /*!< INTEN13 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN14_Pos            (14UL)                    /*!< INTEN14 (Bit 14)                                      */
#define EXTI_INTEN_INTEN14_Msk            (0x4000UL)                /*!< INTEN14 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN15_Pos            (15UL)                    /*!< INTEN15 (Bit 15)                                      */
#define EXTI_INTEN_INTEN15_Msk            (0x8000UL)                /*!< INTEN15 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN16_Pos            (16UL)                    /*!< INTEN16 (Bit 16)                                      */
#define EXTI_INTEN_INTEN16_Msk            (0x10000UL)               /*!< INTEN16 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN17_Pos            (17UL)                    /*!< INTEN17 (Bit 17)                                      */
#define EXTI_INTEN_INTEN17_Msk            (0x20000UL)               /*!< INTEN17 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN18_Pos            (18UL)                    /*!< INTEN18 (Bit 18)                                      */
#define EXTI_INTEN_INTEN18_Msk            (0x40000UL)               /*!< INTEN18 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN19_Pos            (19UL)                    /*!< INTEN19 (Bit 19)                                      */
#define EXTI_INTEN_INTEN19_Msk            (0x80000UL)               /*!< INTEN19 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN20_Pos            (20UL)                    /*!< INTEN20 (Bit 20)                                      */
#define EXTI_INTEN_INTEN20_Msk            (0x100000UL)              /*!< INTEN20 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN21_Pos            (21UL)                    /*!< INTEN21 (Bit 21)                                      */
#define EXTI_INTEN_INTEN21_Msk            (0x200000UL)              /*!< INTEN21 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN22_Pos            (22UL)                    /*!< INTEN22 (Bit 22)                                      */
#define EXTI_INTEN_INTEN22_Msk            (0x400000UL)              /*!< INTEN22 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN23_Pos            (23UL)                    /*!< INTEN23 (Bit 23)                                      */
#define EXTI_INTEN_INTEN23_Msk            (0x800000UL)              /*!< INTEN23 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN24_Pos            (24UL)                    /*!< INTEN24 (Bit 24)                                      */
#define EXTI_INTEN_INTEN24_Msk            (0x1000000UL)             /*!< INTEN24 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN25_Pos            (25UL)                    /*!< INTEN25 (Bit 25)                                      */
#define EXTI_INTEN_INTEN25_Msk            (0x2000000UL)             /*!< INTEN25 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN26_Pos            (26UL)                    /*!< INTEN26 (Bit 26)                                      */
#define EXTI_INTEN_INTEN26_Msk            (0x4000000UL)             /*!< INTEN26 (Bitfield-Mask: 0x01)                         */
#define EXTI_INTEN_INTEN27_Pos            (27UL)                    /*!< INTEN27 (Bit 27)                                      */
#define EXTI_INTEN_INTEN27_Msk            (0x8000000UL)             /*!< INTEN27 (Bitfield-Mask: 0x01)                         */
/* =========================================================  EVEN  ========================================================== */
#define EXTI_EVEN_EVEN0_Pos               (0UL)                     /*!< EVEN0 (Bit 0)                                         */
#define EXTI_EVEN_EVEN0_Msk               (0x1UL)                   /*!< EVEN0 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN1_Pos               (1UL)                     /*!< EVEN1 (Bit 1)                                         */
#define EXTI_EVEN_EVEN1_Msk               (0x2UL)                   /*!< EVEN1 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN2_Pos               (2UL)                     /*!< EVEN2 (Bit 2)                                         */
#define EXTI_EVEN_EVEN2_Msk               (0x4UL)                   /*!< EVEN2 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN3_Pos               (3UL)                     /*!< EVEN3 (Bit 3)                                         */
#define EXTI_EVEN_EVEN3_Msk               (0x8UL)                   /*!< EVEN3 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN4_Pos               (4UL)                     /*!< EVEN4 (Bit 4)                                         */
#define EXTI_EVEN_EVEN4_Msk               (0x10UL)                  /*!< EVEN4 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN5_Pos               (5UL)                     /*!< EVEN5 (Bit 5)                                         */
#define EXTI_EVEN_EVEN5_Msk               (0x20UL)                  /*!< EVEN5 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN6_Pos               (6UL)                     /*!< EVEN6 (Bit 6)                                         */
#define EXTI_EVEN_EVEN6_Msk               (0x40UL)                  /*!< EVEN6 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN7_Pos               (7UL)                     /*!< EVEN7 (Bit 7)                                         */
#define EXTI_EVEN_EVEN7_Msk               (0x80UL)                  /*!< EVEN7 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN8_Pos               (8UL)                     /*!< EVEN8 (Bit 8)                                         */
#define EXTI_EVEN_EVEN8_Msk               (0x100UL)                 /*!< EVEN8 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN9_Pos               (9UL)                     /*!< EVEN9 (Bit 9)                                         */
#define EXTI_EVEN_EVEN9_Msk               (0x200UL)                 /*!< EVEN9 (Bitfield-Mask: 0x01)                           */
#define EXTI_EVEN_EVEN10_Pos              (10UL)                    /*!< EVEN10 (Bit 10)                                       */
#define EXTI_EVEN_EVEN10_Msk              (0x400UL)                 /*!< EVEN10 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN11_Pos              (11UL)                    /*!< EVEN11 (Bit 11)                                       */
#define EXTI_EVEN_EVEN11_Msk              (0x800UL)                 /*!< EVEN11 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN12_Pos              (12UL)                    /*!< EVEN12 (Bit 12)                                       */
#define EXTI_EVEN_EVEN12_Msk              (0x1000UL)                /*!< EVEN12 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN13_Pos              (13UL)                    /*!< EVEN13 (Bit 13)                                       */
#define EXTI_EVEN_EVEN13_Msk              (0x2000UL)                /*!< EVEN13 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN14_Pos              (14UL)                    /*!< EVEN14 (Bit 14)                                       */
#define EXTI_EVEN_EVEN14_Msk              (0x4000UL)                /*!< EVEN14 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN15_Pos              (15UL)                    /*!< EVEN15 (Bit 15)                                       */
#define EXTI_EVEN_EVEN15_Msk              (0x8000UL)                /*!< EVEN15 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN16_Pos              (16UL)                    /*!< EVEN16 (Bit 16)                                       */
#define EXTI_EVEN_EVEN16_Msk              (0x10000UL)               /*!< EVEN16 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN17_Pos              (17UL)                    /*!< EVEN17 (Bit 17)                                       */
#define EXTI_EVEN_EVEN17_Msk              (0x20000UL)               /*!< EVEN17 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN18_Pos              (18UL)                    /*!< EVEN18 (Bit 18)                                       */
#define EXTI_EVEN_EVEN18_Msk              (0x40000UL)               /*!< EVEN18 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN19_Pos              (19UL)                    /*!< EVEN19 (Bit 19)                                       */
#define EXTI_EVEN_EVEN19_Msk              (0x80000UL)               /*!< EVEN19 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN20_Pos              (20UL)                    /*!< EVEN20 (Bit 20)                                       */
#define EXTI_EVEN_EVEN20_Msk              (0x100000UL)              /*!< EVEN20 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN21_Pos              (21UL)                    /*!< EVEN21 (Bit 21)                                       */
#define EXTI_EVEN_EVEN21_Msk              (0x200000UL)              /*!< EVEN21 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN22_Pos              (22UL)                    /*!< EVEN22 (Bit 22)                                       */
#define EXTI_EVEN_EVEN22_Msk              (0x400000UL)              /*!< EVEN22 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN23_Pos              (23UL)                    /*!< EVEN23 (Bit 23)                                       */
#define EXTI_EVEN_EVEN23_Msk              (0x800000UL)              /*!< EVEN23 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN24_Pos              (24UL)                    /*!< EVEN24 (Bit 24)                                       */
#define EXTI_EVEN_EVEN24_Msk              (0x1000000UL)             /*!< EVEN24 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN25_Pos              (25UL)                    /*!< EVEN25 (Bit 25)                                       */
#define EXTI_EVEN_EVEN25_Msk              (0x2000000UL)             /*!< EVEN25 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN26_Pos              (26UL)                    /*!< EVEN26 (Bit 26)                                       */
#define EXTI_EVEN_EVEN26_Msk              (0x4000000UL)             /*!< EVEN26 (Bitfield-Mask: 0x01)                          */
#define EXTI_EVEN_EVEN27_Pos              (27UL)                    /*!< EVEN27 (Bit 27)                                       */
#define EXTI_EVEN_EVEN27_Msk              (0x8000000UL)             /*!< EVEN27 (Bitfield-Mask: 0x01)                          */
/* =========================================================  RTEN  ========================================================== */
#define EXTI_RTEN_RTEN0_Pos               (0UL)                     /*!< RTEN0 (Bit 0)                                         */
#define EXTI_RTEN_RTEN0_Msk               (0x1UL)                   /*!< RTEN0 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN1_Pos               (1UL)                     /*!< RTEN1 (Bit 1)                                         */
#define EXTI_RTEN_RTEN1_Msk               (0x2UL)                   /*!< RTEN1 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN2_Pos               (2UL)                     /*!< RTEN2 (Bit 2)                                         */
#define EXTI_RTEN_RTEN2_Msk               (0x4UL)                   /*!< RTEN2 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN3_Pos               (3UL)                     /*!< RTEN3 (Bit 3)                                         */
#define EXTI_RTEN_RTEN3_Msk               (0x8UL)                   /*!< RTEN3 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN4_Pos               (4UL)                     /*!< RTEN4 (Bit 4)                                         */
#define EXTI_RTEN_RTEN4_Msk               (0x10UL)                  /*!< RTEN4 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN5_Pos               (5UL)                     /*!< RTEN5 (Bit 5)                                         */
#define EXTI_RTEN_RTEN5_Msk               (0x20UL)                  /*!< RTEN5 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN6_Pos               (6UL)                     /*!< RTEN6 (Bit 6)                                         */
#define EXTI_RTEN_RTEN6_Msk               (0x40UL)                  /*!< RTEN6 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN7_Pos               (7UL)                     /*!< RTEN7 (Bit 7)                                         */
#define EXTI_RTEN_RTEN7_Msk               (0x80UL)                  /*!< RTEN7 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN8_Pos               (8UL)                     /*!< RTEN8 (Bit 8)                                         */
#define EXTI_RTEN_RTEN8_Msk               (0x100UL)                 /*!< RTEN8 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN9_Pos               (9UL)                     /*!< RTEN9 (Bit 9)                                         */
#define EXTI_RTEN_RTEN9_Msk               (0x200UL)                 /*!< RTEN9 (Bitfield-Mask: 0x01)                           */
#define EXTI_RTEN_RTEN10_Pos              (10UL)                    /*!< RTEN10 (Bit 10)                                       */
#define EXTI_RTEN_RTEN10_Msk              (0x400UL)                 /*!< RTEN10 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN11_Pos              (11UL)                    /*!< RTEN11 (Bit 11)                                       */
#define EXTI_RTEN_RTEN11_Msk              (0x800UL)                 /*!< RTEN11 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN12_Pos              (12UL)                    /*!< RTEN12 (Bit 12)                                       */
#define EXTI_RTEN_RTEN12_Msk              (0x1000UL)                /*!< RTEN12 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN13_Pos              (13UL)                    /*!< RTEN13 (Bit 13)                                       */
#define EXTI_RTEN_RTEN13_Msk              (0x2000UL)                /*!< RTEN13 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN14_Pos              (14UL)                    /*!< RTEN14 (Bit 14)                                       */
#define EXTI_RTEN_RTEN14_Msk              (0x4000UL)                /*!< RTEN14 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN15_Pos              (15UL)                    /*!< RTEN15 (Bit 15)                                       */
#define EXTI_RTEN_RTEN15_Msk              (0x8000UL)                /*!< RTEN15 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN16_Pos              (16UL)                    /*!< RTEN16 (Bit 16)                                       */
#define EXTI_RTEN_RTEN16_Msk              (0x10000UL)               /*!< RTEN16 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN17_Pos              (17UL)                    /*!< RTEN17 (Bit 17)                                       */
#define EXTI_RTEN_RTEN17_Msk              (0x20000UL)               /*!< RTEN17 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN19_Pos              (19UL)                    /*!< RTEN19 (Bit 19)                                       */
#define EXTI_RTEN_RTEN19_Msk              (0x80000UL)               /*!< RTEN19 (Bitfield-Mask: 0x01)                          */
#define EXTI_RTEN_RTEN21_Pos              (21UL)                    /*!< RTEN21 (Bit 21)                                       */
#define EXTI_RTEN_RTEN21_Msk              (0x200000UL)              /*!< RTEN21 (Bitfield-Mask: 0x01)                          */
/* =========================================================  FTEN  ========================================================== */
#define EXTI_FTEN_FTEN0_Pos               (0UL)                     /*!< FTEN0 (Bit 0)                                         */
#define EXTI_FTEN_FTEN0_Msk               (0x1UL)                   /*!< FTEN0 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN1_Pos               (1UL)                     /*!< FTEN1 (Bit 1)                                         */
#define EXTI_FTEN_FTEN1_Msk               (0x2UL)                   /*!< FTEN1 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN2_Pos               (2UL)                     /*!< FTEN2 (Bit 2)                                         */
#define EXTI_FTEN_FTEN2_Msk               (0x4UL)                   /*!< FTEN2 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN3_Pos               (3UL)                     /*!< FTEN3 (Bit 3)                                         */
#define EXTI_FTEN_FTEN3_Msk               (0x8UL)                   /*!< FTEN3 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN4_Pos               (4UL)                     /*!< FTEN4 (Bit 4)                                         */
#define EXTI_FTEN_FTEN4_Msk               (0x10UL)                  /*!< FTEN4 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN5_Pos               (5UL)                     /*!< FTEN5 (Bit 5)                                         */
#define EXTI_FTEN_FTEN5_Msk               (0x20UL)                  /*!< FTEN5 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN6_Pos               (6UL)                     /*!< FTEN6 (Bit 6)                                         */
#define EXTI_FTEN_FTEN6_Msk               (0x40UL)                  /*!< FTEN6 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN7_Pos               (7UL)                     /*!< FTEN7 (Bit 7)                                         */
#define EXTI_FTEN_FTEN7_Msk               (0x80UL)                  /*!< FTEN7 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN8_Pos               (8UL)                     /*!< FTEN8 (Bit 8)                                         */
#define EXTI_FTEN_FTEN8_Msk               (0x100UL)                 /*!< FTEN8 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN9_Pos               (9UL)                     /*!< FTEN9 (Bit 9)                                         */
#define EXTI_FTEN_FTEN9_Msk               (0x200UL)                 /*!< FTEN9 (Bitfield-Mask: 0x01)                           */
#define EXTI_FTEN_FTEN10_Pos              (10UL)                    /*!< FTEN10 (Bit 10)                                       */
#define EXTI_FTEN_FTEN10_Msk              (0x400UL)                 /*!< FTEN10 (Bitfield-Mask: 0x01)                          */
#define EXTI_FTEN_FTEN11_Pos              (11UL)                    /*!< FTEN11 (Bit 11)                                       */
#define EXTI_FTEN_FTEN11_Msk              (0x800UL)                 /*!< FTEN11 (Bitfield-Mask: 0x01)                          */
#define EXTI_FTEN_FTEN12_Pos              (12UL)                    /*!< FTEN12 (Bit 12)                                       */
#define EXTI_FTEN_FTEN12_Msk              (0x1000UL)                /*!< FTEN12 (Bitfield-Mask: 0x01)                          */
#define EXTI_FTEN_FTEN13_Pos              (13UL)                    /*!< FTEN13 (Bit 13)                                       */
#define EXTI_FTEN_FTEN13_Msk              (0x2000UL)                /*!< FTEN13 (Bitfield-Mask: 0x01)                          */
