RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* ==========================================================  CTL  ========================================================== */
#define GPIOF_CTL_CTL15_Pos               (30UL)                    /*!< CTL15 (Bit 30)                                        */
#define GPIOF_CTL_CTL15_Msk               (0xc0000000UL)            /*!< CTL15 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL14_Pos               (28UL)                    /*!< CTL14 (Bit 28)                                        */
#define GPIOF_CTL_CTL14_Msk               (0x30000000UL)            /*!< CTL14 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL13_Pos               (26UL)                    /*!< CTL13 (Bit 26)                                        */
#define GPIOF_CTL_CTL13_Msk               (0xc000000UL)             /*!< CTL13 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL12_Pos               (24UL)                    /*!< CTL12 (Bit 24)                                        */
#define GPIOF_CTL_CTL12_Msk               (0x3000000UL)             /*!< CTL12 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL11_Pos               (22UL)                    /*!< CTL11 (Bit 22)                                        */
#define GPIOF_CTL_CTL11_Msk               (0xc00000UL)              /*!< CTL11 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL10_Pos               (20UL)                    /*!< CTL10 (Bit 20)                                        */
#define GPIOF_CTL_CTL10_Msk               (0x300000UL)              /*!< CTL10 (Bitfield-Mask: 0x03)                           */
#define GPIOF_CTL_CTL9_Pos                (18UL)                    /*!< CTL9 (Bit 18)                                         */
#define GPIOF_CTL_CTL9_Msk                (0xc0000UL)               /*!< CTL9 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL8_Pos                (16UL)                    /*!< CTL8 (Bit 16)                                         */
#define GPIOF_CTL_CTL8_Msk                (0x30000UL)               /*!< CTL8 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL7_Pos                (14UL)                    /*!< CTL7 (Bit 14)                                         */
#define GPIOF_CTL_CTL7_Msk                (0xc000UL)                /*!< CTL7 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL6_Pos                (12UL)                    /*!< CTL6 (Bit 12)                                         */
#define GPIOF_CTL_CTL6_Msk                (0x3000UL)                /*!< CTL6 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL5_Pos                (10UL)                    /*!< CTL5 (Bit 10)                                         */
#define GPIOF_CTL_CTL5_Msk                (0xc00UL)                 /*!< CTL5 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL4_Pos                (8UL)                     /*!< CTL4 (Bit 8)                                          */
#define GPIOF_CTL_CTL4_Msk                (0x300UL)                 /*!< CTL4 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL3_Pos                (6UL)                     /*!< CTL3 (Bit 6)                                          */
#define GPIOF_CTL_CTL3_Msk                (0xc0UL)                  /*!< CTL3 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL2_Pos                (4UL)                     /*!< CTL2 (Bit 4)                                          */
#define GPIOF_CTL_CTL2_Msk                (0x30UL)                  /*!< CTL2 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL1_Pos                (2UL)                     /*!< CTL1 (Bit 2)                                          */
#define GPIOF_CTL_CTL1_Msk                (0xcUL)                   /*!< CTL1 (Bitfield-Mask: 0x03)                            */
#define GPIOF_CTL_CTL0_Pos                (0UL)                     /*!< CTL0 (Bit 0)                                          */
#define GPIOF_CTL_CTL0_Msk                (0x3UL)                   /*!< CTL0 (Bitfield-Mask: 0x03)                            */
/* =========================================================  OMODE  ========================================================= */
#define GPIOF_OMODE_OM15_Pos              (15UL)                    /*!< OM15 (Bit 15)                                         */
#define GPIOF_OMODE_OM15_Msk              (0x8000UL)                /*!< OM15 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM14_Pos              (14UL)                    /*!< OM14 (Bit 14)                                         */
#define GPIOF_OMODE_OM14_Msk              (0x4000UL)                /*!< OM14 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM13_Pos              (13UL)                    /*!< OM13 (Bit 13)                                         */
#define GPIOF_OMODE_OM13_Msk              (0x2000UL)                /*!< OM13 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM12_Pos              (12UL)                    /*!< OM12 (Bit 12)                                         */
#define GPIOF_OMODE_OM12_Msk              (0x1000UL)                /*!< OM12 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM11_Pos              (11UL)                    /*!< OM11 (Bit 11)                                         */
#define GPIOF_OMODE_OM11_Msk              (0x800UL)                 /*!< OM11 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM10_Pos              (10UL)                    /*!< OM10 (Bit 10)                                         */
#define GPIOF_OMODE_OM10_Msk              (0x400UL)                 /*!< OM10 (Bitfield-Mask: 0x01)                            */
#define GPIOF_OMODE_OM9_Pos               (9UL)                     /*!< OM9 (Bit 9)                                           */
#define GPIOF_OMODE_OM9_Msk               (0x200UL)                 /*!< OM9 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM8_Pos               (8UL)                     /*!< OM8 (Bit 8)                                           */
#define GPIOF_OMODE_OM8_Msk               (0x100UL)                 /*!< OM8 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM7_Pos               (7UL)                     /*!< OM7 (Bit 7)                                           */
#define GPIOF_OMODE_OM7_Msk               (0x80UL)                  /*!< OM7 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM6_Pos               (6UL)                     /*!< OM6 (Bit 6)                                           */
#define GPIOF_OMODE_OM6_Msk               (0x40UL)                  /*!< OM6 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM5_Pos               (5UL)                     /*!< OM5 (Bit 5)                                           */
#define GPIOF_OMODE_OM5_Msk               (0x20UL)                  /*!< OM5 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM4_Pos               (4UL)                     /*!< OM4 (Bit 4)                                           */
#define GPIOF_OMODE_OM4_Msk               (0x10UL)                  /*!< OM4 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM3_Pos               (3UL)                     /*!< OM3 (Bit 3)                                           */
#define GPIOF_OMODE_OM3_Msk               (0x8UL)                   /*!< OM3 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM2_Pos               (2UL)                     /*!< OM2 (Bit 2)                                           */
#define GPIOF_OMODE_OM2_Msk               (0x4UL)                   /*!< OM2 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM1_Pos               (1UL)                     /*!< OM1 (Bit 1)                                           */
#define GPIOF_OMODE_OM1_Msk               (0x2UL)                   /*!< OM1 (Bitfield-Mask: 0x01)                             */
#define GPIOF_OMODE_OM0_Pos               (0UL)                     /*!< OM0 (Bit 0)                                           */
#define GPIOF_OMODE_OM0_Msk               (0x1UL)                   /*!< OM0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  OSPD  ========================================================== */
#define GPIOF_OSPD_OSPD15_Pos             (30UL)                    /*!< OSPD15 (Bit 30)                                       */
#define GPIOF_OSPD_OSPD15_Msk             (0xc0000000UL)            /*!< OSPD15 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD14_Pos             (28UL)                    /*!< OSPD14 (Bit 28)                                       */
#define GPIOF_OSPD_OSPD14_Msk             (0x30000000UL)            /*!< OSPD14 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD13_Pos             (26UL)                    /*!< OSPD13 (Bit 26)                                       */
#define GPIOF_OSPD_OSPD13_Msk             (0xc000000UL)             /*!< OSPD13 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD12_Pos             (24UL)                    /*!< OSPD12 (Bit 24)                                       */
#define GPIOF_OSPD_OSPD12_Msk             (0x3000000UL)             /*!< OSPD12 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD11_Pos             (22UL)                    /*!< OSPD11 (Bit 22)                                       */
#define GPIOF_OSPD_OSPD11_Msk             (0xc00000UL)              /*!< OSPD11 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD10_Pos             (20UL)                    /*!< OSPD10 (Bit 20)                                       */
#define GPIOF_OSPD_OSPD10_Msk             (0x300000UL)              /*!< OSPD10 (Bitfield-Mask: 0x03)                          */
#define GPIOF_OSPD_OSPD9_Pos              (18UL)                    /*!< OSPD9 (Bit 18)                                        */
#define GPIOF_OSPD_OSPD9_Msk              (0xc0000UL)               /*!< OSPD9 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD8_Pos              (16UL)                    /*!< OSPD8 (Bit 16)                                        */
#define GPIOF_OSPD_OSPD8_Msk              (0x30000UL)               /*!< OSPD8 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD7_Pos              (14UL)                    /*!< OSPD7 (Bit 14)                                        */
#define GPIOF_OSPD_OSPD7_Msk              (0xc000UL)                /*!< OSPD7 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD6_Pos              (12UL)                    /*!< OSPD6 (Bit 12)                                        */
#define GPIOF_OSPD_OSPD6_Msk              (0x3000UL)                /*!< OSPD6 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD5_Pos              (10UL)                    /*!< OSPD5 (Bit 10)                                        */
#define GPIOF_OSPD_OSPD5_Msk              (0xc00UL)                 /*!< OSPD5 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD4_Pos              (8UL)                     /*!< OSPD4 (Bit 8)                                         */
#define GPIOF_OSPD_OSPD4_Msk              (0x300UL)                 /*!< OSPD4 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD3_Pos              (6UL)                     /*!< OSPD3 (Bit 6)                                         */
#define GPIOF_OSPD_OSPD3_Msk              (0xc0UL)                  /*!< OSPD3 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD2_Pos              (4UL)                     /*!< OSPD2 (Bit 4)                                         */
#define GPIOF_OSPD_OSPD2_Msk              (0x30UL)                  /*!< OSPD2 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD1_Pos              (2UL)                     /*!< OSPD1 (Bit 2)                                         */
#define GPIOF_OSPD_OSPD1_Msk              (0xcUL)                   /*!< OSPD1 (Bitfield-Mask: 0x03)                           */
#define GPIOF_OSPD_OSPD0_Pos              (0UL)                     /*!< OSPD0 (Bit 0)                                         */
#define GPIOF_OSPD_OSPD0_Msk              (0x3UL)                   /*!< OSPD0 (Bitfield-Mask: 0x03)                           */
/* ==========================================================  PUD  ========================================================== */
#define GPIOF_PUD_PUD15_Pos               (30UL)                    /*!< PUD15 (Bit 30)                                        */
#define GPIOF_PUD_PUD15_Msk               (0xc0000000UL)            /*!< PUD15 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD14_Pos               (28UL)                    /*!< PUD14 (Bit 28)                                        */
#define GPIOF_PUD_PUD14_Msk               (0x30000000UL)            /*!< PUD14 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD13_Pos               (26UL)                    /*!< PUD13 (Bit 26)                                        */
#define GPIOF_PUD_PUD13_Msk               (0xc000000UL)             /*!< PUD13 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD12_Pos               (24UL)                    /*!< PUD12 (Bit 24)                                        */
#define GPIOF_PUD_PUD12_Msk               (0x3000000UL)             /*!< PUD12 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD11_Pos               (22UL)                    /*!< PUD11 (Bit 22)                                        */
#define GPIOF_PUD_PUD11_Msk               (0xc00000UL)              /*!< PUD11 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD10_Pos               (20UL)                    /*!< PUD10 (Bit 20)                                        */
#define GPIOF_PUD_PUD10_Msk               (0x300000UL)              /*!< PUD10 (Bitfield-Mask: 0x03)                           */
#define GPIOF_PUD_PUD9_Pos                (18UL)                    /*!< PUD9 (Bit 18)                                         */
#define GPIOF_PUD_PUD9_Msk                (0xc0000UL)               /*!< PUD9 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD8_Pos                (16UL)                    /*!< PUD8 (Bit 16)                                         */
#define GPIOF_PUD_PUD8_Msk                (0x30000UL)               /*!< PUD8 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD7_Pos                (14UL)                    /*!< PUD7 (Bit 14)                                         */
#define GPIOF_PUD_PUD7_Msk                (0xc000UL)                /*!< PUD7 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD6_Pos                (12UL)                    /*!< PUD6 (Bit 12)                                         */
#define GPIOF_PUD_PUD6_Msk                (0x3000UL)                /*!< PUD6 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD5_Pos                (10UL)                    /*!< PUD5 (Bit 10)                                         */
#define GPIOF_PUD_PUD5_Msk                (0xc00UL)                 /*!< PUD5 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD4_Pos                (8UL)                     /*!< PUD4 (Bit 8)                                          */
#define GPIOF_PUD_PUD4_Msk                (0x300UL)                 /*!< PUD4 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD3_Pos                (6UL)                     /*!< PUD3 (Bit 6)                                          */
#define GPIOF_PUD_PUD3_Msk                (0xc0UL)                  /*!< PUD3 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD2_Pos                (4UL)                     /*!< PUD2 (Bit 4)                                          */
#define GPIOF_PUD_PUD2_Msk                (0x30UL)                  /*!< PUD2 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD1_Pos                (2UL)                     /*!< PUD1 (Bit 2)                                          */
#define GPIOF_PUD_PUD1_Msk                (0xcUL)                   /*!< PUD1 (Bitfield-Mask: 0x03)                            */
#define GPIOF_PUD_PUD0_Pos                (0UL)                     /*!< PUD0 (Bit 0)                                          */
#define GPIOF_PUD_PUD0_Msk                (0x3UL)                   /*!< PUD0 (Bitfield-Mask: 0x03)                            */
/* =========================================================  ISTAT  ========================================================= */
#define GPIOF_ISTAT_ISTAT15_Pos           (15UL)                    /*!< ISTAT15 (Bit 15)                                      */
#define GPIOF_ISTAT_ISTAT15_Msk           (0x8000UL)                /*!< ISTAT15 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT14_Pos           (14UL)                    /*!< ISTAT14 (Bit 14)                                      */
#define GPIOF_ISTAT_ISTAT14_Msk           (0x4000UL)                /*!< ISTAT14 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT13_Pos           (13UL)                    /*!< ISTAT13 (Bit 13)                                      */
#define GPIOF_ISTAT_ISTAT13_Msk           (0x2000UL)                /*!< ISTAT13 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT12_Pos           (12UL)                    /*!< ISTAT12 (Bit 12)                                      */
#define GPIOF_ISTAT_ISTAT12_Msk           (0x1000UL)                /*!< ISTAT12 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT11_Pos           (11UL)                    /*!< ISTAT11 (Bit 11)                                      */
#define GPIOF_ISTAT_ISTAT11_Msk           (0x800UL)                 /*!< ISTAT11 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT10_Pos           (10UL)                    /*!< ISTAT10 (Bit 10)                                      */
#define GPIOF_ISTAT_ISTAT10_Msk           (0x400UL)                 /*!< ISTAT10 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISTAT_ISTAT9_Pos            (9UL)                     /*!< ISTAT9 (Bit 9)                                        */
#define GPIOF_ISTAT_ISTAT9_Msk            (0x200UL)                 /*!< ISTAT9 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT8_Pos            (8UL)                     /*!< ISTAT8 (Bit 8)                                        */
#define GPIOF_ISTAT_ISTAT8_Msk            (0x100UL)                 /*!< ISTAT8 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT7_Pos            (7UL)                     /*!< ISTAT7 (Bit 7)                                        */
#define GPIOF_ISTAT_ISTAT7_Msk            (0x80UL)                  /*!< ISTAT7 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT6_Pos            (6UL)                     /*!< ISTAT6 (Bit 6)                                        */
#define GPIOF_ISTAT_ISTAT6_Msk            (0x40UL)                  /*!< ISTAT6 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT5_Pos            (5UL)                     /*!< ISTAT5 (Bit 5)                                        */
#define GPIOF_ISTAT_ISTAT5_Msk            (0x20UL)                  /*!< ISTAT5 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT4_Pos            (4UL)                     /*!< ISTAT4 (Bit 4)                                        */
#define GPIOF_ISTAT_ISTAT4_Msk            (0x10UL)                  /*!< ISTAT4 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT3_Pos            (3UL)                     /*!< ISTAT3 (Bit 3)                                        */
#define GPIOF_ISTAT_ISTAT3_Msk            (0x8UL)                   /*!< ISTAT3 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT2_Pos            (2UL)                     /*!< ISTAT2 (Bit 2)                                        */
#define GPIOF_ISTAT_ISTAT2_Msk            (0x4UL)                   /*!< ISTAT2 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT1_Pos            (1UL)                     /*!< ISTAT1 (Bit 1)                                        */
#define GPIOF_ISTAT_ISTAT1_Msk            (0x2UL)                   /*!< ISTAT1 (Bitfield-Mask: 0x01)                          */
#define GPIOF_ISTAT_ISTAT0_Pos            (0UL)                     /*!< ISTAT0 (Bit 0)                                        */
#define GPIOF_ISTAT_ISTAT0_Msk            (0x1UL)                   /*!< ISTAT0 (Bitfield-Mask: 0x01)                          */
/* =========================================================  OCTL  ========================================================== */
#define GPIOF_OCTL_OCTL15_Pos             (15UL)                    /*!< OCTL15 (Bit 15)                                       */
#define GPIOF_OCTL_OCTL15_Msk             (0x8000UL)                /*!< OCTL15 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL14_Pos             (14UL)                    /*!< OCTL14 (Bit 14)                                       */
#define GPIOF_OCTL_OCTL14_Msk             (0x4000UL)                /*!< OCTL14 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL13_Pos             (13UL)                    /*!< OCTL13 (Bit 13)                                       */
#define GPIOF_OCTL_OCTL13_Msk             (0x2000UL)                /*!< OCTL13 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL12_Pos             (12UL)                    /*!< OCTL12 (Bit 12)                                       */
#define GPIOF_OCTL_OCTL12_Msk             (0x1000UL)                /*!< OCTL12 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL11_Pos             (11UL)                    /*!< OCTL11 (Bit 11)                                       */
#define GPIOF_OCTL_OCTL11_Msk             (0x800UL)                 /*!< OCTL11 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL10_Pos             (10UL)                    /*!< OCTL10 (Bit 10)                                       */
#define GPIOF_OCTL_OCTL10_Msk             (0x400UL)                 /*!< OCTL10 (Bitfield-Mask: 0x01)                          */
#define GPIOF_OCTL_OCTL9_Pos              (9UL)                     /*!< OCTL9 (Bit 9)                                         */
#define GPIOF_OCTL_OCTL9_Msk              (0x200UL)                 /*!< OCTL9 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL8_Pos              (8UL)                     /*!< OCTL8 (Bit 8)                                         */
#define GPIOF_OCTL_OCTL8_Msk              (0x100UL)                 /*!< OCTL8 (Bitfield-Mask: 0x01)                           */
#define GPIOF_OCTL_OCTL7_Pos              (7UL)                     /*!< OCTL7 (Bit 7)                                         */
#define GPIOF_OCTL_OCTL7_Msk              (0x80UL)                  /*!< OCTL7 (Bitfield-Mask: 0x01)                           */
