RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  ISER0  ========================================================= */
#define NVIC_ISER0_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER0_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER1  ========================================================= */
#define NVIC_ISER1_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER1_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER2  ========================================================= */
#define NVIC_ISER2_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER2_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER3  ========================================================= */
#define NVIC_ISER3_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER3_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER4  ========================================================= */
#define NVIC_ISER4_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER4_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER5  ========================================================= */
#define NVIC_ISER5_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER5_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER6  ========================================================= */
#define NVIC_ISER6_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER6_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER7  ========================================================= */
#define NVIC_ISER7_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER7_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER8  ========================================================= */
#define NVIC_ISER8_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER8_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISER9  ========================================================= */
#define NVIC_ISER9_SETENA_Pos             (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER9_SETENA_Msk             (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER10  ========================================================= */
#define NVIC_ISER10_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER10_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER11  ========================================================= */
#define NVIC_ISER11_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER11_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER12  ========================================================= */
#define NVIC_ISER12_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER12_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER13  ========================================================= */
#define NVIC_ISER13_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER13_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER14  ========================================================= */
#define NVIC_ISER14_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER14_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ISER15  ========================================================= */
#define NVIC_ISER15_SETENA_Pos            (0UL)                     /*!< SETENA (Bit 0)                                        */
#define NVIC_ISER15_SETENA_Msk            (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER0  ========================================================= */
#define NVIC_ICER0_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER0_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER1  ========================================================= */
#define NVIC_ICER1_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER1_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER2  ========================================================= */
#define NVIC_ICER2_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER2_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER3  ========================================================= */
#define NVIC_ICER3_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER3_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER4  ========================================================= */
#define NVIC_ICER4_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER4_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER5  ========================================================= */
#define NVIC_ICER5_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER5_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER6  ========================================================= */
#define NVIC_ICER6_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER6_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER7  ========================================================= */
#define NVIC_ICER7_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER7_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER8  ========================================================= */
#define NVIC_ICER8_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER8_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ICER9  ========================================================= */
#define NVIC_ICER9_CLRENA_Pos             (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER9_CLRENA_Msk             (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER10  ========================================================= */
#define NVIC_ICER10_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER10_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER11  ========================================================= */
#define NVIC_ICER11_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER11_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER12  ========================================================= */
#define NVIC_ICER12_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER12_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER13  ========================================================= */
#define NVIC_ICER13_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER13_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER14  ========================================================= */
#define NVIC_ICER14_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER14_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* ========================================================  ICER15  ========================================================= */
#define NVIC_ICER15_CLRENA_Pos            (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define NVIC_ICER15_CLRENA_Msk            (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  ISPR0  ========================================================= */
#define NVIC_ISPR0_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR0_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR1  ========================================================= */
#define NVIC_ISPR1_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR1_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR2  ========================================================= */
#define NVIC_ISPR2_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR2_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR3  ========================================================= */
#define NVIC_ISPR3_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR3_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR4  ========================================================= */
#define NVIC_ISPR4_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR4_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR5  ========================================================= */
#define NVIC_ISPR5_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR5_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR6  ========================================================= */
#define NVIC_ISPR6_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR6_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR7  ========================================================= */
#define NVIC_ISPR7_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR7_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR8  ========================================================= */
#define NVIC_ISPR8_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR8_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ISPR9  ========================================================= */
#define NVIC_ISPR9_SETPEND_Pos            (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR9_SETPEND_Msk            (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR10  ========================================================= */
#define NVIC_ISPR10_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR10_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR11  ========================================================= */
#define NVIC_ISPR11_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR11_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR12  ========================================================= */
#define NVIC_ISPR12_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR12_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR13  ========================================================= */
#define NVIC_ISPR13_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR13_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR14  ========================================================= */
#define NVIC_ISPR14_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR14_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ISPR15  ========================================================= */
#define NVIC_ISPR15_SETPEND_Pos           (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define NVIC_ISPR15_SETPEND_Msk           (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR0  ========================================================= */
#define NVIC_ICPR0_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR0_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR1  ========================================================= */
#define NVIC_ICPR1_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR1_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR2  ========================================================= */
#define NVIC_ICPR2_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR2_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR3  ========================================================= */
#define NVIC_ICPR3_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR3_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR4  ========================================================= */
#define NVIC_ICPR4_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR4_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR5  ========================================================= */
#define NVIC_ICPR5_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR5_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR6  ========================================================= */
#define NVIC_ICPR6_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR6_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR7  ========================================================= */
#define NVIC_ICPR7_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR7_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR8  ========================================================= */
#define NVIC_ICPR8_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR8_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  ICPR9  ========================================================= */
#define NVIC_ICPR9_CLRPEND_Pos            (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR9_CLRPEND_Msk            (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR10  ========================================================= */
#define NVIC_ICPR10_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR10_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR11  ========================================================= */
#define NVIC_ICPR11_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR11_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR12  ========================================================= */
#define NVIC_ICPR12_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR12_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR13  ========================================================= */
