RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define NVIC_ICPR13_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR13_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR14  ========================================================= */
#define NVIC_ICPR14_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR14_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ICPR15  ========================================================= */
#define NVIC_ICPR15_CLRPEND_Pos           (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define NVIC_ICPR15_CLRPEND_Msk           (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  IABR0  ========================================================= */
#define NVIC_IABR0_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR0_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR1  ========================================================= */
#define NVIC_IABR1_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR1_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR2  ========================================================= */
#define NVIC_IABR2_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR2_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR3  ========================================================= */
#define NVIC_IABR3_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR3_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR4  ========================================================= */
#define NVIC_IABR4_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR4_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR5  ========================================================= */
#define NVIC_IABR5_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR5_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR6  ========================================================= */
#define NVIC_IABR6_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR6_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR7  ========================================================= */
#define NVIC_IABR7_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR7_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR8  ========================================================= */
#define NVIC_IABR8_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR8_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IABR9  ========================================================= */
#define NVIC_IABR9_IABR_Pos               (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR9_IABR_Msk               (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR10  ========================================================= */
#define NVIC_IABR10_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR10_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR11  ========================================================= */
#define NVIC_IABR11_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR11_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR12  ========================================================= */
#define NVIC_IABR12_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR12_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR13  ========================================================= */
#define NVIC_IABR13_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR13_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR14  ========================================================= */
#define NVIC_IABR14_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR14_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  IABR15  ========================================================= */
#define NVIC_IABR15_IABR_Pos              (0UL)                     /*!< IABR (Bit 0)                                          */
#define NVIC_IABR15_IABR_Msk              (0xffffffffUL)            /*!< IABR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS0  ========================================================= */
#define NVIC_ITNS0_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS0_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS1  ========================================================= */
#define NVIC_ITNS1_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS1_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS2  ========================================================= */
#define NVIC_ITNS2_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS2_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS3  ========================================================= */
#define NVIC_ITNS3_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS3_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS4  ========================================================= */
#define NVIC_ITNS4_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS4_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS5  ========================================================= */
#define NVIC_ITNS5_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS5_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS6  ========================================================= */
#define NVIC_ITNS6_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS6_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS7  ========================================================= */
#define NVIC_ITNS7_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS7_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS8  ========================================================= */
#define NVIC_ITNS8_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS8_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ITNS9  ========================================================= */
#define NVIC_ITNS9_ITNS_Pos               (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS9_ITNS_Msk               (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS10  ========================================================= */
#define NVIC_ITNS10_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS10_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS11  ========================================================= */
#define NVIC_ITNS11_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS11_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS12  ========================================================= */
#define NVIC_ITNS12_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS12_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS13  ========================================================= */
#define NVIC_ITNS13_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS13_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS14  ========================================================= */
#define NVIC_ITNS14_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS14_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  ITNS15  ========================================================= */
#define NVIC_ITNS15_ITNS_Pos              (0UL)                     /*!< ITNS (Bit 0)                                          */
#define NVIC_ITNS15_ITNS_Msk              (0xffffffffUL)            /*!< ITNS (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  IPR0  ========================================================== */
#define NVIC_IPR0_PRI_00_Pos              (0UL)                     /*!< PRI_00 (Bit 0)                                        */
#define NVIC_IPR0_PRI_00_Msk              (0xffUL)                  /*!< PRI_00 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR1  ========================================================== */
#define NVIC_IPR1_PRI_01_Pos              (0UL)                     /*!< PRI_01 (Bit 0)                                        */
#define NVIC_IPR1_PRI_01_Msk              (0xffUL)                  /*!< PRI_01 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR2  ========================================================== */
#define NVIC_IPR2_PRI_02_Pos              (0UL)                     /*!< PRI_02 (Bit 0)                                        */
#define NVIC_IPR2_PRI_02_Msk              (0xffUL)                  /*!< PRI_02 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR3  ========================================================== */
#define NVIC_IPR3_PRI_03_Pos              (0UL)                     /*!< PRI_03 (Bit 0)                                        */
#define NVIC_IPR3_PRI_03_Msk              (0xffUL)                  /*!< PRI_03 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR4  ========================================================== */
#define NVIC_IPR4_PRI_04_Pos              (0UL)                     /*!< PRI_04 (Bit 0)                                        */
#define NVIC_IPR4_PRI_04_Msk              (0xffUL)                  /*!< PRI_04 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR5  ========================================================== */
#define NVIC_IPR5_PRI_05_Pos              (0UL)                     /*!< PRI_05 (Bit 0)                                        */
#define NVIC_IPR5_PRI_05_Msk              (0xffUL)                  /*!< PRI_05 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR6  ========================================================== */
#define NVIC_IPR6_PRI_06_Pos              (0UL)                     /*!< PRI_06 (Bit 0)                                        */
#define NVIC_IPR6_PRI_06_Msk              (0xffUL)                  /*!< PRI_06 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR7  ========================================================== */
#define NVIC_IPR7_PRI_07_Pos              (0UL)                     /*!< PRI_07 (Bit 0)                                        */
#define NVIC_IPR7_PRI_07_Msk              (0xffUL)                  /*!< PRI_07 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR8  ========================================================== */
#define NVIC_IPR8_PRI_08_Pos              (0UL)                     /*!< PRI_08 (Bit 0)                                        */
#define NVIC_IPR8_PRI_08_Msk              (0xffUL)                  /*!< PRI_08 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR9  ========================================================== */
#define NVIC_IPR9_PRI_09_Pos              (0UL)                     /*!< PRI_09 (Bit 0)                                        */
#define NVIC_IPR9_PRI_09_Msk              (0xffUL)                  /*!< PRI_09 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR10  ========================================================= */
#define NVIC_IPR10_PRI_10_Pos             (0UL)                     /*!< PRI_10 (Bit 0)                                        */
#define NVIC_IPR10_PRI_10_Msk             (0xffUL)                  /*!< PRI_10 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR11  ========================================================= */
#define NVIC_IPR11_PRI_11_Pos             (0UL)                     /*!< PRI_11 (Bit 0)                                        */
#define NVIC_IPR11_PRI_11_Msk             (0xffUL)                  /*!< PRI_11 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR12  ========================================================= */
#define NVIC_IPR12_PRI_12_Pos             (0UL)                     /*!< PRI_12 (Bit 0)                                        */
#define NVIC_IPR12_PRI_12_Msk             (0xffUL)                  /*!< PRI_12 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR13  ========================================================= */
#define NVIC_IPR13_PRI_13_Pos             (0UL)                     /*!< PRI_13 (Bit 0)                                        */
#define NVIC_IPR13_PRI_13_Msk             (0xffUL)                  /*!< PRI_13 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR14  ========================================================= */
#define NVIC_IPR14_PRI_14_Pos             (0UL)                     /*!< PRI_14 (Bit 0)                                        */
#define NVIC_IPR14_PRI_14_Msk             (0xffUL)                  /*!< PRI_14 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR15  ========================================================= */
#define NVIC_IPR15_PRI_15_Pos             (0UL)                     /*!< PRI_15 (Bit 0)                                        */
#define NVIC_IPR15_PRI_15_Msk             (0xffUL)                  /*!< PRI_15 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR16  ========================================================= */
#define NVIC_IPR16_PRI_16_Pos             (0UL)                     /*!< PRI_16 (Bit 0)                                        */
#define NVIC_IPR16_PRI_16_Msk             (0xffUL)                  /*!< PRI_16 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR17  ========================================================= */
#define NVIC_IPR17_PRI_17_Pos             (0UL)                     /*!< PRI_17 (Bit 0)                                        */
#define NVIC_IPR17_PRI_17_Msk             (0xffUL)                  /*!< PRI_17 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR18  ========================================================= */
#define NVIC_IPR18_PRI_18_Pos             (0UL)                     /*!< PRI_18 (Bit 0)                                        */
#define NVIC_IPR18_PRI_18_Msk             (0xffUL)                  /*!< PRI_18 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR19  ========================================================= */
#define NVIC_IPR19_PRI_19_Pos             (0UL)                     /*!< PRI_19 (Bit 0)                                        */
#define NVIC_IPR19_PRI_19_Msk             (0xffUL)                  /*!< PRI_19 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR20  ========================================================= */
#define NVIC_IPR20_PRI_20_Pos             (0UL)                     /*!< PRI_20 (Bit 0)                                        */
#define NVIC_IPR20_PRI_20_Msk             (0xffUL)                  /*!< PRI_20 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR21  ========================================================= */
#define NVIC_IPR21_PRI_21_Pos             (0UL)                     /*!< PRI_21 (Bit 0)                                        */
#define NVIC_IPR21_PRI_21_Msk             (0xffUL)                  /*!< PRI_21 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR22  ========================================================= */
#define NVIC_IPR22_PRI_22_Pos             (0UL)                     /*!< PRI_22 (Bit 0)                                        */
#define NVIC_IPR22_PRI_22_Msk             (0xffUL)                  /*!< PRI_22 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR23  ========================================================= */
#define NVIC_IPR23_PRI_23_Pos             (0UL)                     /*!< PRI_23 (Bit 0)                                        */
#define NVIC_IPR23_PRI_23_Msk             (0xffUL)                  /*!< PRI_23 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR24  ========================================================= */
#define NVIC_IPR24_PRI_24_Pos             (0UL)                     /*!< PRI_24 (Bit 0)                                        */
#define NVIC_IPR24_PRI_24_Msk             (0xffUL)                  /*!< PRI_24 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR25  ========================================================= */
#define NVIC_IPR25_PRI_25_Pos             (0UL)                     /*!< PRI_25 (Bit 0)                                        */
#define NVIC_IPR25_PRI_25_Msk             (0xffUL)                  /*!< PRI_25 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR26  ========================================================= */
#define NVIC_IPR26_PRI_26_Pos             (0UL)                     /*!< PRI_26 (Bit 0)                                        */
