RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define NVIC_IPR26_PRI_26_Msk             (0xffUL)                  /*!< PRI_26 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR27  ========================================================= */
#define NVIC_IPR27_PRI_27_Pos             (0UL)                     /*!< PRI_27 (Bit 0)                                        */
#define NVIC_IPR27_PRI_27_Msk             (0xffUL)                  /*!< PRI_27 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR28  ========================================================= */
#define NVIC_IPR28_PRI_28_Pos             (0UL)                     /*!< PRI_28 (Bit 0)                                        */
#define NVIC_IPR28_PRI_28_Msk             (0xffUL)                  /*!< PRI_28 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR29  ========================================================= */
#define NVIC_IPR29_PRI_29_Pos             (0UL)                     /*!< PRI_29 (Bit 0)                                        */
#define NVIC_IPR29_PRI_29_Msk             (0xffUL)                  /*!< PRI_29 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR30  ========================================================= */
#define NVIC_IPR30_PRI_30_Pos             (0UL)                     /*!< PRI_30 (Bit 0)                                        */
#define NVIC_IPR30_PRI_30_Msk             (0xffUL)                  /*!< PRI_30 (Bitfield-Mask: 0xff)                          */
/* =========================================================  IPR31  ========================================================= */
#define NVIC_IPR31_PRI_31_Pos             (0UL)                     /*!< PRI_31 (Bit 0)                                        */
#define NVIC_IPR31_PRI_31_Msk             (0xffUL)                  /*!< PRI_31 (Bitfield-Mask: 0xff)                          */


/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define PMU_CTL_LDOVS_Pos                 (14UL)                    /*!< LDOVS (Bit 14)                                        */
#define PMU_CTL_LDOVS_Msk                 (0xc000UL)                /*!< LDOVS (Bitfield-Mask: 0x03)                           */
#define PMU_CTL_BKPWEN_Pos                (8UL)                     /*!< BKPWEN (Bit 8)                                        */
#define PMU_CTL_BKPWEN_Msk                (0x100UL)                 /*!< BKPWEN (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LVDT_Pos                  (5UL)                     /*!< LVDT (Bit 5)                                          */
#define PMU_CTL_LVDT_Msk                  (0xe0UL)                  /*!< LVDT (Bitfield-Mask: 0x07)                            */
#define PMU_CTL_LVDEN_Pos                 (4UL)                     /*!< LVDEN (Bit 4)                                         */
#define PMU_CTL_LVDEN_Msk                 (0x10UL)                  /*!< LVDEN (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBRST_Pos                (3UL)                     /*!< STBRST (Bit 3)                                        */
#define PMU_CTL_STBRST_Msk                (0x8UL)                   /*!< STBRST (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_WURST_Pos                 (2UL)                     /*!< WURST (Bit 2)                                         */
#define PMU_CTL_WURST_Msk                 (0x4UL)                   /*!< WURST (Bitfield-Mask: 0x01)                           */
#define PMU_CTL_STBMOD_Pos                (1UL)                     /*!< STBMOD (Bit 1)                                        */
#define PMU_CTL_STBMOD_Msk                (0x2UL)                   /*!< STBMOD (Bitfield-Mask: 0x01)                          */
#define PMU_CTL_LDOLP_Pos                 (0UL)                     /*!< LDOLP (Bit 0)                                         */
#define PMU_CTL_LDOLP_Msk                 (0x1UL)                   /*!< LDOLP (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CS  =========================================================== */
#define PMU_CS_WUPEN6_Pos                 (14UL)                    /*!< WUPEN6 (Bit 14)                                       */
#define PMU_CS_WUPEN6_Msk                 (0x4000UL)                /*!< WUPEN6 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN5_Pos                 (13UL)                    /*!< WUPEN5 (Bit 13)                                       */
#define PMU_CS_WUPEN5_Msk                 (0x2000UL)                /*!< WUPEN5 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN1_Pos                 (9UL)                     /*!< WUPEN1 (Bit 9)                                        */
#define PMU_CS_WUPEN1_Msk                 (0x200UL)                 /*!< WUPEN1 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_WUPEN0_Pos                 (8UL)                     /*!< WUPEN0 (Bit 8)                                        */
#define PMU_CS_WUPEN0_Msk                 (0x100UL)                 /*!< WUPEN0 (Bitfield-Mask: 0x01)                          */
#define PMU_CS_LVDF_Pos                   (2UL)                     /*!< LVDF (Bit 2)                                          */
#define PMU_CS_LVDF_Msk                   (0x4UL)                   /*!< LVDF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_STBF_Pos                   (1UL)                     /*!< STBF (Bit 1)                                          */
#define PMU_CS_STBF_Msk                   (0x2UL)                   /*!< STBF (Bitfield-Mask: 0x01)                            */
#define PMU_CS_WUF_Pos                    (0UL)                     /*!< WUF (Bit 0)                                           */
#define PMU_CS_WUF_Msk                    (0x1UL)                   /*!< WUF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            RCU                                            ================ */
/* =========================================================================================================================== */

