RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define RCU_BDCTL_RTCEN_Msk               (0x8000UL)                /*!< RTCEN (Bitfield-Mask: 0x01)                           */
#define RCU_BDCTL_RTCSRC_Pos              (8UL)                     /*!< RTCSRC (Bit 8)                                        */
#define RCU_BDCTL_RTCSRC_Msk              (0x300UL)                 /*!< RTCSRC (Bitfield-Mask: 0x03)                          */
#define RCU_BDCTL_LXTALDRI_Pos            (3UL)                     /*!< LXTALDRI (Bit 3)                                      */
#define RCU_BDCTL_LXTALDRI_Msk            (0x18UL)                  /*!< LXTALDRI (Bitfield-Mask: 0x03)                        */
#define RCU_BDCTL_LXTALBPS_Pos            (2UL)                     /*!< LXTALBPS (Bit 2)                                      */
#define RCU_BDCTL_LXTALBPS_Msk            (0x4UL)                   /*!< LXTALBPS (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_LXTALSTB_Pos            (1UL)                     /*!< LXTALSTB (Bit 1)                                      */
#define RCU_BDCTL_LXTALSTB_Msk            (0x2UL)                   /*!< LXTALSTB (Bitfield-Mask: 0x01)                        */
#define RCU_BDCTL_LXTALEN_Pos             (0UL)                     /*!< LXTALEN (Bit 0)                                       */
#define RCU_BDCTL_LXTALEN_Msk             (0x1UL)                   /*!< LXTALEN (Bitfield-Mask: 0x01)                         */
/* ========================================================  RSTSCK  ========================================================= */
#define RCU_RSTSCK_LPRSTF_Pos             (31UL)                    /*!< LPRSTF (Bit 31)                                       */
#define RCU_RSTSCK_LPRSTF_Msk             (0x80000000UL)            /*!< LPRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_WWDGTRSTF_Pos          (30UL)                    /*!< WWDGTRSTF (Bit 30)                                    */
#define RCU_RSTSCK_WWDGTRSTF_Msk          (0x40000000UL)            /*!< WWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_FWDGTRSTF_Pos          (29UL)                    /*!< FWDGTRSTF (Bit 29)                                    */
#define RCU_RSTSCK_FWDGTRSTF_Msk          (0x20000000UL)            /*!< FWDGTRSTF (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_SWRSTF_Pos             (28UL)                    /*!< SWRSTF (Bit 28)                                       */
#define RCU_RSTSCK_SWRSTF_Msk             (0x10000000UL)            /*!< SWRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_PORRSTF_Pos            (27UL)                    /*!< PORRSTF (Bit 27)                                      */
#define RCU_RSTSCK_PORRSTF_Msk            (0x8000000UL)             /*!< PORRSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_EPRSTF_Pos             (26UL)                    /*!< EPRSTF (Bit 26)                                       */
#define RCU_RSTSCK_EPRSTF_Msk             (0x4000000UL)             /*!< EPRSTF (Bitfield-Mask: 0x01)                          */
#define RCU_RSTSCK_OBLRSTF_Pos            (25UL)                    /*!< OBLRSTF (Bit 25)                                      */
#define RCU_RSTSCK_OBLRSTF_Msk            (0x2000000UL)             /*!< OBLRSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_RSTFC_Pos              (24UL)                    /*!< RSTFC (Bit 24)                                        */
#define RCU_RSTSCK_RSTFC_Msk              (0x1000000UL)             /*!< RSTFC (Bitfield-Mask: 0x01)                           */
#define RCU_RSTSCK_V12RSTF_Pos            (23UL)                    /*!< V12RSTF (Bit 23)                                      */
#define RCU_RSTSCK_V12RSTF_Msk            (0x800000UL)              /*!< V12RSTF (Bitfield-Mask: 0x01)                         */
#define RCU_RSTSCK_IRC40KSTB_Pos          (1UL)                     /*!< IRC40KSTB (Bit 1)                                     */
#define RCU_RSTSCK_IRC40KSTB_Msk          (0x2UL)                   /*!< IRC40KSTB (Bitfield-Mask: 0x01)                       */
#define RCU_RSTSCK_IRC40KEN_Pos           (0UL)                     /*!< IRC40KEN (Bit 0)                                      */
#define RCU_RSTSCK_IRC40KEN_Msk           (0x1UL)                   /*!< IRC40KEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  AHBRST  ========================================================= */
#define RCU_AHBRST_PFRST_Pos              (22UL)                    /*!< PFRST (Bit 22)                                        */
#define RCU_AHBRST_PFRST_Msk              (0x400000UL)              /*!< PFRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PCRST_Pos              (19UL)                    /*!< PCRST (Bit 19)                                        */
#define RCU_AHBRST_PCRST_Msk              (0x80000UL)               /*!< PCRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PBRST_Pos              (18UL)                    /*!< PBRST (Bit 18)                                        */
#define RCU_AHBRST_PBRST_Msk              (0x40000UL)               /*!< PBRST (Bitfield-Mask: 0x01)                           */
#define RCU_AHBRST_PARST_Pos              (17UL)                    /*!< PARST (Bit 17)                                        */
#define RCU_AHBRST_PARST_Msk              (0x20000UL)               /*!< PARST (Bitfield-Mask: 0x01)                           */
/* =========================================================  CFG1  ========================================================== */
#define RCU_CFG1_PREDV_Pos                (0UL)                     /*!< PREDV (Bit 0)                                         */
#define RCU_CFG1_PREDV_Msk                (0xfUL)                   /*!< PREDV (Bitfield-Mask: 0x0f)                           */
/* =========================================================  CFG2  ========================================================== */
#define RCU_CFG2_ADCPSC_Pos               (31UL)                    /*!< ADCPSC (Bit 31)                                       */
#define RCU_CFG2_ADCPSC_Msk               (0x80000000UL)            /*!< ADCPSC (Bitfield-Mask: 0x01)                          */
#define RCU_CFG2_IRC28MDIV_Pos            (16UL)                    /*!< IRC28MDIV (Bit 16)                                    */
#define RCU_CFG2_IRC28MDIV_Msk            (0x10000UL)               /*!< IRC28MDIV (Bitfield-Mask: 0x01)                       */
#define RCU_CFG2_ADCSEL_Pos               (8UL)                     /*!< ADCSEL (Bit 8)                                        */
#define RCU_CFG2_ADCSEL_Msk               (0x100UL)                 /*!< ADCSEL (Bitfield-Mask: 0x01)                          */
#define RCU_CFG2_USART0SEL_Pos            (0UL)                     /*!< USART0SEL (Bit 0)                                     */
#define RCU_CFG2_USART0SEL_Msk            (0x3UL)                   /*!< USART0SEL (Bitfield-Mask: 0x03)                       */
/* =========================================================  CTL1  ========================================================== */
#define RCU_CTL1_IRC28MCALIB_Pos          (8UL)                     /*!< IRC28MCALIB (Bit 8)                                   */
#define RCU_CTL1_IRC28MCALIB_Msk          (0xff00UL)                /*!< IRC28MCALIB (Bitfield-Mask: 0xff)                     */
#define RCU_CTL1_IRC28MADJ_Pos            (3UL)                     /*!< IRC28MADJ (Bit 3)                                     */
#define RCU_CTL1_IRC28MADJ_Msk            (0xf8UL)                  /*!< IRC28MADJ (Bitfield-Mask: 0x1f)                       */
#define RCU_CTL1_IRC28MSTB_Pos            (1UL)                     /*!< IRC28MSTB (Bit 1)                                     */
#define RCU_CTL1_IRC28MSTB_Msk            (0x2UL)                   /*!< IRC28MSTB (Bitfield-Mask: 0x01)                       */
#define RCU_CTL1_IRC28MEN_Pos             (0UL)                     /*!< IRC28MEN (Bit 0)                                      */
#define RCU_CTL1_IRC28MEN_Msk             (0x1UL)                   /*!< IRC28MEN (Bitfield-Mask: 0x01)                        */
/* =========================================================  VKEY  ========================================================== */
#define RCU_VKEY_KEY_Pos                  (0UL)                     /*!< KEY (Bit 0)                                           */
#define RCU_VKEY_KEY_Msk                  (0xffffffffUL)            /*!< KEY (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  DSV  ========================================================== */
#define RCU_DSV_DSLPVS_Pos                (0UL)                     /*!< DSLPVS (Bit 0)                                        */
#define RCU_DSV_DSLPVS_Msk                (0x3UL)                   /*!< DSLPVS (Bitfield-Mask: 0x03)                          */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

