RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  TIME  ========================================================== */
#define RTC_TIME_PM_Pos                   (22UL)                    /*!< PM (Bit 22)                                           */
#define RTC_TIME_PM_Msk                   (0x400000UL)              /*!< PM (Bitfield-Mask: 0x01)                              */
#define RTC_TIME_HRT_Pos                  (20UL)                    /*!< HRT (Bit 20)                                          */
#define RTC_TIME_HRT_Msk                  (0x300000UL)              /*!< HRT (Bitfield-Mask: 0x03)                             */
#define RTC_TIME_HRU_Pos                  (16UL)                    /*!< HRU (Bit 16)                                          */
#define RTC_TIME_HRU_Msk                  (0xf0000UL)               /*!< HRU (Bitfield-Mask: 0x0f)                             */
#define RTC_TIME_MNT_Pos                  (12UL)                    /*!< MNT (Bit 12)                                          */
#define RTC_TIME_MNT_Msk                  (0x7000UL)                /*!< MNT (Bitfield-Mask: 0x07)                             */
#define RTC_TIME_MNU_Pos                  (8UL)                     /*!< MNU (Bit 8)                                           */
#define RTC_TIME_MNU_Msk                  (0xf00UL)                 /*!< MNU (Bitfield-Mask: 0x0f)                             */
#define RTC_TIME_SCT_Pos                  (4UL)                     /*!< SCT (Bit 4)                                           */
#define RTC_TIME_SCT_Msk                  (0x70UL)                  /*!< SCT (Bitfield-Mask: 0x07)                             */
#define RTC_TIME_SCU_Pos                  (0UL)                     /*!< SCU (Bit 0)                                           */
#define RTC_TIME_SCU_Msk                  (0xfUL)                   /*!< SCU (Bitfield-Mask: 0x0f)                             */
/* =========================================================  DATE  ========================================================== */
#define RTC_DATE_YRT_Pos                  (20UL)                    /*!< YRT (Bit 20)                                          */
#define RTC_DATE_YRT_Msk                  (0xf00000UL)              /*!< YRT (Bitfield-Mask: 0x0f)                             */
#define RTC_DATE_YRU_Pos                  (16UL)                    /*!< YRU (Bit 16)                                          */
#define RTC_DATE_YRU_Msk                  (0xf0000UL)               /*!< YRU (Bitfield-Mask: 0x0f)                             */
#define RTC_DATE_DOW_Pos                  (13UL)                    /*!< DOW (Bit 13)                                          */
#define RTC_DATE_DOW_Msk                  (0xe000UL)                /*!< DOW (Bitfield-Mask: 0x07)                             */
#define RTC_DATE_MONT_Pos                 (12UL)                    /*!< MONT (Bit 12)                                         */
#define RTC_DATE_MONT_Msk                 (0x1000UL)                /*!< MONT (Bitfield-Mask: 0x01)                            */
#define RTC_DATE_MONU_Pos                 (8UL)                     /*!< MONU (Bit 8)                                          */
#define RTC_DATE_MONU_Msk                 (0xf00UL)                 /*!< MONU (Bitfield-Mask: 0x0f)                            */
#define RTC_DATE_DAYT_Pos                 (4UL)                     /*!< DAYT (Bit 4)                                          */
#define RTC_DATE_DAYT_Msk                 (0x30UL)                  /*!< DAYT (Bitfield-Mask: 0x03)                            */
#define RTC_DATE_DAYU_Pos                 (0UL)                     /*!< DAYU (Bit 0)                                          */
#define RTC_DATE_DAYU_Msk                 (0xfUL)                   /*!< DAYU (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  CTL  ========================================================== */
#define RTC_CTL_COEN_Pos                  (23UL)                    /*!< COEN (Bit 23)                                         */
#define RTC_CTL_COEN_Msk                  (0x800000UL)              /*!< COEN (Bitfield-Mask: 0x01)                            */
#define RTC_CTL_OS_Pos                    (21UL)                    /*!< OS (Bit 21)                                           */
#define RTC_CTL_OS_Msk                    (0x600000UL)              /*!< OS (Bitfield-Mask: 0x03)                              */
#define RTC_CTL_OPOL_Pos                  (20UL)                    /*!< OPOL (Bit 20)                                         */
#define RTC_CTL_OPOL_Msk                  (0x100000UL)              /*!< OPOL (Bitfield-Mask: 0x01)                            */
#define RTC_CTL_COS_Pos                   (19UL)                    /*!< COS (Bit 19)                                          */
#define RTC_CTL_COS_Msk                   (0x80000UL)               /*!< COS (Bitfield-Mask: 0x01)                             */
#define RTC_CTL_DSM_Pos                   (18UL)                    /*!< DSM (Bit 18)                                          */
#define RTC_CTL_DSM_Msk                   (0x40000UL)               /*!< DSM (Bitfield-Mask: 0x01)                             */
#define RTC_CTL_S1H_Pos                   (17UL)                    /*!< S1H (Bit 17)                                          */
#define RTC_CTL_S1H_Msk                   (0x20000UL)               /*!< S1H (Bitfield-Mask: 0x01)                             */
#define RTC_CTL_A1H_Pos                   (16UL)                    /*!< A1H (Bit 16)                                          */
#define RTC_CTL_A1H_Msk                   (0x10000UL)               /*!< A1H (Bitfield-Mask: 0x01)                             */
#define RTC_CTL_TSIE_Pos                  (15UL)                    /*!< TSIE (Bit 15)                                         */
#define RTC_CTL_TSIE_Msk                  (0x8000UL)                /*!< TSIE (Bitfield-Mask: 0x01)                            */
#define RTC_CTL_ALRM0IE_Pos               (12UL)                    /*!< ALRM0IE (Bit 12)                                      */
#define RTC_CTL_ALRM0IE_Msk               (0x1000UL)                /*!< ALRM0IE (Bitfield-Mask: 0x01)                         */
#define RTC_CTL_TSEN_Pos                  (11UL)                    /*!< TSEN (Bit 11)                                         */
#define RTC_CTL_TSEN_Msk                  (0x800UL)                 /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define RTC_CTL_ALRM0EN_Pos               (8UL)                     /*!< ALRM0EN (Bit 8)                                       */
#define RTC_CTL_ALRM0EN_Msk               (0x100UL)                 /*!< ALRM0EN (Bitfield-Mask: 0x01)                         */
#define RTC_CTL_CS_Pos                    (6UL)                     /*!< CS (Bit 6)                                            */
#define RTC_CTL_CS_Msk                    (0x40UL)                  /*!< CS (Bitfield-Mask: 0x01)                              */
#define RTC_CTL_BPSHAD_Pos                (5UL)                     /*!< BPSHAD (Bit 5)                                        */
#define RTC_CTL_BPSHAD_Msk                (0x20UL)                  /*!< BPSHAD (Bitfield-Mask: 0x01)                          */
#define RTC_CTL_REFEN_Pos                 (4UL)                     /*!< REFEN (Bit 4)                                         */
#define RTC_CTL_REFEN_Msk                 (0x10UL)                  /*!< REFEN (Bitfield-Mask: 0x01)                           */
#define RTC_CTL_TSEG_Pos                  (3UL)                     /*!< TSEG (Bit 3)                                          */
#define RTC_CTL_TSEG_Msk                  (0x8UL)                   /*!< TSEG (Bitfield-Mask: 0x01)                            */
/* =========================================================  STAT  ========================================================== */
#define RTC_STAT_SCPF_Pos                 (16UL)                    /*!< SCPF (Bit 16)                                         */
#define RTC_STAT_SCPF_Msk                 (0x10000UL)               /*!< SCPF (Bitfield-Mask: 0x01)                            */
#define RTC_STAT_TP1F_Pos                 (14UL)                    /*!< TP1F (Bit 14)                                         */
#define RTC_STAT_TP1F_Msk                 (0x4000UL)                /*!< TP1F (Bitfield-Mask: 0x01)                            */
#define RTC_STAT_TP0F_Pos                 (13UL)                    /*!< TP0F (Bit 13)                                         */
#define RTC_STAT_TP0F_Msk                 (0x2000UL)                /*!< TP0F (Bitfield-Mask: 0x01)                            */
#define RTC_STAT_TSOVRF_Pos               (12UL)                    /*!< TSOVRF (Bit 12)                                       */
#define RTC_STAT_TSOVRF_Msk               (0x1000UL)                /*!< TSOVRF (Bitfield-Mask: 0x01)                          */
#define RTC_STAT_TSF_Pos                  (11UL)                    /*!< TSF (Bit 11)                                          */
#define RTC_STAT_TSF_Msk                  (0x800UL)                 /*!< TSF (Bitfield-Mask: 0x01)                             */
#define RTC_STAT_ALRM0F_Pos               (8UL)                     /*!< ALRM0F (Bit 8)                                        */
#define RTC_STAT_ALRM0F_Msk               (0x100UL)                 /*!< ALRM0F (Bitfield-Mask: 0x01)                          */
#define RTC_STAT_INITM_Pos                (7UL)                     /*!< INITM (Bit 7)                                         */
#define RTC_STAT_INITM_Msk                (0x80UL)                  /*!< INITM (Bitfield-Mask: 0x01)                           */
#define RTC_STAT_INITF_Pos                (6UL)                     /*!< INITF (Bit 6)                                         */
#define RTC_STAT_INITF_Msk                (0x40UL)                  /*!< INITF (Bitfield-Mask: 0x01)                           */
#define RTC_STAT_RSYNF_Pos                (5UL)                     /*!< RSYNF (Bit 5)                                         */
#define RTC_STAT_RSYNF_Msk                (0x20UL)                  /*!< RSYNF (Bitfield-Mask: 0x01)                           */
#define RTC_STAT_YCM_Pos                  (4UL)                     /*!< YCM (Bit 4)                                           */
#define RTC_STAT_YCM_Msk                  (0x10UL)                  /*!< YCM (Bitfield-Mask: 0x01)                             */
#define RTC_STAT_SOPF_Pos                 (3UL)                     /*!< SOPF (Bit 3)                                          */
#define RTC_STAT_SOPF_Msk                 (0x8UL)                   /*!< SOPF (Bitfield-Mask: 0x01)                            */
#define RTC_STAT_ALRM0WF_Pos              (0UL)                     /*!< ALRM0WF (Bit 0)                                       */
#define RTC_STAT_ALRM0WF_Msk              (0x1UL)                   /*!< ALRM0WF (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PSC  ========================================================== */
#define RTC_PSC_FACTOR_A_Pos              (16UL)                    /*!< FACTOR_A (Bit 16)                                     */
#define RTC_PSC_FACTOR_A_Msk              (0x7f0000UL)              /*!< FACTOR_A (Bitfield-Mask: 0x7f)                        */
#define RTC_PSC_FACTOR_S_Pos              (0UL)                     /*!< FACTOR_S (Bit 0)                                      */
#define RTC_PSC_FACTOR_S_Msk              (0x7fffUL)                /*!< FACTOR_S (Bitfield-Mask: 0x7fff)                      */
/* ========================================================  ALRM0TD  ======================================================== */
#define RTC_ALRM0TD_MSKD_Pos              (31UL)                    /*!< MSKD (Bit 31)                                         */
#define RTC_ALRM0TD_MSKD_Msk              (0x80000000UL)            /*!< MSKD (Bitfield-Mask: 0x01)                            */
#define RTC_ALRM0TD_DOWS_Pos              (30UL)                    /*!< DOWS (Bit 30)                                         */
#define RTC_ALRM0TD_DOWS_Msk              (0x40000000UL)            /*!< DOWS (Bitfield-Mask: 0x01)                            */
#define RTC_ALRM0TD_DAYT_Pos              (28UL)                    /*!< DAYT (Bit 28)                                         */
#define RTC_ALRM0TD_DAYT_Msk              (0x30000000UL)            /*!< DAYT (Bitfield-Mask: 0x03)                            */
#define RTC_ALRM0TD_DAYU_Pos              (24UL)                    /*!< DAYU (Bit 24)                                         */
#define RTC_ALRM0TD_DAYU_Msk              (0xf000000UL)             /*!< DAYU (Bitfield-Mask: 0x0f)                            */
#define RTC_ALRM0TD_MSKH_Pos              (23UL)                    /*!< MSKH (Bit 23)                                         */
#define RTC_ALRM0TD_MSKH_Msk              (0x800000UL)              /*!< MSKH (Bitfield-Mask: 0x01)                            */
#define RTC_ALRM0TD_PM_Pos                (22UL)                    /*!< PM (Bit 22)                                           */
#define RTC_ALRM0TD_PM_Msk                (0x400000UL)              /*!< PM (Bitfield-Mask: 0x01)                              */
#define RTC_ALRM0TD_HRT_Pos               (20UL)                    /*!< HRT (Bit 20)                                          */
#define RTC_ALRM0TD_HRT_Msk               (0x300000UL)              /*!< HRT (Bitfield-Mask: 0x03)                             */
#define RTC_ALRM0TD_HRU_Pos               (16UL)                    /*!< HRU (Bit 16)                                          */
#define RTC_ALRM0TD_HRU_Msk               (0xf0000UL)               /*!< HRU (Bitfield-Mask: 0x0f)                             */
#define RTC_ALRM0TD_MSKM_Pos              (15UL)                    /*!< MSKM (Bit 15)                                         */
#define RTC_ALRM0TD_MSKM_Msk              (0x8000UL)                /*!< MSKM (Bitfield-Mask: 0x01)                            */
#define RTC_ALRM0TD_MNT_Pos               (12UL)                    /*!< MNT (Bit 12)                                          */
#define RTC_ALRM0TD_MNT_Msk               (0x7000UL)                /*!< MNT (Bitfield-Mask: 0x07)                             */
#define RTC_ALRM0TD_MNU_Pos               (8UL)                     /*!< MNU (Bit 8)                                           */
#define RTC_ALRM0TD_MNU_Msk               (0xf00UL)                 /*!< MNU (Bitfield-Mask: 0x0f)                             */
#define RTC_ALRM0TD_MSKS_Pos              (7UL)                     /*!< MSKS (Bit 7)                                          */
#define RTC_ALRM0TD_MSKS_Msk              (0x80UL)                  /*!< MSKS (Bitfield-Mask: 0x01)                            */
#define RTC_ALRM0TD_SCT_Pos               (4UL)                     /*!< SCT (Bit 4)                                           */
#define RTC_ALRM0TD_SCT_Msk               (0x70UL)                  /*!< SCT (Bitfield-Mask: 0x07)                             */
#define RTC_ALRM0TD_SCU_Pos               (0UL)                     /*!< SCU (Bit 0)                                           */
#define RTC_ALRM0TD_SCU_Msk               (0xfUL)                   /*!< SCU (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  WPK  ========================================================== */
#define RTC_WPK_WPK_Pos                   (0UL)                     /*!< WPK (Bit 0)                                           */
#define RTC_WPK_WPK_Msk                   (0xffUL)                  /*!< WPK (Bitfield-Mask: 0xff)                             */
/* ==========================================================  SS  =========================================================== */
#define RTC_SS_SSC_Pos                    (0UL)                     /*!< SSC (Bit 0)                                           */
#define RTC_SS_SSC_Msk                    (0xffffUL)                /*!< SSC (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SHIFTCTL  ======================================================== */
#define RTC_SHIFTCTL_A1S_Pos              (31UL)                    /*!< A1S (Bit 31)                                          */
#define RTC_SHIFTCTL_A1S_Msk              (0x80000000UL)            /*!< A1S (Bitfield-Mask: 0x01)                             */
#define RTC_SHIFTCTL_SFS_Pos              (0UL)                     /*!< SFS (Bit 0)                                           */
#define RTC_SHIFTCTL_SFS_Msk              (0x7fffUL)                /*!< SFS (Bitfield-Mask: 0x7fff)                           */
/* ==========================================================  TTS  ========================================================== */
#define RTC_TTS_PM_Pos                    (22UL)                    /*!< PM (Bit 22)                                           */
#define RTC_TTS_PM_Msk                    (0x400000UL)              /*!< PM (Bitfield-Mask: 0x01)                              */
#define RTC_TTS_HRT_Pos                   (20UL)                    /*!< HRT (Bit 20)                                          */
#define RTC_TTS_HRT_Msk                   (0x300000UL)              /*!< HRT (Bitfield-Mask: 0x03)                             */
#define RTC_TTS_HRU_Pos                   (16UL)                    /*!< HRU (Bit 16)                                          */
#define RTC_TTS_HRU_Msk                   (0xf0000UL)               /*!< HRU (Bitfield-Mask: 0x0f)                             */
#define RTC_TTS_MNT_Pos                   (12UL)                    /*!< MNT (Bit 12)                                          */
#define RTC_TTS_MNT_Msk                   (0x7000UL)                /*!< MNT (Bitfield-Mask: 0x07)                             */
#define RTC_TTS_MNU_Pos                   (8UL)                     /*!< MNU (Bit 8)                                           */
#define RTC_TTS_MNU_Msk                   (0xf00UL)                 /*!< MNU (Bitfield-Mask: 0x0f)                             */
#define RTC_TTS_SCT_Pos                   (4UL)                     /*!< SCT (Bit 4)                                           */
#define RTC_TTS_SCT_Msk                   (0x70UL)                  /*!< SCT (Bitfield-Mask: 0x07)                             */
#define RTC_TTS_SCU_Pos                   (0UL)                     /*!< SCU (Bit 0)                                           */
#define RTC_TTS_SCU_Msk                   (0xfUL)                   /*!< SCU (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  DTS  ========================================================== */
#define RTC_DTS_DOW_Pos                   (13UL)                    /*!< DOW (Bit 13)                                          */
#define RTC_DTS_DOW_Msk                   (0xe000UL)                /*!< DOW (Bitfield-Mask: 0x07)                             */
#define RTC_DTS_MONT_Pos                  (12UL)                    /*!< MONT (Bit 12)                                         */
#define RTC_DTS_MONT_Msk                  (0x1000UL)                /*!< MONT (Bitfield-Mask: 0x01)                            */
#define RTC_DTS_MONU_Pos                  (8UL)                     /*!< MONU (Bit 8)                                          */
#define RTC_DTS_MONU_Msk                  (0xf00UL)                 /*!< MONU (Bitfield-Mask: 0x0f)                            */
#define RTC_DTS_DAYT_Pos                  (5UL)                     /*!< DAYT (Bit 5)                                          */
#define RTC_DTS_DAYT_Msk                  (0x60UL)                  /*!< DAYT (Bitfield-Mask: 0x03)                            */
#define RTC_DTS_DAYU_Pos                  (0UL)                     /*!< DAYU (Bit 0)                                          */
#define RTC_DTS_DAYU_Msk                  (0x1fUL)                  /*!< DAYU (Bitfield-Mask: 0x1f)                            */
/* =========================================================  SSTS  ========================================================== */
#define RTC_SSTS_SSC_Pos                  (0UL)                     /*!< SSC (Bit 0)                                           */
#define RTC_SSTS_SSC_Msk                  (0xffffUL)                /*!< SSC (Bitfield-Mask: 0xffff)                           */
/* =========================================================  HRFC  ========================================================== */
#define RTC_HRFC_FREQI_Pos                (15UL)                    /*!< FREQI (Bit 15)                                        */
#define RTC_HRFC_FREQI_Msk                (0x8000UL)                /*!< FREQI (Bitfield-Mask: 0x01)                           */
#define RTC_HRFC_CWND8_Pos                (14UL)                    /*!< CWND8 (Bit 14)                                        */
#define RTC_HRFC_CWND8_Msk                (0x4000UL)                /*!< CWND8 (Bitfield-Mask: 0x01)                           */
#define RTC_HRFC_CWND16_Pos               (13UL)                    /*!< CWND16 (Bit 13)                                       */
#define RTC_HRFC_CWND16_Msk               (0x2000UL)                /*!< CWND16 (Bitfield-Mask: 0x01)                          */
#define RTC_HRFC_CMSK_Pos                 (0UL)                     /*!< CMSK (Bit 0)                                          */
#define RTC_HRFC_CMSK_Msk                 (0x1ffUL)                 /*!< CMSK (Bitfield-Mask: 0x1ff)                           */
/* =========================================================  TAMP  ========================================================== */
#define RTC_TAMP_PC15MDE_Pos              (23UL)                    /*!< PC15MDE (Bit 23)                                      */
#define RTC_TAMP_PC15MDE_Msk              (0x800000UL)              /*!< PC15MDE (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_PC15VAL_Pos              (22UL)                    /*!< PC15VAL (Bit 22)                                      */
#define RTC_TAMP_PC15VAL_Msk              (0x400000UL)              /*!< PC15VAL (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_PC14MDE_Pos              (21UL)                    /*!< PC14MDE (Bit 21)                                      */
#define RTC_TAMP_PC14MDE_Msk              (0x200000UL)              /*!< PC14MDE (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_PC14VAL_Pos              (20UL)                    /*!< PC14VAL (Bit 20)                                      */
#define RTC_TAMP_PC14VAL_Msk              (0x100000UL)              /*!< PC14VAL (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_PC13MDE_Pos              (19UL)                    /*!< PC13MDE (Bit 19)                                      */
#define RTC_TAMP_PC13MDE_Msk              (0x80000UL)               /*!< PC13MDE (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_PC13VAL_Pos              (18UL)                    /*!< PC13VAL (Bit 18)                                      */
#define RTC_TAMP_PC13VAL_Msk              (0x40000UL)               /*!< PC13VAL (Bitfield-Mask: 0x01)                         */
#define RTC_TAMP_DISPU_Pos                (15UL)                    /*!< DISPU (Bit 15)                                        */
#define RTC_TAMP_DISPU_Msk                (0x8000UL)                /*!< DISPU (Bitfield-Mask: 0x01)                           */
