RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  CTL0  ========================================================== */
#define SPI1_CTL0_BDEN_Pos                (15UL)                    /*!< BDEN (Bit 15)                                         */
#define SPI1_CTL0_BDEN_Msk                (0x8000UL)                /*!< BDEN (Bitfield-Mask: 0x01)                            */
#define SPI1_CTL0_BDOEN_Pos               (14UL)                    /*!< BDOEN (Bit 14)                                        */
#define SPI1_CTL0_BDOEN_Msk               (0x4000UL)                /*!< BDOEN (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL0_CRCEN_Pos               (13UL)                    /*!< CRCEN (Bit 13)                                        */
#define SPI1_CTL0_CRCEN_Msk               (0x2000UL)                /*!< CRCEN (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL0_CRCNT_Pos               (12UL)                    /*!< CRCNT (Bit 12)                                        */
#define SPI1_CTL0_CRCNT_Msk               (0x1000UL)                /*!< CRCNT (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL0_CRCL_Pos                (11UL)                    /*!< CRCL (Bit 11)                                         */
#define SPI1_CTL0_CRCL_Msk                (0x800UL)                 /*!< CRCL (Bitfield-Mask: 0x01)                            */
#define SPI1_CTL0_RO_Pos                  (10UL)                    /*!< RO (Bit 10)                                           */
#define SPI1_CTL0_RO_Msk                  (0x400UL)                 /*!< RO (Bitfield-Mask: 0x01)                              */
#define SPI1_CTL0_SWNSSEN_Pos             (9UL)                     /*!< SWNSSEN (Bit 9)                                       */
#define SPI1_CTL0_SWNSSEN_Msk             (0x200UL)                 /*!< SWNSSEN (Bitfield-Mask: 0x01)                         */
#define SPI1_CTL0_SWNSS_Pos               (8UL)                     /*!< SWNSS (Bit 8)                                         */
#define SPI1_CTL0_SWNSS_Msk               (0x100UL)                 /*!< SWNSS (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL0_LF_Pos                  (7UL)                     /*!< LF (Bit 7)                                            */
#define SPI1_CTL0_LF_Msk                  (0x80UL)                  /*!< LF (Bitfield-Mask: 0x01)                              */
#define SPI1_CTL0_SPIEN_Pos               (6UL)                     /*!< SPIEN (Bit 6)                                         */
#define SPI1_CTL0_SPIEN_Msk               (0x40UL)                  /*!< SPIEN (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL0_PSC_Pos                 (3UL)                     /*!< PSC (Bit 3)                                           */
#define SPI1_CTL0_PSC_Msk                 (0x38UL)                  /*!< PSC (Bitfield-Mask: 0x07)                             */
#define SPI1_CTL0_MSTMOD_Pos              (2UL)                     /*!< MSTMOD (Bit 2)                                        */
#define SPI1_CTL0_MSTMOD_Msk              (0x4UL)                   /*!< MSTMOD (Bitfield-Mask: 0x01)                          */
#define SPI1_CTL0_CKPL_Pos                (1UL)                     /*!< CKPL (Bit 1)                                          */
#define SPI1_CTL0_CKPL_Msk                (0x2UL)                   /*!< CKPL (Bitfield-Mask: 0x01)                            */
#define SPI1_CTL0_CKPH_Pos                (0UL)                     /*!< CKPH (Bit 0)                                          */
#define SPI1_CTL0_CKPH_Msk                (0x1UL)                   /*!< CKPH (Bitfield-Mask: 0x01)                            */
/* =========================================================  CTL1  ========================================================== */
#define SPI1_CTL1_TXDMA_ODD_Pos           (14UL)                    /*!< TXDMA_ODD (Bit 14)                                    */
#define SPI1_CTL1_TXDMA_ODD_Msk           (0x4000UL)                /*!< TXDMA_ODD (Bitfield-Mask: 0x01)                       */
#define SPI1_CTL1_RXDMA_ODD_Pos           (13UL)                    /*!< RXDMA_ODD (Bit 13)                                    */
#define SPI1_CTL1_RXDMA_ODD_Msk           (0x2000UL)                /*!< RXDMA_ODD (Bitfield-Mask: 0x01)                       */
#define SPI1_CTL1_BYTEN_Pos               (12UL)                    /*!< BYTEN (Bit 12)                                        */
#define SPI1_CTL1_BYTEN_Msk               (0x1000UL)                /*!< BYTEN (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL1_DZ_Pos                  (8UL)                     /*!< DZ (Bit 8)                                            */
#define SPI1_CTL1_DZ_Msk                  (0xf00UL)                 /*!< DZ (Bitfield-Mask: 0x0f)                              */
#define SPI1_CTL1_TBEIE_Pos               (7UL)                     /*!< TBEIE (Bit 7)                                         */
#define SPI1_CTL1_TBEIE_Msk               (0x80UL)                  /*!< TBEIE (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL1_RBNEIE_Pos              (6UL)                     /*!< RBNEIE (Bit 6)                                        */
#define SPI1_CTL1_RBNEIE_Msk              (0x40UL)                  /*!< RBNEIE (Bitfield-Mask: 0x01)                          */
#define SPI1_CTL1_ERRIE_Pos               (5UL)                     /*!< ERRIE (Bit 5)                                         */
#define SPI1_CTL1_ERRIE_Msk               (0x20UL)                  /*!< ERRIE (Bitfield-Mask: 0x01)                           */
#define SPI1_CTL1_TMOD_Pos                (4UL)                     /*!< TMOD (Bit 4)                                          */
#define SPI1_CTL1_TMOD_Msk                (0x10UL)                  /*!< TMOD (Bitfield-Mask: 0x01)                            */
#define SPI1_CTL1_NSSP_Pos                (3UL)                     /*!< NSSP (Bit 3)                                          */
#define SPI1_CTL1_NSSP_Msk                (0x8UL)                   /*!< NSSP (Bitfield-Mask: 0x01)                            */
#define SPI1_CTL1_NSSDRV_Pos              (2UL)                     /*!< NSSDRV (Bit 2)                                        */
#define SPI1_CTL1_NSSDRV_Msk              (0x4UL)                   /*!< NSSDRV (Bitfield-Mask: 0x01)                          */
#define SPI1_CTL1_DMATEN_Pos              (1UL)                     /*!< DMATEN (Bit 1)                                        */
#define SPI1_CTL1_DMATEN_Msk              (0x2UL)                   /*!< DMATEN (Bitfield-Mask: 0x01)                          */
#define SPI1_CTL1_DMAREN_Pos              (0UL)                     /*!< DMAREN (Bit 0)                                        */
#define SPI1_CTL1_DMAREN_Msk              (0x1UL)                   /*!< DMAREN (Bitfield-Mask: 0x01)                          */
/* =========================================================  STAT  ========================================================== */
#define SPI1_STAT_TXLVL_Pos               (11UL)                    /*!< TXLVL (Bit 11)                                        */
#define SPI1_STAT_TXLVL_Msk               (0x1800UL)                /*!< TXLVL (Bitfield-Mask: 0x03)                           */
#define SPI1_STAT_RXLVL_Pos               (9UL)                     /*!< RXLVL (Bit 9)                                         */
#define SPI1_STAT_RXLVL_Msk               (0x600UL)                 /*!< RXLVL (Bitfield-Mask: 0x03)                           */
#define SPI1_STAT_FERR_Pos                (8UL)                     /*!< FERR (Bit 8)                                          */
#define SPI1_STAT_FERR_Msk                (0x100UL)                 /*!< FERR (Bitfield-Mask: 0x01)                            */
#define SPI1_STAT_TRANS_Pos               (7UL)                     /*!< TRANS (Bit 7)                                         */
#define SPI1_STAT_TRANS_Msk               (0x80UL)                  /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define SPI1_STAT_RXORERR_Pos             (6UL)                     /*!< RXORERR (Bit 6)                                       */
#define SPI1_STAT_RXORERR_Msk             (0x40UL)                  /*!< RXORERR (Bitfield-Mask: 0x01)                         */
#define SPI1_STAT_CONFERR_Pos             (5UL)                     /*!< CONFERR (Bit 5)                                       */
#define SPI1_STAT_CONFERR_Msk             (0x20UL)                  /*!< CONFERR (Bitfield-Mask: 0x01)                         */
#define SPI1_STAT_CRCERR_Pos              (4UL)                     /*!< CRCERR (Bit 4)                                        */
#define SPI1_STAT_CRCERR_Msk              (0x10UL)                  /*!< CRCERR (Bitfield-Mask: 0x01)                          */
#define SPI1_STAT_TBE_Pos                 (1UL)                     /*!< TBE (Bit 1)                                           */
#define SPI1_STAT_TBE_Msk                 (0x2UL)                   /*!< TBE (Bitfield-Mask: 0x01)                             */
#define SPI1_STAT_RBNE_Pos                (0UL)                     /*!< RBNE (Bit 0)                                          */
#define SPI1_STAT_RBNE_Msk                (0x1UL)                   /*!< RBNE (Bitfield-Mask: 0x01)                            */
/* =========================================================  DATA  ========================================================== */
#define SPI1_DATA_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define SPI1_DATA_DATA_Msk                (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* ========================================================  CPCPOLY  ======================================================== */
#define SPI1_CPCPOLY_CRCPOLY_Pos          (0UL)                     /*!< CRCPOLY (Bit 0)                                       */
#define SPI1_CPCPOLY_CRCPOLY_Msk          (0xffffUL)                /*!< CRCPOLY (Bitfield-Mask: 0xffff)                       */
/* =========================================================  RCRC  ========================================================== */
#define SPI1_RCRC_RCRC_Pos                (0UL)                     /*!< RCRC (Bit 0)                                          */
#define SPI1_RCRC_RCRC_Msk                (0xffffUL)                /*!< RCRC (Bitfield-Mask: 0xffff)                          */
/* =========================================================  TCRC  ========================================================== */
#define SPI1_TCRC_TCRC_Pos                (0UL)                     /*!< TCRC (Bit 0)                                          */
#define SPI1_TCRC_TCRC_Msk                (0xffffUL)                /*!< TCRC (Bitfield-Mask: 0xffff)                          */
/* ========================================================  I2SCTL  ========================================================= */
#define SPI1_I2SCTL_I2SSEL_Pos            (11UL)                    /*!< I2SSEL (Bit 11)                                       */
#define SPI1_I2SCTL_I2SSEL_Msk            (0x800UL)                 /*!< I2SSEL (Bitfield-Mask: 0x01)                          */
#define SPI1_I2SCTL_I2SEN_Pos             (10UL)                    /*!< I2SEN (Bit 10)                                        */
#define SPI1_I2SCTL_I2SEN_Msk             (0x400UL)                 /*!< I2SEN (Bitfield-Mask: 0x01)                           */
#define SPI1_I2SCTL_I2SOPMOD_Pos          (8UL)                     /*!< I2SOPMOD (Bit 8)                                      */
#define SPI1_I2SCTL_I2SOPMOD_Msk          (0x300UL)                 /*!< I2SOPMOD (Bitfield-Mask: 0x03)                        */
#define SPI1_I2SCTL_PCMSMOD_Pos           (7UL)                     /*!< PCMSMOD (Bit 7)                                       */
#define SPI1_I2SCTL_PCMSMOD_Msk           (0x80UL)                  /*!< PCMSMOD (Bitfield-Mask: 0x01)                         */
#define SPI1_I2SCTL_I2SSTD_Pos            (4UL)                     /*!< I2SSTD (Bit 4)                                        */
#define SPI1_I2SCTL_I2SSTD_Msk            (0x30UL)                  /*!< I2SSTD (Bitfield-Mask: 0x03)                          */
#define SPI1_I2SCTL_CKPL_Pos              (3UL)                     /*!< CKPL (Bit 3)                                          */
#define SPI1_I2SCTL_CKPL_Msk              (0x8UL)                   /*!< CKPL (Bitfield-Mask: 0x01)                            */
#define SPI1_I2SCTL_DTLEN_Pos             (1UL)                     /*!< DTLEN (Bit 1)                                         */
#define SPI1_I2SCTL_DTLEN_Msk             (0x6UL)                   /*!< DTLEN (Bitfield-Mask: 0x03)                           */
#define SPI1_I2SCTL_CHLEN_Pos             (0UL)                     /*!< CHLEN (Bit 0)                                         */
#define SPI1_I2SCTL_CHLEN_Msk             (0x1UL)                   /*!< CHLEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  I2SPSC  ========================================================= */
#define SPI1_I2SPSC_MCKOEN_Pos            (9UL)                     /*!< MCKOEN (Bit 9)                                        */
#define SPI1_I2SPSC_MCKOEN_Msk            (0x200UL)                 /*!< MCKOEN (Bitfield-Mask: 0x01)                          */
#define SPI1_I2SPSC_OF_Pos                (8UL)                     /*!< OF (Bit 8)                                            */
#define SPI1_I2SPSC_OF_Msk                (0x100UL)                 /*!< OF (Bitfield-Mask: 0x01)                              */
#define SPI1_I2SPSC_DIV_Pos               (0UL)                     /*!< DIV (Bit 0)                                           */
#define SPI1_I2SPSC_DIV_Msk               (0xffUL)                  /*!< DIV (Bitfield-Mask: 0xff)                             */
/* =========================================================  QCTL  ========================================================== */
#define SPI1_QCTL_IO23_DRV_Pos            (2UL)                     /*!< IO23_DRV (Bit 2)                                      */
#define SPI1_QCTL_IO23_DRV_Msk            (0x4UL)                   /*!< IO23_DRV (Bitfield-Mask: 0x01)                        */
#define SPI1_QCTL_QRD_Pos                 (1UL)                     /*!< QRD (Bit 1)                                           */
#define SPI1_QCTL_QRD_Msk                 (0x2UL)                   /*!< QRD (Bitfield-Mask: 0x01)                             */
#define SPI1_QCTL_QMOD_Pos                (0UL)                     /*!< QMOD (Bit 0)                                          */
#define SPI1_QCTL_QMOD_Msk                (0x1UL)                   /*!< QMOD (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CFG0  ========================================================== */
#define SYSCFG_CFG0_PB9_HCCE_Pos          (19UL)                    /*!< PB9_HCCE (Bit 19)                                     */
#define SYSCFG_CFG0_PB9_HCCE_Msk          (0x80000UL)               /*!< PB9_HCCE (Bitfield-Mask: 0x01)                        */
#define SYSCFG_CFG0_TIMER16_DMA_RMP_Pos   (12UL)                    /*!< TIMER16_DMA_RMP (Bit 12)                              */
#define SYSCFG_CFG0_TIMER16_DMA_RMP_Msk   (0x1000UL)                /*!< TIMER16_DMA_RMP (Bitfield-Mask: 0x01)                 */
#define SYSCFG_CFG0_TIMER15_DMA_RMP_Pos   (11UL)                    /*!< TIMER15_DMA_RMP (Bit 11)                              */
#define SYSCFG_CFG0_TIMER15_DMA_RMP_Msk   (0x800UL)                 /*!< TIMER15_DMA_RMP (Bitfield-Mask: 0x01)                 */
#define SYSCFG_CFG0_USART0_RX_DMA_RMP_Pos (10UL)                    /*!< USART0_RX_DMA_RMP (Bit 10)                            */
#define SYSCFG_CFG0_USART0_RX_DMA_RMP_Msk (0x400UL)                 /*!< USART0_RX_DMA_RMP (Bitfield-Mask: 0x01)               */
#define SYSCFG_CFG0_USART0_TX_DMA_RMP_Pos (9UL)                     /*!< USART0_TX_DMA_RMP (Bit 9)                             */
#define SYSCFG_CFG0_USART0_TX_DMA_RMP_Msk (0x200UL)                 /*!< USART0_TX_DMA_RMP (Bitfield-Mask: 0x01)               */
#define SYSCFG_CFG0_ADC_DMA_RMP_Pos       (8UL)                     /*!< ADC_DMA_RMP (Bit 8)                                   */
#define SYSCFG_CFG0_ADC_DMA_RMP_Msk       (0x100UL)                 /*!< ADC_DMA_RMP (Bitfield-Mask: 0x01)                     */
#define SYSCFG_CFG0_PA11_PA12_RMP_Pos     (4UL)                     /*!< PA11_PA12_RMP (Bit 4)                                 */
#define SYSCFG_CFG0_PA11_PA12_RMP_Msk     (0x10UL)                  /*!< PA11_PA12_RMP (Bitfield-Mask: 0x01)                   */
#define SYSCFG_CFG0_BOOT_MODE_Pos         (0UL)                     /*!< BOOT_MODE (Bit 0)                                     */
#define SYSCFG_CFG0_BOOT_MODE_Msk         (0x3UL)                   /*!< BOOT_MODE (Bitfield-Mask: 0x03)                       */
/* ========================================================  EXTISS0  ======================================================== */
#define SYSCFG_EXTISS0_EXTI3_SS_Pos       (12UL)                    /*!< EXTI3_SS (Bit 12)                                     */
#define SYSCFG_EXTISS0_EXTI3_SS_Msk       (0xf000UL)                /*!< EXTI3_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI2_SS_Pos       (8UL)                     /*!< EXTI2_SS (Bit 8)                                      */
#define SYSCFG_EXTISS0_EXTI2_SS_Msk       (0xf00UL)                 /*!< EXTI2_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI1_SS_Pos       (4UL)                     /*!< EXTI1_SS (Bit 4)                                      */
#define SYSCFG_EXTISS0_EXTI1_SS_Msk       (0xf0UL)                  /*!< EXTI1_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS0_EXTI0_SS_Pos       (0UL)                     /*!< EXTI0_SS (Bit 0)                                      */
#define SYSCFG_EXTISS0_EXTI0_SS_Msk       (0xfUL)                   /*!< EXTI0_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS1  ======================================================== */
#define SYSCFG_EXTISS1_EXTI7_SS_Pos       (12UL)                    /*!< EXTI7_SS (Bit 12)                                     */
#define SYSCFG_EXTISS1_EXTI7_SS_Msk       (0xf000UL)                /*!< EXTI7_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI6_SS_Pos       (8UL)                     /*!< EXTI6_SS (Bit 8)                                      */
#define SYSCFG_EXTISS1_EXTI6_SS_Msk       (0xf00UL)                 /*!< EXTI6_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI5_SS_Pos       (4UL)                     /*!< EXTI5_SS (Bit 4)                                      */
#define SYSCFG_EXTISS1_EXTI5_SS_Msk       (0xf0UL)                  /*!< EXTI5_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS1_EXTI4_SS_Pos       (0UL)                     /*!< EXTI4_SS (Bit 0)                                      */
#define SYSCFG_EXTISS1_EXTI4_SS_Msk       (0xfUL)                   /*!< EXTI4_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS2  ======================================================== */
#define SYSCFG_EXTISS2_EXTI11_SS_Pos      (12UL)                    /*!< EXTI11_SS (Bit 12)                                    */
#define SYSCFG_EXTISS2_EXTI11_SS_Msk      (0xf000UL)                /*!< EXTI11_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS2_EXTI10_SS_Pos      (8UL)                     /*!< EXTI10_SS (Bit 8)                                     */
#define SYSCFG_EXTISS2_EXTI10_SS_Msk      (0xf00UL)                 /*!< EXTI10_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS2_EXTI9_SS_Pos       (4UL)                     /*!< EXTI9_SS (Bit 4)                                      */
#define SYSCFG_EXTISS2_EXTI9_SS_Msk       (0xf0UL)                  /*!< EXTI9_SS (Bitfield-Mask: 0x0f)                        */
#define SYSCFG_EXTISS2_EXTI8_SS_Pos       (0UL)                     /*!< EXTI8_SS (Bit 0)                                      */
#define SYSCFG_EXTISS2_EXTI8_SS_Msk       (0xfUL)                   /*!< EXTI8_SS (Bitfield-Mask: 0x0f)                        */
/* ========================================================  EXTISS3  ======================================================== */
#define SYSCFG_EXTISS3_EXTI15_SS_Pos      (12UL)                    /*!< EXTI15_SS (Bit 12)                                    */
#define SYSCFG_EXTISS3_EXTI15_SS_Msk      (0xf000UL)                /*!< EXTI15_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI14_SS_Pos      (8UL)                     /*!< EXTI14_SS (Bit 8)                                     */
#define SYSCFG_EXTISS3_EXTI14_SS_Msk      (0xf00UL)                 /*!< EXTI14_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI13_SS_Pos      (4UL)                     /*!< EXTI13_SS (Bit 4)                                     */
#define SYSCFG_EXTISS3_EXTI13_SS_Msk      (0xf0UL)                  /*!< EXTI13_SS (Bitfield-Mask: 0x0f)                       */
#define SYSCFG_EXTISS3_EXTI12_SS_Pos      (0UL)                     /*!< EXTI12_SS (Bit 0)                                     */
#define SYSCFG_EXTISS3_EXTI12_SS_Msk      (0xfUL)                   /*!< EXTI12_SS (Bitfield-Mask: 0x0f)                       */
/* =========================================================  CFG2  ========================================================== */
#define SYSCFG_CFG2_SRAM_PCEF_Pos         (8UL)                     /*!< SRAM_PCEF (Bit 8)                                     */
#define SYSCFG_CFG2_SRAM_PCEF_Msk         (0x100UL)                 /*!< SRAM_PCEF (Bitfield-Mask: 0x01)                       */
#define SYSCFG_CFG2_LVD_LOCK_Pos          (2UL)                     /*!< LVD_LOCK (Bit 2)                                      */
#define SYSCFG_CFG2_LVD_LOCK_Msk          (0x4UL)                   /*!< LVD_LOCK (Bitfield-Mask: 0x01)                        */
#define SYSCFG_CFG2_SRAM_PARITY_ERROR_LOCK_Pos (1UL)                /*!< SRAM_PARITY_ERROR_LOCK (Bit 1)                        */
#define SYSCFG_CFG2_SRAM_PARITY_ERROR_LOCK_Msk (0x2UL)              /*!< SRAM_PARITY_ERROR_LOCK (Bitfield-Mask: 0x01)          */
#define SYSCFG_CFG2_LOCKUP_LOCK_Pos       (0UL)                     /*!< LOCKUP_LOCK (Bit 0)                                   */
#define SYSCFG_CFG2_LOCKUP_LOCK_Msk       (0x1UL)                   /*!< LOCKUP_LOCK (Bitfield-Mask: 0x01)                     */
/* ======================================================  CPU_IRQ_LAT  ====================================================== */
#define SYSCFG_CPU_IRQ_LAT_IRQ_LATENCY_Pos (0UL)                    /*!< IRQ_LATENCY (Bit 0)                                   */
#define SYSCFG_CPU_IRQ_LAT_IRQ_LATENCY_Msk (0xffUL)                 /*!< IRQ_LATENCY (Bitfield-Mask: 0xff)                     */


