RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define TIMER0_CHCTL1_Output_CH2COMSEN_Pos (3UL)                    /*!< CH2COMSEN (Bit 3)                                     */
#define TIMER0_CHCTL1_Output_CH2COMSEN_Msk (0x8UL)                  /*!< CH2COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH2COMFEN_Pos (2UL)                    /*!< CH2COMFEN (Bit 2)                                     */
#define TIMER0_CHCTL1_Output_CH2COMFEN_Msk (0x4UL)                  /*!< CH2COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER0_CHCTL1_Output_CH2MS_Pos    (0UL)                     /*!< CH2MS (Bit 0)                                         */
#define TIMER0_CHCTL1_Output_CH2MS_Msk    (0x3UL)                   /*!< CH2MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL1_Input  ====================================================== */
#define TIMER0_CHCTL1_Input_CH3CAPFLT_Pos (12UL)                    /*!< CH3CAPFLT (Bit 12)                                    */
#define TIMER0_CHCTL1_Input_CH3CAPFLT_Msk (0xf000UL)                /*!< CH3CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER0_CHCTL1_Input_CH3CAPPSC_Pos (10UL)                    /*!< CH3CAPPSC (Bit 10)                                    */
#define TIMER0_CHCTL1_Input_CH3CAPPSC_Msk (0xc00UL)                 /*!< CH3CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER0_CHCTL1_Input_CH3MS_Pos     (8UL)                     /*!< CH3MS (Bit 8)                                         */
#define TIMER0_CHCTL1_Input_CH3MS_Msk     (0x300UL)                 /*!< CH3MS (Bitfield-Mask: 0x03)                           */
#define TIMER0_CHCTL1_Input_CH2CAPFLT_Pos (4UL)                     /*!< CH2CAPFLT (Bit 4)                                     */
#define TIMER0_CHCTL1_Input_CH2CAPFLT_Msk (0xf0UL)                  /*!< CH2CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER0_CHCTL1_Input_CH2CAPPSC_Pos (2UL)                     /*!< CH2CAPPSC (Bit 2)                                     */
#define TIMER0_CHCTL1_Input_CH2CAPPSC_Msk (0xcUL)                   /*!< CH2CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER0_CHCTL1_Input_CH2MS_Pos     (0UL)                     /*!< CH2MS (Bit 0)                                         */
#define TIMER0_CHCTL1_Input_CH2MS_Msk     (0x3UL)                   /*!< CH2MS (Bitfield-Mask: 0x03)                           */
/* ========================================================  CHCTL2  ========================================================= */
#define TIMER0_CHCTL2_CH3P_Pos            (13UL)                    /*!< CH3P (Bit 13)                                         */
#define TIMER0_CHCTL2_CH3P_Msk            (0x2000UL)                /*!< CH3P (Bitfield-Mask: 0x01)                            */
#define TIMER0_CHCTL2_CH3EN_Pos           (12UL)                    /*!< CH3EN (Bit 12)                                        */
#define TIMER0_CHCTL2_CH3EN_Msk           (0x1000UL)                /*!< CH3EN (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH2NP_Pos           (11UL)                    /*!< CH2NP (Bit 11)                                        */
#define TIMER0_CHCTL2_CH2NP_Msk           (0x800UL)                 /*!< CH2NP (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH2NEN_Pos          (10UL)                    /*!< CH2NEN (Bit 10)                                       */
#define TIMER0_CHCTL2_CH2NEN_Msk          (0x400UL)                 /*!< CH2NEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_CHCTL2_CH2P_Pos            (9UL)                     /*!< CH2P (Bit 9)                                          */
#define TIMER0_CHCTL2_CH2P_Msk            (0x200UL)                 /*!< CH2P (Bitfield-Mask: 0x01)                            */
#define TIMER0_CHCTL2_CH2EN_Pos           (8UL)                     /*!< CH2EN (Bit 8)                                         */
#define TIMER0_CHCTL2_CH2EN_Msk           (0x100UL)                 /*!< CH2EN (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH1NP_Pos           (7UL)                     /*!< CH1NP (Bit 7)                                         */
#define TIMER0_CHCTL2_CH1NP_Msk           (0x80UL)                  /*!< CH1NP (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH1NEN_Pos          (6UL)                     /*!< CH1NEN (Bit 6)                                        */
#define TIMER0_CHCTL2_CH1NEN_Msk          (0x40UL)                  /*!< CH1NEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_CHCTL2_CH1P_Pos            (5UL)                     /*!< CH1P (Bit 5)                                          */
#define TIMER0_CHCTL2_CH1P_Msk            (0x20UL)                  /*!< CH1P (Bitfield-Mask: 0x01)                            */
#define TIMER0_CHCTL2_CH1EN_Pos           (4UL)                     /*!< CH1EN (Bit 4)                                         */
#define TIMER0_CHCTL2_CH1EN_Msk           (0x10UL)                  /*!< CH1EN (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH0NP_Pos           (3UL)                     /*!< CH0NP (Bit 3)                                         */
#define TIMER0_CHCTL2_CH0NP_Msk           (0x8UL)                   /*!< CH0NP (Bitfield-Mask: 0x01)                           */
#define TIMER0_CHCTL2_CH0NEN_Pos          (2UL)                     /*!< CH0NEN (Bit 2)                                        */
#define TIMER0_CHCTL2_CH0NEN_Msk          (0x4UL)                   /*!< CH0NEN (Bitfield-Mask: 0x01)                          */
#define TIMER0_CHCTL2_CH0P_Pos            (1UL)                     /*!< CH0P (Bit 1)                                          */
#define TIMER0_CHCTL2_CH0P_Msk            (0x2UL)                   /*!< CH0P (Bitfield-Mask: 0x01)                            */
#define TIMER0_CHCTL2_CH0EN_Pos           (0UL)                     /*!< CH0EN (Bit 0)                                         */
#define TIMER0_CHCTL2_CH0EN_Msk           (0x1UL)                   /*!< CH0EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CNT  ========================================================== */
#define TIMER0_CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER0_CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER0_PSC_PSC_Pos                (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER0_PSC_PSC_Msk                (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER0_CAR_CARL_Pos               (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER0_CAR_CARL_Msk               (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CREP  ========================================================== */
#define TIMER0_CREP_CREP_Pos              (0UL)                     /*!< CREP (Bit 0)                                          */
#define TIMER0_CREP_CREP_Msk              (0xffUL)                  /*!< CREP (Bitfield-Mask: 0xff)                            */
/* =========================================================  CH0CV  ========================================================= */
#define TIMER0_CH0CV_CH0VAL_Pos           (0UL)                     /*!< CH0VAL (Bit 0)                                        */
#define TIMER0_CH0CV_CH0VAL_Msk           (0xffffUL)                /*!< CH0VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH1CV  ========================================================= */
#define TIMER0_CH1CV_CH1VAL_Pos           (0UL)                     /*!< CH1VAL (Bit 0)                                        */
#define TIMER0_CH1CV_CH1VAL_Msk           (0xffffUL)                /*!< CH1VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH2CV  ========================================================= */
#define TIMER0_CH2CV_CH2VAL_Pos           (0UL)                     /*!< CH2VAL (Bit 0)                                        */
#define TIMER0_CH2CV_CH2VAL_Msk           (0xffffUL)                /*!< CH2VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH3CV  ========================================================= */
#define TIMER0_CH3CV_CH3VAL_Pos           (0UL)                     /*!< CH3VAL (Bit 0)                                        */
#define TIMER0_CH3CV_CH3VAL_Msk           (0xffffUL)                /*!< CH3VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CCHP  ========================================================== */
#define TIMER0_CCHP_POEN_Pos              (15UL)                    /*!< POEN (Bit 15)                                         */
#define TIMER0_CCHP_POEN_Msk              (0x8000UL)                /*!< POEN (Bitfield-Mask: 0x01)                            */
#define TIMER0_CCHP_OAEN_Pos              (14UL)                    /*!< OAEN (Bit 14)                                         */
#define TIMER0_CCHP_OAEN_Msk              (0x4000UL)                /*!< OAEN (Bitfield-Mask: 0x01)                            */
#define TIMER0_CCHP_BRKP_Pos              (13UL)                    /*!< BRKP (Bit 13)                                         */
#define TIMER0_CCHP_BRKP_Msk              (0x2000UL)                /*!< BRKP (Bitfield-Mask: 0x01)                            */
#define TIMER0_CCHP_BRKEN_Pos             (12UL)                    /*!< BRKEN (Bit 12)                                        */
#define TIMER0_CCHP_BRKEN_Msk             (0x1000UL)                /*!< BRKEN (Bitfield-Mask: 0x01)                           */
#define TIMER0_CCHP_ROS_Pos               (11UL)                    /*!< ROS (Bit 11)                                          */
#define TIMER0_CCHP_ROS_Msk               (0x800UL)                 /*!< ROS (Bitfield-Mask: 0x01)                             */
#define TIMER0_CCHP_IOS_Pos               (10UL)                    /*!< IOS (Bit 10)                                          */
#define TIMER0_CCHP_IOS_Msk               (0x400UL)                 /*!< IOS (Bitfield-Mask: 0x01)                             */
#define TIMER0_CCHP_PROT_Pos              (8UL)                     /*!< PROT (Bit 8)                                          */
#define TIMER0_CCHP_PROT_Msk              (0x300UL)                 /*!< PROT (Bitfield-Mask: 0x03)                            */
#define TIMER0_CCHP_DTCFG_Pos             (0UL)                     /*!< DTCFG (Bit 0)                                         */
#define TIMER0_CCHP_DTCFG_Msk             (0xffUL)                  /*!< DTCFG (Bitfield-Mask: 0xff)                           */
/* ========================================================  DMACFG  ========================================================= */
#define TIMER0_DMACFG_DMATC_Pos           (8UL)                     /*!< DMATC (Bit 8)                                         */
#define TIMER0_DMACFG_DMATC_Msk           (0x1f00UL)                /*!< DMATC (Bitfield-Mask: 0x1f)                           */
#define TIMER0_DMACFG_DMATA_Pos           (0UL)                     /*!< DMATA (Bit 0)                                         */
#define TIMER0_DMACFG_DMATA_Msk           (0x1fUL)                  /*!< DMATA (Bitfield-Mask: 0x1f)                           */
/* =========================================================  DMATB  ========================================================= */
#define TIMER0_DMATB_DMATB_Pos            (0UL)                     /*!< DMATB (Bit 0)                                         */
#define TIMER0_DMATB_DMATB_Msk            (0xffffUL)                /*!< DMATB (Bitfield-Mask: 0xffff)                         */
/* ==========================================================  CFG  ========================================================== */
#define TIMER0_CFG_CHVSEL_Pos             (1UL)                     /*!< CHVSEL (Bit 1)                                        */
#define TIMER0_CFG_CHVSEL_Msk             (0x2UL)                   /*!< CHVSEL (Bitfield-Mask: 0x01)                          */
#define TIMER0_CFG_OUTSEL_Pos             (0UL)                     /*!< OUTSEL (Bit 0)                                        */
#define TIMER0_CFG_OUTSEL_Msk             (0x1UL)                   /*!< OUTSEL (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */

