RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  CTL0  ========================================================== */
#define TIMER2_CTL0_CKDIV_Pos             (8UL)                     /*!< CKDIV (Bit 8)                                         */
#define TIMER2_CTL0_CKDIV_Msk             (0x300UL)                 /*!< CKDIV (Bitfield-Mask: 0x03)                           */
#define TIMER2_CTL0_ARSE_Pos              (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER2_CTL0_ARSE_Msk              (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER2_CTL0_CAM_Pos               (5UL)                     /*!< CAM (Bit 5)                                           */
#define TIMER2_CTL0_CAM_Msk               (0x60UL)                  /*!< CAM (Bitfield-Mask: 0x03)                             */
#define TIMER2_CTL0_DIR_Pos               (4UL)                     /*!< DIR (Bit 4)                                           */
#define TIMER2_CTL0_DIR_Msk               (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define TIMER2_CTL0_SPM_Pos               (3UL)                     /*!< SPM (Bit 3)                                           */
#define TIMER2_CTL0_SPM_Msk               (0x8UL)                   /*!< SPM (Bitfield-Mask: 0x01)                             */
#define TIMER2_CTL0_UPS_Pos               (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER2_CTL0_UPS_Msk               (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER2_CTL0_UPDIS_Pos             (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER2_CTL0_UPDIS_Msk             (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER2_CTL0_CEN_Pos               (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER2_CTL0_CEN_Msk               (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define TIMER2_CTL1_TI0S_Pos              (7UL)                     /*!< TI0S (Bit 7)                                          */
#define TIMER2_CTL1_TI0S_Msk              (0x80UL)                  /*!< TI0S (Bitfield-Mask: 0x01)                            */
#define TIMER2_CTL1_MMC_Pos               (4UL)                     /*!< MMC (Bit 4)                                           */
#define TIMER2_CTL1_MMC_Msk               (0x70UL)                  /*!< MMC (Bitfield-Mask: 0x07)                             */
#define TIMER2_CTL1_DMAS_Pos              (3UL)                     /*!< DMAS (Bit 3)                                          */
#define TIMER2_CTL1_DMAS_Msk              (0x8UL)                   /*!< DMAS (Bitfield-Mask: 0x01)                            */
/* =========================================================  SMCFG  ========================================================= */
#define TIMER2_SMCFG_ETP_Pos              (15UL)                    /*!< ETP (Bit 15)                                          */
#define TIMER2_SMCFG_ETP_Msk              (0x8000UL)                /*!< ETP (Bitfield-Mask: 0x01)                             */
#define TIMER2_SMCFG_SMC1_Pos             (14UL)                    /*!< SMC1 (Bit 14)                                         */
#define TIMER2_SMCFG_SMC1_Msk             (0x4000UL)                /*!< SMC1 (Bitfield-Mask: 0x01)                            */
#define TIMER2_SMCFG_ETPSC_Pos            (12UL)                    /*!< ETPSC (Bit 12)                                        */
#define TIMER2_SMCFG_ETPSC_Msk            (0x3000UL)                /*!< ETPSC (Bitfield-Mask: 0x03)                           */
#define TIMER2_SMCFG_ETFC_Pos             (8UL)                     /*!< ETFC (Bit 8)                                          */
#define TIMER2_SMCFG_ETFC_Msk             (0xf00UL)                 /*!< ETFC (Bitfield-Mask: 0x0f)                            */
#define TIMER2_SMCFG_MSM_Pos              (7UL)                     /*!< MSM (Bit 7)                                           */
#define TIMER2_SMCFG_MSM_Msk              (0x80UL)                  /*!< MSM (Bitfield-Mask: 0x01)                             */
#define TIMER2_SMCFG_TRGS_Pos             (4UL)                     /*!< TRGS (Bit 4)                                          */
#define TIMER2_SMCFG_TRGS_Msk             (0x70UL)                  /*!< TRGS (Bitfield-Mask: 0x07)                            */
#define TIMER2_SMCFG_OCRC_Pos             (3UL)                     /*!< OCRC (Bit 3)                                          */
#define TIMER2_SMCFG_OCRC_Msk             (0x8UL)                   /*!< OCRC (Bitfield-Mask: 0x01)                            */
#define TIMER2_SMCFG_SMC_Pos              (0UL)                     /*!< SMC (Bit 0)                                           */
#define TIMER2_SMCFG_SMC_Msk              (0x7UL)                   /*!< SMC (Bitfield-Mask: 0x07)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER2_DMAINTEN_TRGDEN_Pos        (14UL)                    /*!< TRGDEN (Bit 14)                                       */
#define TIMER2_DMAINTEN_TRGDEN_Msk        (0x4000UL)                /*!< TRGDEN (Bitfield-Mask: 0x01)                          */
#define TIMER2_DMAINTEN_CH3DEN_Pos        (12UL)                    /*!< CH3DEN (Bit 12)                                       */
#define TIMER2_DMAINTEN_CH3DEN_Msk        (0x1000UL)                /*!< CH3DEN (Bitfield-Mask: 0x01)                          */
#define TIMER2_DMAINTEN_CH2DEN_Pos        (11UL)                    /*!< CH2DEN (Bit 11)                                       */
#define TIMER2_DMAINTEN_CH2DEN_Msk        (0x800UL)                 /*!< CH2DEN (Bitfield-Mask: 0x01)                          */
#define TIMER2_DMAINTEN_CH1DEN_Pos        (10UL)                    /*!< CH1DEN (Bit 10)                                       */
#define TIMER2_DMAINTEN_CH1DEN_Msk        (0x400UL)                 /*!< CH1DEN (Bitfield-Mask: 0x01)                          */
#define TIMER2_DMAINTEN_CH0DEN_Pos        (9UL)                     /*!< CH0DEN (Bit 9)                                        */
#define TIMER2_DMAINTEN_CH0DEN_Msk        (0x200UL)                 /*!< CH0DEN (Bitfield-Mask: 0x01)                          */
#define TIMER2_DMAINTEN_UPDEN_Pos         (8UL)                     /*!< UPDEN (Bit 8)                                         */
#define TIMER2_DMAINTEN_UPDEN_Msk         (0x100UL)                 /*!< UPDEN (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_TRGIE_Pos         (6UL)                     /*!< TRGIE (Bit 6)                                         */
#define TIMER2_DMAINTEN_TRGIE_Msk         (0x40UL)                  /*!< TRGIE (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_CH3IE_Pos         (4UL)                     /*!< CH3IE (Bit 4)                                         */
#define TIMER2_DMAINTEN_CH3IE_Msk         (0x10UL)                  /*!< CH3IE (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_CH2IE_Pos         (3UL)                     /*!< CH2IE (Bit 3)                                         */
#define TIMER2_DMAINTEN_CH2IE_Msk         (0x8UL)                   /*!< CH2IE (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_CH1IE_Pos         (2UL)                     /*!< CH1IE (Bit 2)                                         */
#define TIMER2_DMAINTEN_CH1IE_Msk         (0x4UL)                   /*!< CH1IE (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_CH0IE_Pos         (1UL)                     /*!< CH0IE (Bit 1)                                         */
#define TIMER2_DMAINTEN_CH0IE_Msk         (0x2UL)                   /*!< CH0IE (Bitfield-Mask: 0x01)                           */
#define TIMER2_DMAINTEN_UPIE_Pos          (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER2_DMAINTEN_UPIE_Msk          (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER2_INTF_CH3OF_Pos             (12UL)                    /*!< CH3OF (Bit 12)                                        */
#define TIMER2_INTF_CH3OF_Msk             (0x1000UL)                /*!< CH3OF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH2OF_Pos             (11UL)                    /*!< CH2OF (Bit 11)                                        */
#define TIMER2_INTF_CH2OF_Msk             (0x800UL)                 /*!< CH2OF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH1OF_Pos             (10UL)                    /*!< CH1OF (Bit 10)                                        */
#define TIMER2_INTF_CH1OF_Msk             (0x400UL)                 /*!< CH1OF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH0OF_Pos             (9UL)                     /*!< CH0OF (Bit 9)                                         */
#define TIMER2_INTF_CH0OF_Msk             (0x200UL)                 /*!< CH0OF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_TRGIF_Pos             (6UL)                     /*!< TRGIF (Bit 6)                                         */
#define TIMER2_INTF_TRGIF_Msk             (0x40UL)                  /*!< TRGIF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH3IF_Pos             (4UL)                     /*!< CH3IF (Bit 4)                                         */
#define TIMER2_INTF_CH3IF_Msk             (0x10UL)                  /*!< CH3IF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH2IF_Pos             (3UL)                     /*!< CH2IF (Bit 3)                                         */
#define TIMER2_INTF_CH2IF_Msk             (0x8UL)                   /*!< CH2IF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH1IF_Pos             (2UL)                     /*!< CH1IF (Bit 2)                                         */
#define TIMER2_INTF_CH1IF_Msk             (0x4UL)                   /*!< CH1IF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_CH0IF_Pos             (1UL)                     /*!< CH0IF (Bit 1)                                         */
#define TIMER2_INTF_CH0IF_Msk             (0x2UL)                   /*!< CH0IF (Bitfield-Mask: 0x01)                           */
#define TIMER2_INTF_UPIF_Pos              (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER2_INTF_UPIF_Msk              (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER2_SWEVG_TRGG_Pos             (6UL)                     /*!< TRGG (Bit 6)                                          */
#define TIMER2_SWEVG_TRGG_Msk             (0x40UL)                  /*!< TRGG (Bitfield-Mask: 0x01)                            */
#define TIMER2_SWEVG_CH3G_Pos             (4UL)                     /*!< CH3G (Bit 4)                                          */
#define TIMER2_SWEVG_CH3G_Msk             (0x10UL)                  /*!< CH3G (Bitfield-Mask: 0x01)                            */
#define TIMER2_SWEVG_CH2G_Pos             (3UL)                     /*!< CH2G (Bit 3)                                          */
#define TIMER2_SWEVG_CH2G_Msk             (0x8UL)                   /*!< CH2G (Bitfield-Mask: 0x01)                            */
#define TIMER2_SWEVG_CH1G_Pos             (2UL)                     /*!< CH1G (Bit 2)                                          */
#define TIMER2_SWEVG_CH1G_Msk             (0x4UL)                   /*!< CH1G (Bitfield-Mask: 0x01)                            */
#define TIMER2_SWEVG_CH0G_Pos             (1UL)                     /*!< CH0G (Bit 1)                                          */
#define TIMER2_SWEVG_CH0G_Msk             (0x2UL)                   /*!< CH0G (Bitfield-Mask: 0x01)                            */
#define TIMER2_SWEVG_UPG_Pos              (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER2_SWEVG_UPG_Msk              (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* =====================================================  CHCTL0_Output  ===================================================== */
#define TIMER2_CHCTL0_Output_CH1COMCEN_Pos (15UL)                   /*!< CH1COMCEN (Bit 15)                                    */
#define TIMER2_CHCTL0_Output_CH1COMCEN_Msk (0x8000UL)               /*!< CH1COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH1COMCTL_Pos (12UL)                   /*!< CH1COMCTL (Bit 12)                                    */
#define TIMER2_CHCTL0_Output_CH1COMCTL_Msk (0x7000UL)               /*!< CH1COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER2_CHCTL0_Output_CH1COMSEN_Pos (11UL)                   /*!< CH1COMSEN (Bit 11)                                    */
#define TIMER2_CHCTL0_Output_CH1COMSEN_Msk (0x800UL)                /*!< CH1COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH1COMFEN_Pos (10UL)                   /*!< CH1COMFEN (Bit 10)                                    */
#define TIMER2_CHCTL0_Output_CH1COMFEN_Msk (0x400UL)                /*!< CH1COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH1MS_Pos    (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER2_CHCTL0_Output_CH1MS_Msk    (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER2_CHCTL0_Output_CH0COMCEN_Pos (7UL)                    /*!< CH0COMCEN (Bit 7)                                     */
#define TIMER2_CHCTL0_Output_CH0COMCEN_Msk (0x80UL)                 /*!< CH0COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH0COMCTL_Pos (4UL)                    /*!< CH0COMCTL (Bit 4)                                     */
#define TIMER2_CHCTL0_Output_CH0COMCTL_Msk (0x70UL)                 /*!< CH0COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER2_CHCTL0_Output_CH0COMSEN_Pos (3UL)                    /*!< CH0COMSEN (Bit 3)                                     */
#define TIMER2_CHCTL0_Output_CH0COMSEN_Msk (0x8UL)                  /*!< CH0COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH0COMFEN_Pos (2UL)                    /*!< CH0COMFEN (Bit 2)                                     */
#define TIMER2_CHCTL0_Output_CH0COMFEN_Msk (0x4UL)                  /*!< CH0COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL0_Output_CH0MS_Pos    (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER2_CHCTL0_Output_CH0MS_Msk    (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL0_Input  ====================================================== */
#define TIMER2_CHCTL0_Input_CH1CAPFLT_Pos (12UL)                    /*!< CH1CAPFLT (Bit 12)                                    */
#define TIMER2_CHCTL0_Input_CH1CAPFLT_Msk (0xf000UL)                /*!< CH1CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER2_CHCTL0_Input_CH1CAPPSC_Pos (10UL)                    /*!< CH1CAPPSC (Bit 10)                                    */
#define TIMER2_CHCTL0_Input_CH1CAPPSC_Msk (0xc00UL)                 /*!< CH1CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER2_CHCTL0_Input_CH1MS_Pos     (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER2_CHCTL0_Input_CH1MS_Msk     (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER2_CHCTL0_Input_CH0CAPFLT_Pos (4UL)                     /*!< CH0CAPFLT (Bit 4)                                     */
#define TIMER2_CHCTL0_Input_CH0CAPFLT_Msk (0xf0UL)                  /*!< CH0CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER2_CHCTL0_Input_CH0CAPPSC_Pos (2UL)                     /*!< CH0CAPPSC (Bit 2)                                     */
#define TIMER2_CHCTL0_Input_CH0CAPPSC_Msk (0xcUL)                   /*!< CH0CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER2_CHCTL0_Input_CH0MS_Pos     (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER2_CHCTL0_Input_CH0MS_Msk     (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL1_Output  ===================================================== */
#define TIMER2_CHCTL1_Output_CH3COMCEN_Pos (15UL)                   /*!< CH3COMCEN (Bit 15)                                    */
#define TIMER2_CHCTL1_Output_CH3COMCEN_Msk (0x8000UL)               /*!< CH3COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH3COMCTL_Pos (12UL)                   /*!< CH3COMCTL (Bit 12)                                    */
#define TIMER2_CHCTL1_Output_CH3COMCTL_Msk (0x7000UL)               /*!< CH3COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER2_CHCTL1_Output_CH3COMSEN_Pos (11UL)                   /*!< CH3COMSEN (Bit 11)                                    */
#define TIMER2_CHCTL1_Output_CH3COMSEN_Msk (0x800UL)                /*!< CH3COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH3COMFEN_Pos (10UL)                   /*!< CH3COMFEN (Bit 10)                                    */
#define TIMER2_CHCTL1_Output_CH3COMFEN_Msk (0x400UL)                /*!< CH3COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH3MS_Pos    (8UL)                     /*!< CH3MS (Bit 8)                                         */
#define TIMER2_CHCTL1_Output_CH3MS_Msk    (0x300UL)                 /*!< CH3MS (Bitfield-Mask: 0x03)                           */
#define TIMER2_CHCTL1_Output_CH2COMCEN_Pos (7UL)                    /*!< CH2COMCEN (Bit 7)                                     */
#define TIMER2_CHCTL1_Output_CH2COMCEN_Msk (0x80UL)                 /*!< CH2COMCEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH2COMCTL_Pos (4UL)                    /*!< CH2COMCTL (Bit 4)                                     */
#define TIMER2_CHCTL1_Output_CH2COMCTL_Msk (0x70UL)                 /*!< CH2COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER2_CHCTL1_Output_CH2COMSEN_Pos (3UL)                    /*!< CH2COMSEN (Bit 3)                                     */
#define TIMER2_CHCTL1_Output_CH2COMSEN_Msk (0x8UL)                  /*!< CH2COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH2COMFEN_Pos (2UL)                    /*!< CH2COMFEN (Bit 2)                                     */
#define TIMER2_CHCTL1_Output_CH2COMFEN_Msk (0x4UL)                  /*!< CH2COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER2_CHCTL1_Output_CH2MS_Pos    (0UL)                     /*!< CH2MS (Bit 0)                                         */
#define TIMER2_CHCTL1_Output_CH2MS_Msk    (0x3UL)                   /*!< CH2MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL1_Input  ====================================================== */
#define TIMER2_CHCTL1_Input_CH3CAPFLT_Pos (12UL)                    /*!< CH3CAPFLT (Bit 12)                                    */
#define TIMER2_CHCTL1_Input_CH3CAPFLT_Msk (0xf000UL)                /*!< CH3CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER2_CHCTL1_Input_CH3CAPPSC_Pos (10UL)                    /*!< CH3CAPPSC (Bit 10)                                    */
#define TIMER2_CHCTL1_Input_CH3CAPPSC_Msk (0xc00UL)                 /*!< CH3CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER2_CHCTL1_Input_CH3MS_Pos     (8UL)                     /*!< CH3MS (Bit 8)                                         */
#define TIMER2_CHCTL1_Input_CH3MS_Msk     (0x300UL)                 /*!< CH3MS (Bitfield-Mask: 0x03)                           */
#define TIMER2_CHCTL1_Input_CH2CAPFLT_Pos (4UL)                     /*!< CH2CAPFLT (Bit 4)                                     */
#define TIMER2_CHCTL1_Input_CH2CAPFLT_Msk (0xf0UL)                  /*!< CH2CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER2_CHCTL1_Input_CH2CAPPSC_Pos (2UL)                     /*!< CH2CAPPSC (Bit 2)                                     */
#define TIMER2_CHCTL1_Input_CH2CAPPSC_Msk (0xcUL)                   /*!< CH2CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER2_CHCTL1_Input_CH2MS_Pos     (0UL)                     /*!< CH2MS (Bit 0)                                         */
#define TIMER2_CHCTL1_Input_CH2MS_Msk     (0x3UL)                   /*!< CH2MS (Bitfield-Mask: 0x03)                           */
/* ========================================================  CHCTL2  ========================================================= */
#define TIMER2_CHCTL2_CH3NP_Pos           (15UL)                    /*!< CH3NP (Bit 15)                                        */
#define TIMER2_CHCTL2_CH3NP_Msk           (0x8000UL)                /*!< CH3NP (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH3P_Pos            (13UL)                    /*!< CH3P (Bit 13)                                         */
#define TIMER2_CHCTL2_CH3P_Msk            (0x2000UL)                /*!< CH3P (Bitfield-Mask: 0x01)                            */
#define TIMER2_CHCTL2_CH3EN_Pos           (12UL)                    /*!< CH3EN (Bit 12)                                        */
#define TIMER2_CHCTL2_CH3EN_Msk           (0x1000UL)                /*!< CH3EN (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH2NP_Pos           (11UL)                    /*!< CH2NP (Bit 11)                                        */
#define TIMER2_CHCTL2_CH2NP_Msk           (0x800UL)                 /*!< CH2NP (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH2P_Pos            (9UL)                     /*!< CH2P (Bit 9)                                          */
#define TIMER2_CHCTL2_CH2P_Msk            (0x200UL)                 /*!< CH2P (Bitfield-Mask: 0x01)                            */
#define TIMER2_CHCTL2_CH2EN_Pos           (8UL)                     /*!< CH2EN (Bit 8)                                         */
#define TIMER2_CHCTL2_CH2EN_Msk           (0x100UL)                 /*!< CH2EN (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH1NP_Pos           (7UL)                     /*!< CH1NP (Bit 7)                                         */
#define TIMER2_CHCTL2_CH1NP_Msk           (0x80UL)                  /*!< CH1NP (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH1P_Pos            (5UL)                     /*!< CH1P (Bit 5)                                          */
