RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define TIMER2_CHCTL2_CH1P_Msk            (0x20UL)                  /*!< CH1P (Bitfield-Mask: 0x01)                            */
#define TIMER2_CHCTL2_CH1EN_Pos           (4UL)                     /*!< CH1EN (Bit 4)                                         */
#define TIMER2_CHCTL2_CH1EN_Msk           (0x10UL)                  /*!< CH1EN (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH0NP_Pos           (3UL)                     /*!< CH0NP (Bit 3)                                         */
#define TIMER2_CHCTL2_CH0NP_Msk           (0x8UL)                   /*!< CH0NP (Bitfield-Mask: 0x01)                           */
#define TIMER2_CHCTL2_CH0P_Pos            (1UL)                     /*!< CH0P (Bit 1)                                          */
#define TIMER2_CHCTL2_CH0P_Msk            (0x2UL)                   /*!< CH0P (Bitfield-Mask: 0x01)                            */
#define TIMER2_CHCTL2_CH0EN_Pos           (0UL)                     /*!< CH0EN (Bit 0)                                         */
#define TIMER2_CHCTL2_CH0EN_Msk           (0x1UL)                   /*!< CH0EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CNT  ========================================================== */
#define TIMER2_CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER2_CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER2_PSC_PSC_Pos                (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER2_PSC_PSC_Msk                (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER2_CAR_CARL_Pos               (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER2_CAR_CARL_Msk               (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CH0CV  ========================================================= */
#define TIMER2_CH0CV_CH0VAL_Pos           (0UL)                     /*!< CH0VAL (Bit 0)                                        */
#define TIMER2_CH0CV_CH0VAL_Msk           (0xffffUL)                /*!< CH0VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH1CV  ========================================================= */
#define TIMER2_CH1CV_CH1VAL_Pos           (0UL)                     /*!< CH1VAL (Bit 0)                                        */
#define TIMER2_CH1CV_CH1VAL_Msk           (0xffffUL)                /*!< CH1VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH2CV  ========================================================= */
#define TIMER2_CH2CV_CH2VAL_Pos           (0UL)                     /*!< CH2VAL (Bit 0)                                        */
#define TIMER2_CH2CV_CH2VAL_Msk           (0xffffUL)                /*!< CH2VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH3CV  ========================================================= */
#define TIMER2_CH3CV_CH3VAL_Pos           (0UL)                     /*!< CH3VAL (Bit 0)                                        */
#define TIMER2_CH3CV_CH3VAL_Msk           (0xffffUL)                /*!< CH3VAL (Bitfield-Mask: 0xffff)                        */
/* ========================================================  DMACFG  ========================================================= */
#define TIMER2_DMACFG_DMATC_Pos           (8UL)                     /*!< DMATC (Bit 8)                                         */
#define TIMER2_DMACFG_DMATC_Msk           (0x1f00UL)                /*!< DMATC (Bitfield-Mask: 0x1f)                           */
#define TIMER2_DMACFG_DMATA_Pos           (0UL)                     /*!< DMATA (Bit 0)                                         */
#define TIMER2_DMACFG_DMATA_Msk           (0x1fUL)                  /*!< DMATA (Bitfield-Mask: 0x1f)                           */
/* =========================================================  DMATB  ========================================================= */
#define TIMER2_DMATB_DMATB_Pos            (0UL)                     /*!< DMATB (Bit 0)                                         */
#define TIMER2_DMATB_DMATB_Msk            (0xffffUL)                /*!< DMATB (Bitfield-Mask: 0xffff)                         */
/* ==========================================================  CFG  ========================================================== */
#define TIMER2_CFG_CHVSEL_Pos             (1UL)                     /*!< CHVSEL (Bit 1)                                        */
#define TIMER2_CFG_CHVSEL_Msk             (0x2UL)                   /*!< CHVSEL (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER5                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CTL0  ========================================================== */
#define TIMER5_CTL0_ARSE_Pos              (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER5_CTL0_ARSE_Msk              (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER5_CTL0_SPM_Pos               (3UL)                     /*!< SPM (Bit 3)                                           */
#define TIMER5_CTL0_SPM_Msk               (0x8UL)                   /*!< SPM (Bitfield-Mask: 0x01)                             */
#define TIMER5_CTL0_UPS_Pos               (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER5_CTL0_UPS_Msk               (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER5_CTL0_UPDIS_Pos             (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER5_CTL0_UPDIS_Msk             (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER5_CTL0_CEN_Pos               (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER5_CTL0_CEN_Msk               (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define TIMER5_CTL1_MMC_Pos               (4UL)                     /*!< MMC (Bit 4)                                           */
#define TIMER5_CTL1_MMC_Msk               (0x70UL)                  /*!< MMC (Bitfield-Mask: 0x07)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER5_DMAINTEN_UPDEN_Pos         (8UL)                     /*!< UPDEN (Bit 8)                                         */
#define TIMER5_DMAINTEN_UPDEN_Msk         (0x100UL)                 /*!< UPDEN (Bitfield-Mask: 0x01)                           */
#define TIMER5_DMAINTEN_UPIE_Pos          (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER5_DMAINTEN_UPIE_Msk          (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER5_INTF_UPIF_Pos              (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER5_INTF_UPIF_Msk              (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER5_SWEVG_UPG_Pos              (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER5_SWEVG_UPG_Msk              (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CNT  ========================================================== */
#define TIMER5_CNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER5_CNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER5_PSC_PSC_Pos                (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER5_PSC_PSC_Msk                (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER5_CAR_CARL_Pos               (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER5_CAR_CARL_Msk               (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER13                                          ================ */
/* =========================================================================================================================== */

