RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
/* =========================================================  CTL0  ========================================================== */
#define TIMER14_CTL0_CKDIV_Pos            (8UL)                     /*!< CKDIV (Bit 8)                                         */
#define TIMER14_CTL0_CKDIV_Msk            (0x300UL)                 /*!< CKDIV (Bitfield-Mask: 0x03)                           */
#define TIMER14_CTL0_ARSE_Pos             (7UL)                     /*!< ARSE (Bit 7)                                          */
#define TIMER14_CTL0_ARSE_Msk             (0x80UL)                  /*!< ARSE (Bitfield-Mask: 0x01)                            */
#define TIMER14_CTL0_SPM_Pos              (3UL)                     /*!< SPM (Bit 3)                                           */
#define TIMER14_CTL0_SPM_Msk              (0x8UL)                   /*!< SPM (Bitfield-Mask: 0x01)                             */
#define TIMER14_CTL0_UPS_Pos              (2UL)                     /*!< UPS (Bit 2)                                           */
#define TIMER14_CTL0_UPS_Msk              (0x4UL)                   /*!< UPS (Bitfield-Mask: 0x01)                             */
#define TIMER14_CTL0_UPDIS_Pos            (1UL)                     /*!< UPDIS (Bit 1)                                         */
#define TIMER14_CTL0_UPDIS_Msk            (0x2UL)                   /*!< UPDIS (Bitfield-Mask: 0x01)                           */
#define TIMER14_CTL0_CEN_Pos              (0UL)                     /*!< CEN (Bit 0)                                           */
#define TIMER14_CTL0_CEN_Msk              (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  CTL1  ========================================================== */
#define TIMER14_CTL1_ISO1_Pos             (10UL)                    /*!< ISO1 (Bit 10)                                         */
#define TIMER14_CTL1_ISO1_Msk             (0x400UL)                 /*!< ISO1 (Bitfield-Mask: 0x01)                            */
#define TIMER14_CTL1_ISO0N_Pos            (9UL)                     /*!< ISO0N (Bit 9)                                         */
#define TIMER14_CTL1_ISO0N_Msk            (0x200UL)                 /*!< ISO0N (Bitfield-Mask: 0x01)                           */
#define TIMER14_CTL1_ISO0_Pos             (8UL)                     /*!< ISO0 (Bit 8)                                          */
#define TIMER14_CTL1_ISO0_Msk             (0x100UL)                 /*!< ISO0 (Bitfield-Mask: 0x01)                            */
#define TIMER14_CTL1_MMC_Pos              (4UL)                     /*!< MMC (Bit 4)                                           */
#define TIMER14_CTL1_MMC_Msk              (0x70UL)                  /*!< MMC (Bitfield-Mask: 0x07)                             */
#define TIMER14_CTL1_DMAS_Pos             (3UL)                     /*!< DMAS (Bit 3)                                          */
#define TIMER14_CTL1_DMAS_Msk             (0x8UL)                   /*!< DMAS (Bitfield-Mask: 0x01)                            */
#define TIMER14_CTL1_CCUC_Pos             (2UL)                     /*!< CCUC (Bit 2)                                          */
#define TIMER14_CTL1_CCUC_Msk             (0x4UL)                   /*!< CCUC (Bitfield-Mask: 0x01)                            */
#define TIMER14_CTL1_CCSE_Pos             (0UL)                     /*!< CCSE (Bit 0)                                          */
#define TIMER14_CTL1_CCSE_Msk             (0x1UL)                   /*!< CCSE (Bitfield-Mask: 0x01)                            */
/* =========================================================  SMCFG  ========================================================= */
#define TIMER14_SMCFG_MSM_Pos             (7UL)                     /*!< MSM (Bit 7)                                           */
#define TIMER14_SMCFG_MSM_Msk             (0x80UL)                  /*!< MSM (Bitfield-Mask: 0x01)                             */
#define TIMER14_SMCFG_TRGS_Pos            (4UL)                     /*!< TRGS (Bit 4)                                          */
#define TIMER14_SMCFG_TRGS_Msk            (0x70UL)                  /*!< TRGS (Bitfield-Mask: 0x07)                            */
#define TIMER14_SMCFG_SMC_Pos             (0UL)                     /*!< SMC (Bit 0)                                           */
#define TIMER14_SMCFG_SMC_Msk             (0x7UL)                   /*!< SMC (Bitfield-Mask: 0x07)                             */
/* =======================================================  DMAINTEN  ======================================================== */
#define TIMER14_DMAINTEN_TRGDEN_Pos       (14UL)                    /*!< TRGDEN (Bit 14)                                       */
#define TIMER14_DMAINTEN_TRGDEN_Msk       (0x4000UL)                /*!< TRGDEN (Bitfield-Mask: 0x01)                          */
#define TIMER14_DMAINTEN_CMTDEN_Pos       (13UL)                    /*!< CMTDEN (Bit 13)                                       */
#define TIMER14_DMAINTEN_CMTDEN_Msk       (0x2000UL)                /*!< CMTDEN (Bitfield-Mask: 0x01)                          */
#define TIMER14_DMAINTEN_CH1DEN_Pos       (10UL)                    /*!< CH1DEN (Bit 10)                                       */
#define TIMER14_DMAINTEN_CH1DEN_Msk       (0x400UL)                 /*!< CH1DEN (Bitfield-Mask: 0x01)                          */
#define TIMER14_DMAINTEN_CH0DEN_Pos       (9UL)                     /*!< CH0DEN (Bit 9)                                        */
#define TIMER14_DMAINTEN_CH0DEN_Msk       (0x200UL)                 /*!< CH0DEN (Bitfield-Mask: 0x01)                          */
#define TIMER14_DMAINTEN_UPDEN_Pos        (8UL)                     /*!< UPDEN (Bit 8)                                         */
#define TIMER14_DMAINTEN_UPDEN_Msk        (0x100UL)                 /*!< UPDEN (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_BRKIE_Pos        (7UL)                     /*!< BRKIE (Bit 7)                                         */
#define TIMER14_DMAINTEN_BRKIE_Msk        (0x80UL)                  /*!< BRKIE (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_TRGIE_Pos        (6UL)                     /*!< TRGIE (Bit 6)                                         */
#define TIMER14_DMAINTEN_TRGIE_Msk        (0x40UL)                  /*!< TRGIE (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_CMTIE_Pos        (5UL)                     /*!< CMTIE (Bit 5)                                         */
#define TIMER14_DMAINTEN_CMTIE_Msk        (0x20UL)                  /*!< CMTIE (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_CH1IE_Pos        (2UL)                     /*!< CH1IE (Bit 2)                                         */
#define TIMER14_DMAINTEN_CH1IE_Msk        (0x4UL)                   /*!< CH1IE (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_CH0IE_Pos        (1UL)                     /*!< CH0IE (Bit 1)                                         */
#define TIMER14_DMAINTEN_CH0IE_Msk        (0x2UL)                   /*!< CH0IE (Bitfield-Mask: 0x01)                           */
#define TIMER14_DMAINTEN_UPIE_Pos         (0UL)                     /*!< UPIE (Bit 0)                                          */
#define TIMER14_DMAINTEN_UPIE_Msk         (0x1UL)                   /*!< UPIE (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define TIMER14_INTF_CH1OF_Pos            (10UL)                    /*!< CH1OF (Bit 10)                                        */
#define TIMER14_INTF_CH1OF_Msk            (0x400UL)                 /*!< CH1OF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_CH0OF_Pos            (9UL)                     /*!< CH0OF (Bit 9)                                         */
#define TIMER14_INTF_CH0OF_Msk            (0x200UL)                 /*!< CH0OF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_BRKIF_Pos            (7UL)                     /*!< BRKIF (Bit 7)                                         */
#define TIMER14_INTF_BRKIF_Msk            (0x80UL)                  /*!< BRKIF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_TRGIF_Pos            (6UL)                     /*!< TRGIF (Bit 6)                                         */
#define TIMER14_INTF_TRGIF_Msk            (0x40UL)                  /*!< TRGIF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_CMTIF_Pos            (5UL)                     /*!< CMTIF (Bit 5)                                         */
#define TIMER14_INTF_CMTIF_Msk            (0x20UL)                  /*!< CMTIF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_CH1IF_Pos            (2UL)                     /*!< CH1IF (Bit 2)                                         */
#define TIMER14_INTF_CH1IF_Msk            (0x4UL)                   /*!< CH1IF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_CH0IF_Pos            (1UL)                     /*!< CH0IF (Bit 1)                                         */
#define TIMER14_INTF_CH0IF_Msk            (0x2UL)                   /*!< CH0IF (Bitfield-Mask: 0x01)                           */
#define TIMER14_INTF_UPIF_Pos             (0UL)                     /*!< UPIF (Bit 0)                                          */
#define TIMER14_INTF_UPIF_Msk             (0x1UL)                   /*!< UPIF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SWEVG  ========================================================= */
#define TIMER14_SWEVG_BRKG_Pos            (7UL)                     /*!< BRKG (Bit 7)                                          */
#define TIMER14_SWEVG_BRKG_Msk            (0x80UL)                  /*!< BRKG (Bitfield-Mask: 0x01)                            */
#define TIMER14_SWEVG_TRGG_Pos            (6UL)                     /*!< TRGG (Bit 6)                                          */
#define TIMER14_SWEVG_TRGG_Msk            (0x40UL)                  /*!< TRGG (Bitfield-Mask: 0x01)                            */
#define TIMER14_SWEVG_CMTG_Pos            (5UL)                     /*!< CMTG (Bit 5)                                          */
#define TIMER14_SWEVG_CMTG_Msk            (0x20UL)                  /*!< CMTG (Bitfield-Mask: 0x01)                            */
#define TIMER14_SWEVG_CH1G_Pos            (2UL)                     /*!< CH1G (Bit 2)                                          */
#define TIMER14_SWEVG_CH1G_Msk            (0x4UL)                   /*!< CH1G (Bitfield-Mask: 0x01)                            */
#define TIMER14_SWEVG_CH0G_Pos            (1UL)                     /*!< CH0G (Bit 1)                                          */
#define TIMER14_SWEVG_CH0G_Msk            (0x2UL)                   /*!< CH0G (Bitfield-Mask: 0x01)                            */
#define TIMER14_SWEVG_UPG_Pos             (0UL)                     /*!< UPG (Bit 0)                                           */
#define TIMER14_SWEVG_UPG_Msk             (0x1UL)                   /*!< UPG (Bitfield-Mask: 0x01)                             */
/* =====================================================  CHCTL0_Output  ===================================================== */
#define TIMER14_CHCTL0_Output_CH1COMCTL_Pos (12UL)                  /*!< CH1COMCTL (Bit 12)                                    */
#define TIMER14_CHCTL0_Output_CH1COMCTL_Msk (0x7000UL)              /*!< CH1COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER14_CHCTL0_Output_CH1COMSEN_Pos (11UL)                  /*!< CH1COMSEN (Bit 11)                                    */
#define TIMER14_CHCTL0_Output_CH1COMSEN_Msk (0x800UL)               /*!< CH1COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER14_CHCTL0_Output_CH1COMFEN_Pos (10UL)                  /*!< CH1COMFEN (Bit 10)                                    */
#define TIMER14_CHCTL0_Output_CH1COMFEN_Msk (0x400UL)               /*!< CH1COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER14_CHCTL0_Output_CH1MS_Pos   (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER14_CHCTL0_Output_CH1MS_Msk   (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER14_CHCTL0_Output_CH0COMCTL_Pos (4UL)                   /*!< CH0COMCTL (Bit 4)                                     */
#define TIMER14_CHCTL0_Output_CH0COMCTL_Msk (0x70UL)                /*!< CH0COMCTL (Bitfield-Mask: 0x07)                       */
#define TIMER14_CHCTL0_Output_CH0COMSEN_Pos (3UL)                   /*!< CH0COMSEN (Bit 3)                                     */
#define TIMER14_CHCTL0_Output_CH0COMSEN_Msk (0x8UL)                 /*!< CH0COMSEN (Bitfield-Mask: 0x01)                       */
#define TIMER14_CHCTL0_Output_CH0COMFEN_Pos (2UL)                   /*!< CH0COMFEN (Bit 2)                                     */
#define TIMER14_CHCTL0_Output_CH0COMFEN_Msk (0x4UL)                 /*!< CH0COMFEN (Bitfield-Mask: 0x01)                       */
#define TIMER14_CHCTL0_Output_CH0MS_Pos   (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER14_CHCTL0_Output_CH0MS_Msk   (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* =====================================================  CHCTL0_Input  ====================================================== */
#define TIMER14_CHCTL0_Input_CH1CAPFLT_Pos (12UL)                   /*!< CH1CAPFLT (Bit 12)                                    */
#define TIMER14_CHCTL0_Input_CH1CAPFLT_Msk (0xf000UL)               /*!< CH1CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER14_CHCTL0_Input_CH1CAPPSC_Pos (10UL)                   /*!< CH1CAPPSC (Bit 10)                                    */
#define TIMER14_CHCTL0_Input_CH1CAPPSC_Msk (0xc00UL)                /*!< CH1CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER14_CHCTL0_Input_CH1MS_Pos    (8UL)                     /*!< CH1MS (Bit 8)                                         */
#define TIMER14_CHCTL0_Input_CH1MS_Msk    (0x300UL)                 /*!< CH1MS (Bitfield-Mask: 0x03)                           */
#define TIMER14_CHCTL0_Input_CH0CAPFLT_Pos (4UL)                    /*!< CH0CAPFLT (Bit 4)                                     */
#define TIMER14_CHCTL0_Input_CH0CAPFLT_Msk (0xf0UL)                 /*!< CH0CAPFLT (Bitfield-Mask: 0x0f)                       */
#define TIMER14_CHCTL0_Input_CH0CAPPSC_Pos (2UL)                    /*!< CH0CAPPSC (Bit 2)                                     */
#define TIMER14_CHCTL0_Input_CH0CAPPSC_Msk (0xcUL)                  /*!< CH0CAPPSC (Bitfield-Mask: 0x03)                       */
#define TIMER14_CHCTL0_Input_CH0MS_Pos    (0UL)                     /*!< CH0MS (Bit 0)                                         */
#define TIMER14_CHCTL0_Input_CH0MS_Msk    (0x3UL)                   /*!< CH0MS (Bitfield-Mask: 0x03)                           */
/* ========================================================  CHCTL2  ========================================================= */
#define TIMER14_CHCTL2_CH1NP_Pos          (7UL)                     /*!< CH1NP (Bit 7)                                         */
#define TIMER14_CHCTL2_CH1NP_Msk          (0x80UL)                  /*!< CH1NP (Bitfield-Mask: 0x01)                           */
#define TIMER14_CHCTL2_CH1P_Pos           (5UL)                     /*!< CH1P (Bit 5)                                          */
#define TIMER14_CHCTL2_CH1P_Msk           (0x20UL)                  /*!< CH1P (Bitfield-Mask: 0x01)                            */
#define TIMER14_CHCTL2_CH1EN_Pos          (4UL)                     /*!< CH1EN (Bit 4)                                         */
#define TIMER14_CHCTL2_CH1EN_Msk          (0x10UL)                  /*!< CH1EN (Bitfield-Mask: 0x01)                           */
#define TIMER14_CHCTL2_CH0NP_Pos          (3UL)                     /*!< CH0NP (Bit 3)                                         */
#define TIMER14_CHCTL2_CH0NP_Msk          (0x8UL)                   /*!< CH0NP (Bitfield-Mask: 0x01)                           */
#define TIMER14_CHCTL2_CH0NEN_Pos         (2UL)                     /*!< CH0NEN (Bit 2)                                        */
#define TIMER14_CHCTL2_CH0NEN_Msk         (0x4UL)                   /*!< CH0NEN (Bitfield-Mask: 0x01)                          */
#define TIMER14_CHCTL2_CH0P_Pos           (1UL)                     /*!< CH0P (Bit 1)                                          */
#define TIMER14_CHCTL2_CH0P_Msk           (0x2UL)                   /*!< CH0P (Bitfield-Mask: 0x01)                            */
#define TIMER14_CHCTL2_CH0EN_Pos          (0UL)                     /*!< CH0EN (Bit 0)                                         */
#define TIMER14_CHCTL2_CH0EN_Msk          (0x1UL)                   /*!< CH0EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CNT  ========================================================== */
#define TIMER14_CNT_CNT_Pos               (0UL)                     /*!< CNT (Bit 0)                                           */
#define TIMER14_CNT_CNT_Msk               (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define TIMER14_PSC_PSC_Pos               (0UL)                     /*!< PSC (Bit 0)                                           */
#define TIMER14_PSC_PSC_Msk               (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CAR  ========================================================== */
#define TIMER14_CAR_CARL_Pos              (0UL)                     /*!< CARL (Bit 0)                                          */
#define TIMER14_CAR_CARL_Msk              (0xffffUL)                /*!< CARL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CREP  ========================================================== */
#define TIMER14_CREP_CREP_Pos             (0UL)                     /*!< CREP (Bit 0)                                          */
#define TIMER14_CREP_CREP_Msk             (0xffUL)                  /*!< CREP (Bitfield-Mask: 0xff)                            */
/* =========================================================  CH0CV  ========================================================= */
#define TIMER14_CH0CV_CH0VAL_Pos          (0UL)                     /*!< CH0VAL (Bit 0)                                        */
#define TIMER14_CH0CV_CH0VAL_Msk          (0xffffUL)                /*!< CH0VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CH1CV  ========================================================= */
#define TIMER14_CH1CV_CH1VAL_Pos          (0UL)                     /*!< CH1VAL (Bit 0)                                        */
#define TIMER14_CH1CV_CH1VAL_Msk          (0xffffUL)                /*!< CH1VAL (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CCHP  ========================================================== */
#define TIMER14_CCHP_POEN_Pos             (15UL)                    /*!< POEN (Bit 15)                                         */
#define TIMER14_CCHP_POEN_Msk             (0x8000UL)                /*!< POEN (Bitfield-Mask: 0x01)                            */
#define TIMER14_CCHP_OAEN_Pos             (14UL)                    /*!< OAEN (Bit 14)                                         */
#define TIMER14_CCHP_OAEN_Msk             (0x4000UL)                /*!< OAEN (Bitfield-Mask: 0x01)                            */
#define TIMER14_CCHP_BRKP_Pos             (13UL)                    /*!< BRKP (Bit 13)                                         */
#define TIMER14_CCHP_BRKP_Msk             (0x2000UL)                /*!< BRKP (Bitfield-Mask: 0x01)                            */
#define TIMER14_CCHP_BRKEN_Pos            (12UL)                    /*!< BRKEN (Bit 12)                                        */
#define TIMER14_CCHP_BRKEN_Msk            (0x1000UL)                /*!< BRKEN (Bitfield-Mask: 0x01)                           */
#define TIMER14_CCHP_ROS_Pos              (11UL)                    /*!< ROS (Bit 11)                                          */
#define TIMER14_CCHP_ROS_Msk              (0x800UL)                 /*!< ROS (Bitfield-Mask: 0x01)                             */
#define TIMER14_CCHP_IOS_Pos              (10UL)                    /*!< IOS (Bit 10)                                          */
#define TIMER14_CCHP_IOS_Msk              (0x400UL)                 /*!< IOS (Bitfield-Mask: 0x01)                             */
#define TIMER14_CCHP_PROT_Pos             (8UL)                     /*!< PROT (Bit 8)                                          */
#define TIMER14_CCHP_PROT_Msk             (0x300UL)                 /*!< PROT (Bitfield-Mask: 0x03)                            */
#define TIMER14_CCHP_DTCFG_Pos            (0UL)                     /*!< DTCFG (Bit 0)                                         */
#define TIMER14_CCHP_DTCFG_Msk            (0xffUL)                  /*!< DTCFG (Bitfield-Mask: 0xff)                           */
/* ========================================================  DMACFG  ========================================================= */
#define TIMER14_DMACFG_DMATC_Pos          (8UL)                     /*!< DMATC (Bit 8)                                         */
#define TIMER14_DMACFG_DMATC_Msk          (0x1f00UL)                /*!< DMATC (Bitfield-Mask: 0x1f)                           */
#define TIMER14_DMACFG_DMATA_Pos          (0UL)                     /*!< DMATA (Bit 0)                                         */
#define TIMER14_DMACFG_DMATA_Msk          (0x1fUL)                  /*!< DMATA (Bitfield-Mask: 0x1f)                           */
/* =========================================================  DMATB  ========================================================= */
#define TIMER14_DMATB_DMATB_Pos           (0UL)                     /*!< DMATB (Bit 0)                                         */
#define TIMER14_DMATB_DMATB_Msk           (0xffffUL)                /*!< DMATB (Bitfield-Mask: 0xffff)                         */
/* ==========================================================  CFG  ========================================================== */
#define TIMER14_CFG_CHVSEL_Pos            (1UL)                     /*!< CHVSEL (Bit 1)                                        */
#define TIMER14_CFG_CHVSEL_Msk            (0x2UL)                   /*!< CHVSEL (Bitfield-Mask: 0x01)                          */
#define TIMER14_CFG_OUTSEL_Pos            (0UL)                     /*!< OUTSEL (Bit 0)                                        */
#define TIMER14_CFG_OUTSEL_Msk            (0x1UL)                   /*!< OUTSEL (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          TIMER15                                          ================ */
/* =========================================================================================================================== */

