RIOT-OS/RIOT/cpu/gd32e23x/include/gd32e23x_periph.h
#define USART_STAT_FERR_Msk              (0x2UL)                   /*!< FERR (Bitfield-Mask: 0x01)                            */
#define USART_STAT_PERR_Pos              (0UL)                     /*!< PERR (Bit 0)                                          */
#define USART_STAT_PERR_Msk              (0x1UL)                   /*!< PERR (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTC  ========================================================== */
#define USART_INTC_WUC_Pos               (20UL)                    /*!< WUC (Bit 20)                                          */
#define USART_INTC_WUC_Msk               (0x100000UL)              /*!< WUC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_AMC_Pos               (17UL)                    /*!< AMC (Bit 17)                                          */
#define USART_INTC_AMC_Msk               (0x20000UL)               /*!< AMC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_EBC_Pos               (12UL)                    /*!< EBC (Bit 12)                                          */
#define USART_INTC_EBC_Msk               (0x1000UL)                /*!< EBC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_RTC_Pos               (11UL)                    /*!< RTC (Bit 11)                                          */
#define USART_INTC_RTC_Msk               (0x800UL)                 /*!< RTC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_CTSC_Pos              (9UL)                     /*!< CTSC (Bit 9)                                          */
#define USART_INTC_CTSC_Msk              (0x200UL)                 /*!< CTSC (Bitfield-Mask: 0x01)                            */
#define USART_INTC_LBDC_Pos              (8UL)                     /*!< LBDC (Bit 8)                                          */
#define USART_INTC_LBDC_Msk              (0x100UL)                 /*!< LBDC (Bitfield-Mask: 0x01)                            */
#define USART_INTC_TCC_Pos               (6UL)                     /*!< TCC (Bit 6)                                           */
#define USART_INTC_TCC_Msk               (0x40UL)                  /*!< TCC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_IDLEC_Pos             (4UL)                     /*!< IDLEC (Bit 4)                                         */
#define USART_INTC_IDLEC_Msk             (0x10UL)                  /*!< IDLEC (Bitfield-Mask: 0x01)                           */
#define USART_INTC_OREC_Pos              (3UL)                     /*!< OREC (Bit 3)                                          */
#define USART_INTC_OREC_Msk              (0x8UL)                   /*!< OREC (Bitfield-Mask: 0x01)                            */
#define USART_INTC_NEC_Pos               (2UL)                     /*!< NEC (Bit 2)                                           */
#define USART_INTC_NEC_Msk               (0x4UL)                   /*!< NEC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_FEC_Pos               (1UL)                     /*!< FEC (Bit 1)                                           */
#define USART_INTC_FEC_Msk               (0x2UL)                   /*!< FEC (Bitfield-Mask: 0x01)                             */
#define USART_INTC_PEC_Pos               (0UL)                     /*!< PEC (Bit 0)                                           */
#define USART_INTC_PEC_Msk               (0x1UL)                   /*!< PEC (Bitfield-Mask: 0x01)                             */
/* =========================================================  RDATA  ========================================================= */
#define USART_RDATA_RDATA_Pos            (0UL)                     /*!< RDATA (Bit 0)                                         */
#define USART_RDATA_RDATA_Msk            (0x1ffUL)                 /*!< RDATA (Bitfield-Mask: 0x1ff)                          */
/* =========================================================  TDATA  ========================================================= */
#define USART_TDATA_TDATA_Pos            (0UL)                     /*!< TDATA (Bit 0)                                         */
#define USART_TDATA_TDATA_Msk            (0x1ffUL)                 /*!< TDATA (Bitfield-Mask: 0x1ff)                          */
/* ==========================================================  CHC  ========================================================== */
#define USART_CHC_EPERR_Pos              (8UL)                     /*!< EPERR (Bit 8)                                         */
#define USART_CHC_EPERR_Msk              (0x100UL)                 /*!< EPERR (Bitfield-Mask: 0x01)                           */
#define USART_CHC_HCM_Pos                (0UL)                     /*!< HCM (Bit 0)                                           */
#define USART_CHC_HCM_Msk                (0x1UL)                   /*!< HCM (Bitfield-Mask: 0x01)                             */
/* =========================================================  RFCS  ========================================================== */
#define USART_RFCS_RFFINT_Pos            (15UL)                    /*!< RFFINT (Bit 15)                                       */
#define USART_RFCS_RFFINT_Msk            (0x8000UL)                /*!< RFFINT (Bitfield-Mask: 0x01)                          */
#define USART_RFCS_RFCNT_Pos             (12UL)                    /*!< RFCNT (Bit 12)                                        */
#define USART_RFCS_RFCNT_Msk             (0x7000UL)                /*!< RFCNT (Bitfield-Mask: 0x07)                           */
#define USART_RFCS_RFF_Pos               (11UL)                    /*!< RFF (Bit 11)                                          */
#define USART_RFCS_RFF_Msk               (0x800UL)                 /*!< RFF (Bitfield-Mask: 0x01)                             */
#define USART_RFCS_RFE_Pos               (10UL)                    /*!< RFE (Bit 10)                                          */
#define USART_RFCS_RFE_Msk               (0x400UL)                 /*!< RFE (Bitfield-Mask: 0x01)                             */
#define USART_RFCS_RFFIE_Pos             (9UL)                     /*!< RFFIE (Bit 9)                                         */
#define USART_RFCS_RFFIE_Msk             (0x200UL)                 /*!< RFFIE (Bitfield-Mask: 0x01)                           */
#define USART_RFCS_RFEN_Pos              (8UL)                     /*!< RFEN (Bit 8)                                          */
#define USART_RFCS_RFEN_Msk              (0x100UL)                 /*!< RFEN (Bitfield-Mask: 0x01)                            */
#define USART_RFCS_ELNACK_Pos            (0UL)                     /*!< ELNACK (Bit 0)                                        */
#define USART_RFCS_ELNACK_Msk            (0x1UL)                   /*!< ELNACK (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                           WWDGT                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CTL  ========================================================== */
#define WWDGT_CTL_WDGTEN_Pos              (7UL)                     /*!< WDGTEN (Bit 7)                                        */
#define WWDGT_CTL_WDGTEN_Msk              (0x80UL)                  /*!< WDGTEN (Bitfield-Mask: 0x01)                          */
#define WWDGT_CTL_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define WWDGT_CTL_CNT_Msk                 (0x7fUL)                  /*!< CNT (Bitfield-Mask: 0x7f)                             */
/* ==========================================================  CFG  ========================================================== */
#define WWDGT_CFG_EWIE_Pos                (9UL)                     /*!< EWIE (Bit 9)                                          */
#define WWDGT_CFG_EWIE_Msk                (0x200UL)                 /*!< EWIE (Bitfield-Mask: 0x01)                            */
#define WWDGT_CFG_PSC_Pos                 (7UL)                     /*!< PSC (Bit 7)                                           */
#define WWDGT_CFG_PSC_Msk                 (0x180UL)                 /*!< PSC (Bitfield-Mask: 0x03)                             */
#define WWDGT_CFG_WIN_Pos                 (0UL)                     /*!< WIN (Bit 0)                                           */
#define WWDGT_CFG_WIN_Msk                 (0x7fUL)                  /*!< WIN (Bitfield-Mask: 0x7f)                             */
/* =========================================================  STAT  ========================================================== */
#define WWDGT_STAT_EWIF_Pos               (0UL)                     /*!< EWIF (Bit 0)                                          */
#define WWDGT_STAT_EWIF_Msk               (0x1UL)                   /*!< EWIF (Bitfield-Mask: 0x01)                            */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* GD32E23X_PERIPH_H */


/** @} */ /* End of group GD32E230 */

/** @} */ /* End of group  */
